["Titre: Service client inexistant Texte: Service client inexistant. Toutes sont des promesses quand vous ouvrez votre compte, mais là le service de la banque termine. Réponses tardives et authoritaires du service client. Impossible de clôturer un compte. J'ai subi presque 3,000 euros de pertes entre le 10 decembre que j'ai notifié de mon intention de cloturer mon compte et le 15 janvier quand cela est devenu effectif. Evitez cette banque. la seule réponse que vous recevrez est “gaslighting” à l’extrême.", "Titre: Service impeccable Texte: Aucun problème rencontré depuis plusieurs années dans cette banque.Service impeccable en cas de nécessité.Dernièrement, incompatibilité entre les nouvelles cartes VISA débit et l'application Payconiq. Ce n'est toutefois pas un problème propre à la banque, mais à VISA débit.Les agences étant rares (ce qui permet la gratuité des comptes), il n'est pas aisé de déposer de l'argent liquide.", "Titre: L’application de la banque ainsi que la… Texte: L’application de la banque ainsi que la gestion des comptes et de la carte est bien. Mais c’est le seul point positif. Service client Inexistant ! J’attend une réponse depuis plus de 2 mois ! Impossible de clôturer votre compte chez eux. Ils demandent de renvoyer un document propre à eux et quand vous le faites aucune réponse… bien vite que cette banque ferme !", "Titre: Du bon et du moins bon Texte: L'appli fonctionne tout à fait correctement, le compte est gratuit, la carte Visa aussi, les opérations rapportent même 5 cents (une banque qui vous paie, c'est inédit) et le taux d'épargne, même s'il n'est pas extraordinaire, se situe parmi les plus élevés de Belgique. Les contacts téléphoniques sont parfois rapides, mais certains jours j'ai fini par raccrocher, dépité, après 25 minutes d'attente. Probablement un manque de personnel, comme dans toutes les banques; ce n'est pas mieux ailleurs.Les simulations pour les crédits hypothécaires sont également très faciles.Par contre, je regrette terriblement de ne plus pouvoir faire de paiements d'ami à ami par QR code (j'utilisais cette fonction 5 à 10x par semaine avec mon autre banque) de même que je suis extrêmement frustré de ne plus pouvoir payer avec mon gsm ou avec ma montre. Ces manquements peuvent paraître futiles par rapport aux louanges du début de message mais je suis tellement limité dans mon utilisation quotidienne que je réfléchis à rechanger de banque... avec regret.Peut-être que si nous sommes plusieurs à relayer le même message KT pourrait revoir sa politique? Je croise les doigts.", "Titre: Inscription en ligne sans suite Texte: Inscription réalisée sur le site de Keytrade il y a plus de deux semaines, avec envoi par email de la copie de carte identité à opening at keytradebank.com en précisant bien le n° du keypack. Malgré un rappel, toujours pas de réponse hormis un accusé de réception automatique de leur part. A la lecture des avis sur Trustpilot, je pense que ça vaut mieux.", "Titre: bien pour les comptes titres Texte: j'apprécie le fait que le compte soit gratuit par contre quel lenteur pour les virements interbancaires", "Titre: Service client inexistant + Compliance lacunaire = Gros risque pour le client Texte: Dommage qu'on ne puisse pas attribuer une note de 0/5.Service client inexistant. Service compliance débordé ce qui fait craindre qu'un contrôle de la BNB vienne bloquer tous les comptes. Un transfert de titres belgo-belge a duré plus de 4 mois. Personne ne répond à vos emails, personne ne traite votre dossier. J'ai fini pas renoncer et j'ai transféré vers une autre banque. Je ne comprends pas comment cette banque n'a pas encore fait faillite ou été condamnée par les autorités de contrôle. Je ne serais vraiment pas à mon aise si j'avais de l'argent dans cette banque...", "Titre: Support ? Quel support ? Texte: Le point noir est l’absence de véritable service clientèle. Tentez l’expérience. Voyez après combien de jours vous avez une réponse à un email et combien de temps vous devez attendre à leur centre d’appels …", "Titre: Banque parfaite. Super contente Texte: Banque parfaite.vous êtes payé à faire des virements. Interface simple. S’il y a un souci, réponse rapide. Personnellement, ça fait 2 ou 3 ans que je l’ai et j’en suis super contente.", "Titre: Excellente banque gratuite Texte: Banque complètement gratuite (y compris les cartes), avec des taux sur les comptes épargne parmi les plus élevés de Belgique.Les 5 cents bonus par opération : c’est top.J’aime aussi la facilité de configurer un crédit hypothécaire.Dommage que les codes QR ne sont pas dispo pour faire des versements entre amis (bancontact/payconiq).Il manque aussi les virements instantanés et le login itsme. Mais ça reste un excellente banque que je recommande vivement.", "Titre: Retard technologique. Texte: Banque pionniere dans son secteur/niche il y a une dizaine d'années et très aimée par son \"public\".Helas le groupe qui l'a achetée la laisse en décrépitude et dépérir. Pas de possibilité de s'y connecter via Itsme, mails Hyper harcèlents et intrusifs pour fournir des données personnelles socio-économiques et financières.L'interface pas très ergonomique non plus.Bref, toute une politique orientée pour faire fuir le client au plus vite.Ça m'attriste fortement de voir ca😪😪😪.", "Titre: Aucune suite donnée après une… Texte: Aucune suite donnée après une inscription en ligne… Support complètement absent après plusieurs rappels malgré l’envoi de données personnelles", "Titre: Demande de nouvelle carte visa a été… Texte: Demande de nouvelle carte visa a été très facile et intuitive.L'ouverture d'un compte épargne pour ma fille de 2 ans et demi a été très fluide aussi. En plus c'est très pratique en tant que tuteur, d'avoir tout dans le même interface.J'emploie quotidiennement aussi l'application KeyTrade, qui est très bien faite et régulièrement mis à jour.Merci KeyTrade !!", "Titre: Facilite et visibilité des comptes Texte: Facilite et visibilité des comptes, réponse rapide en cas de question, aucun frais, même récompenses en cas de paiements, beaucoup de bons articles et partages d’informations.  Encore juste de temps en temps manque de facilité de l’utilisation du scan ou payconiq.  Merci en tous cas pour une très bonne banque, quand on voit le coût d’une autre banque et le manque d’agence et de service aujourd’hui.", "Titre: Service back office défaillant Texte: Le  service back office de cette banque est défaillant: impossibilité de les joindre par téléphone et leur service qualité trouve tout à fait normal de s'octroyer un mois de délai pour répondre à une réclamation!Voir leur réponse ci-dessous:Si votre e-mail concerne une réclamation, elle sera traitée endéans les délais suivants :,Pour les réclamations qui concernent les services et opérations de paiement : 15 jours ouvrables pour apporter une réponse à l’ensemble des points de la réclamation (sans dépasser 35 jours ouvrables si une réponse ne peut être donnée dans les quinze jours ouvrables pour des raisons échappant au contrôle de Keytrade Bank) ;Pour les autres types de réclamation : 4 semaines.", "Titre: Une des meilleures banque Texte: Certainement une des meilleures banque en ligne de Belgique. Cet avis est basé sur une utilisation de Keytrade depuis plus de 20 ans.La banque est très réactive en cas de problèmes (rares).Bien sûr tout n'est pas parfait, des améliorations peuvent certainement être faite du côté de l'application mobile afin d'avoir accès aux mêmes possibilités que sur pc.On pouvait éventuellement reprocher à keytrade de n'avoir qu'une seule agence, mais étant donné la difficulté d'avoir un contact sur rendez-vous dans les autres banques le reproche ne se justifie plus.Keyplan est un système très intéressant.", "Titre: Banque arnaqueuse et intrusive Texte: Comme l'indique une autre personne, mails hyper harcèlants et intrusifs pour fournir des données personnelles socio-économiques et financières. On vous demande pourquoi vous faites tel virement, de justifier l'origine de fonds qui proviennent d'une autre banque belge, qui a donc déjà effectué le contrôle.Et comme a un moment j'ai décidé de ne plus leur répondre car c'est une intrusion grave dans ma vie privée, ils m'ont donné 2 mois pour transférer mon argent vers une autre banque et ils vont clôturer la relation.Sous prétexte de la législation KYC (know your customer), ils veulent savoir ce que je fais avec MON ARGENT.Et quand on demande de parler avec un employé de ce département, on vous dit qu'ils ne peuvent pas vous parler pour des raisons de sécurité, n'importe quoi! Que pourrais-je faire à quelqu'un qui ne me communique pas son nom?C'est une véritable arnaque, comme cela ils ne sont pas obligés de payer la prime de fidélité sur l'épargne puisqu'ils ne me permettent pas de laisser mon argent 1 an. Ce sont des voleurs.Fuyez cette banque!", "Titre: Conseil investissement Texte: J'ai investi en un seul versement dans un Keyplan en février 2022.Mon investissement a perdu beaucoup de valeur la première année. Je suis conscient que le marché des actions est plus risqué mais j'ai suivi vos conseils de ne pas garder trop de liquidités sur un compte courant. Il semblerait que je viens de récupérer, après deux ans, la totalité des fonds investis j'espère que la tendance à la hausse va se poursuivre.", "Titre: Je cherchais une banque qui ajusta les frais en fonction du service potentiel Texte: Je cherchais une banque qui ne ponctionne pas sans cesse aux épargnants que nous sommes de l'argent au travers de frais sur tout et n'importe quoi en réduisant parallèlement le service à sa plus simple expression.Bien sûr, vous n'avez pas d'agences mais à quoi servent encore ces agences qui n'accueillent quasi que les riches.", "Titre: Client depuis pratiquemment 10 ans Texte: Client depuis pratiquemment 10 ans, seulement banking.Je suis très content de la banque, elle est entièrement entièrement gratuite et paye pour chaque transaction alors que la plupart des autres banques nous font payer un certain montant mensuel pour les mêmes services.Les 3 types de cartes VISA sont gratuites, sous conditions.Keytrade est souvent dans les premières banques a relever le taux des comptes épargnes.J'ai eu quelques problèmes de cartes bloquées qui ont été difficiles à débloquer, et le service clientèle qui est assez limité par téléphone le soir, ce pourquoi je retire une étoile.Expériencience positive dans l'ensemble.", "Titre: Bien, mais peut mieux faire Texte: - Le service téléphonique pourrait être renforcé, car c'est le premier interlocuteur avec le client, c'est la vitrine de la banque.- L'ouverture de compte est parfois très longue, le compte à vue est gratuit et rapporte 0.05€/ transaction ce qui est exceptionnel.- Le choix des produits de financement est complet, mais le prix des transactions n'est plus compétitif par rapport à la concurrence.", "Titre: J'en était très satisfait Texte: Cela fait plus de 25 ans que je suis chez Keytrade Bank qui ne s’appelait pas ainsi au début (Banque de commerce de Bruxelles puis Realbank).J'en était très satisfait jusqu'à ce quelle soit reprise par Crédit mutuel Arkéa. Depuis, il doit y avoir trop peu de personnel car tout prend un temps infini et les problèmes deviennent récurrents. Les cartes de débit ont été remplacées et ne fonctionnent plus avec Payconiq. Mandat sur compte supprimé sans prévenir et plutôt que de résoudre le problème il faut refaire une demande de mandat qui prend une éternité.", "Titre: - aucun gestionnaire personnel ne nous est attribué, donc très difficile de régler des problèmes quels qu'ils soient. - Questions indiscrètes quant aux transactions quels qu'ils soient. - Blocage du c Texte: - aucun gestionnaire personnel ne nous est attribué, donc très difficile de régler des problèmes quels qu'ils soient. - Questions indiscrètes quant aux transactions quels qu'ils soient. - Blocage du compte durant 1 semaine et demi sans raison valable ni explication. Déplorable quand on a que ce compte pour toute ressource.  - Non exécution de virement durant plus de 10 jours alors que déjà débité de mon compte... - Refus de l'octroi d'une carte de crédit, alors que cette dernière a toujours été remboursée à heure et à temps depuis plus de 10 ans. Pourquoi ?? A savoir que cette carte était devenue défectueuse (la puce), raison pour laquelle elle a été redemandée. Déplorable !- Aucun contact possible avec votre service Know your Customer KYC, qui bloque les comptes. - Keytrade n'adhère pas à la mobilité interbancaire comme toute autre banque Belge. Lamentable - Étant mandataire sur un compte Keytrade de mon compagnon, il est parti pour les mêmes raisons.   - la grossièreté de vos employés. - le délai pour transférer mon compte professionnel est trop long (plus de 2 semaines). pourquoi ?", "Titre: Banque au top avec un service disponible le soir Texte: Je suis client de cette banque depuis quelques années et le service est nickel. En plus les comptes et cartes sont gratuits. Seul bémol: la carte de débit actuelle ne permet plus de payer entre amis via l’application Bancontact/payconiq.", "Titre: Je suis très content de Keytrade bank… Texte: Je suis très content de Keytrade bank et de ses services . Je ne comprends pas toujours les avis négatifs. Cette banque est vraiment gratuite et les cartes aussi: j'ai fait 12 opérations avec ma Visa Gold en date du 24 avril 2024 et le compteur m'indique que la carte de crédit est gratuite jusqu'au 20 mars 2026, 2025 gratuit + 3 mois offerts.Les services téléphoniques sont bons et dernièrement je n'ai plus eu à attendre 30 minutes comme il y a 2 mois: 5 minutes tout au plus.Et utiliser la carte Visa Débit peut vous rapporter jusqu'à 2,50 euros par mois. Bravo à cette banque .", "Titre: Un goût de trop peu Texte: BonjourJe suis très satisfait quand à l'idée de base de keytrade de payer ses clients pour chaque opérations.Cependant il m'est arrivé d'avoir quelques soucis lors de transfert vers/venant d'autres banques, par rapport à la durée des transferts.Et il m'est toujours impossible d'inscrire/enregistré mon compte/carte dans l'App payconiq.Appart ça je vous remercie de la qualité de vos services.", "Titre: Je suis client chez keytrade depuis… Texte: Je suis client chez keytrade depuis plus de 20 ans ainsi que feu ma société.Une banque efficace, généreuse, formatrice (en gestion boursière) et la plus efficace ! Et c’est un ancien directeur indépendant d’agence bancaire qui vous l’écrit !A l’époque, j’en avais parlé à mon président et celui-ci de me répondre : « cette banque ne tiendra pas… ». Merci à Keytrade bank et conseil à ceux qui se plaignent de leurs banques, CHANGEZ !La portabilité bancaire existe.", "Titre: Aucun problème avec les transactions… Texte: Aucun problème avec les transactions boursières, elles sont effectuées rapidement, beaucoup de produits sont disponible.Un (gros) bémol concernant le compte courant banque,Les transactions sont lentes. Parfois la carte de débit est refusée pour solde insuffisant alors que cela n'est pas correct mais que simplement l'alimentation du compte a été effectuée moins de 24h auparavant", "Titre: Gratuit mais pas fiable Texte: Banque qui ne coûte rien mais services pas fiables.Délais assez longs entre la mise à jour du solde et des paiements et la réalité, délais assez longs pour les virements.Des bugs d'affichage ou des virements annulés sans notification. Bref il ne faut pas compter sur cette banque pour des opérations importantes.Pour des petits paiements par carte au quotidien, ça peut suffire.PS: non le service client n'a pas pris la peine de régler mon problème ou cherché à s'améliorer, il a même cessé de répondre après m'avoir expliqué que non : Keytrade ne prévoit pas de dédommagement pour mon genre de problème.", "Titre: Au top sauf pour le service clientèle ! Texte: Client depuis plus de 10 ans, je constate qu'autrefois au top sur tous les points, aujourd'hui il existe de grosses lacunes au niveau du service clientèle. Injoignables par téléphone (après 30 min j'ai abandonné), ils mettent 2 semaines pour répondre par email... c'est juste inconcevable pour une banque en ligne. N'ayant pas d'agences, Keytrade bank se doit d'être irréprochable sur ce point.Pour le positif, c'est une banque totalement gratuite et qui vous fera gagner beaucoup d'argent. Croyez-moi ;)Donc je retire une étoile pour leur service clientèle décevant et espère qu'ils feront tout pour remédier à cela.", "Titre: L’app fonctionne bien est répond à mes… Texte: L’app fonctionne bien est répond à mes besoins mais j’aimerais :- pouvoir avoirs des messages structurés par défaut - pouvoir utiliser Apple Pay - meilleur support de payconiq", "Titre: Plus que satisfait … Texte: Cela fait 8 mois que j’ai ouvert compte et épargne chez Keytrade. J’ai utilisé le bankswitch sans problème. Mes placements Keytprivate et keytplan sont parfaitement gérés ( la conjoncture est favorable) on sait que \"jouer\" en bourse est une prise de risque par rapport à un compte épargne. C’est au client à surveiller mais les vidéos mensuelles de Keytprivate nous renseignent bien sur l’évolution et le suivi. J’ai également ouvert un compte titres en suivant là les conseils de test achat. Sur ces 8 mois, il a progressé de 10%. Et la gestion via tablette ou smartphone est très conviviale. Et aucun problème en utilisant carte de débit ou de crédit en ligne ou en magasin même à l’étranger. Super sécurité via soft et hardkeyAmplement satisfait", "Titre: Banque en ligne à conseiller Texte: - Site: Site web clair, fonctionnels et efficaces. - Placements: L'éventail de produits de placement est très large et n'est pas limité à des produits maisons comme dans de nombreuses banques. - Prêts: L'obtention d'un prêt hypothécaire est entièrement possible via le web.", "Titre: Une banque qui rémunère les… Texte: Une banque qui rémunère les transactions effectuées au lieu de faire payer des frais de gestion coca donne le ton. Gros efforts pour rendre l’app beaucoup plus “user friendly” récemment.", "Titre: 15 années de fidélité balayées d'un revers Texte: 15 années que je suis client chez eux, et le jour de ma paye ils décident de clôturer mon compte, impossible d'avoir un manager et juste des opérateurs qui ne savent pas dire pourquoi le compte est clôturé et vous raccrochent littéralement au nez ou vous parlent de départements x ou y comme s'ils étaient des centaines sans vous dire lequel alors que c'est KYC qui gère ces décisions, après vérifications des spams, un seule mail reçu de leur part 2 mois avant indiquant que mes critères ne correspondaient pas à leur politiques (je ne suis pas résident belge mais frontalier). aucun appel, aucune solution de basculement, une clôture de compte net et sans appel. Et aucune explications, aucune réponse, ils vous laissent juste dans la panade avec vos prélèvements et vos virements, sans plus aucun accès a vos informations. Rappelez vous 15 ans sans le moindre soucis, donc ça peut vous arriver a tous !!!! Fuyez cette banque !!!!", "Titre: Extraits de banque Texte: Lorsqu'on demande la création et le téléchargement d'un extrait de banque concernant les dernières opérations du compte courant, il faut souvent s'armer de patience !.. De plus, ces extraits sont fort lourds en octets (+ d'un MO).", "Titre: Une banque pas cher et correct Texte: Il y a quelques années, j'ai pris un prêt hypothécaire chez Keytrade à un taux relativement bas. J'ai donc été forcé de quitter ma banque précédente, ING, et je regrette ne pas l'avoir fait plus tôt. Le compte est gratuit alors que j'avais d'énormes frais non transparants chez ING avant. Keytrade me donne même la carte de crédit gratuite, incluyant plein d'avantages comme une assurance voyage. Les frais pour retirer&échanger de l'argent hors de l'UE sont également relativement bas. Leur application fonctionne bien. Ça n'inclut pas Payconiq mais j'utilise l'application de Payconiq pour ça. Le seul bémol éventuel est que leurs frais pour faire des transactions boursières sont un peu plus élevés que des acteurs spécialisés comme DEGIRO.Les quelques fois que j'ai eu des questions chez Keytrade, j'ai reçu une réponse vite et adéquate. Désormais, je recommande Keytrade à tout le monde.", "Titre: Virements Texte: J'aime la façon d'authentifier les virements sur le site.La façon dont l'appli gère les virements pourrait être plus conviviale. On devrait pouvoir modifier facilement les limites. Les virements entre comptes propres devraient être instantanés.", "Titre: Toujours mieux Texte: Je suis dans cette banque depuis des années maintenant.Je n'ai rien à redire. C'était déjà très bien et cela s'améliore encore.", "Titre: Banque facilement accessible sur le net… Texte: Banque facilement accessible sur le net  et tout y est presque gratuit   , les taux d'intérêts  sont corrects par rapport aux autres banques , gestion d'un portefeuille d'actions assez facile avec quelques conseils  précieux", "Titre: Très satisfait de mon expérience Texte: Sachant qu'il s'agit d'une banque en ligne qui vous rémunère pour vos transactions, qui offre des taux d'épargne nettement plus intéressants que les grandes institutions il faut comprendre qu'ils cherchent à maîtriser leurs coûts...Je suis entièrement satisfait de mon expérience depuis 2 ans, l'app est régulièrement mise utilement à jour, les transactions sont maintenant enregistrées instantanément, ... Bravo, continuez comme ça !", "Titre: Dans l'ensemble peut mieux faire au… Texte: Dans l'ensemble peut mieux faire au niveau de l'application du programme, certaines fonctions sont lourdes, c'est vrai pourquoi faire simple quand on peut faire compliqué. Mais surtout, cette banque ce croit au- dessus des lois, nous avons un compte commun et pour mon épouse, il refuse de donner les infos techniques pour qu'elle puisse utiliser sa carte. Chercher l'erreur !!!!!!", "Titre: Téléphone KEYTRADE aux abonnés absents Texte: J’ai téléphone au leur numéro 02/6790000, le service vous laisse attendre, au point que vous finissez de raccrocher.Pour une société de trading boursier, où parfois la rapidité d’exécution est primordiale, ce service clientèle est déplorable. Keytrade va perdre des clients s’il n’améliore pas leur service. C’est sûr.", "Titre: wouw.. Texte: wouw... ancien client de Keytrade (depuis sa création, avec les frères Surstrassen et Grégoire de Streel),e travaillant à l'époque pour eux via leur agence de communication, j'avais adoré l'esprit d'équipe, le dynamisme, le  sens du contact ! là.. à lire les commentaires, alors que je cherche une nouvelle banque, je crois que je vais changer de cap.. mais aujourd'hui, il semble que plus aucune banque ne soit encore dotée de ce sens du contact, de disponibilité...  je continue à chercher...", "Titre: Je reviens sur l'expérience Texte: Je reviens sur l'expérience, et bien malgré le bon nombre d'avis négatifs, personnellement je ne peux que recommander Keytrade Bank, j'ai tout reçu par courrier, et il est très simple d'activer son hardkey ainsi que sa carte de débit. Donc, perso pour une banque gratuite, je ne peux que recommander !!! À présent, je croise les doigts, j'ai fait une demande pour une carte VISA Classic j'espère que celle-ci sera acceptée, ainsi je pourrai quitter définitivement BPOST Banque qui va migrer chez BNP Parisbas - Fortis.", "Titre: Service clients à fuir Texte: Si vous avez le malheur de rencontrer un problème d'ordre informatique avec Keytrade, ne comptez pas sur le support de leur service clients.Après de nombreuses explications sur le problème rencontré (génération de QR codes incorrects ne me permettant pas de me connecter à l'application mobile), le service clients n'a jamais daigné transférer ma requête au service compétent. J'ai reçu à chaque fois la même réponse, à savoir avez-vous bien renseigné votre identifiant en majuscules et agréé à la collecte de données ? La dernière réponse disait même : ce n'est pas un bug mais quelque chose que vous faites mal. Or, ce n'est pas le 1er compte que je créais chez Keytrade.Bref, taux intéressants mais à quel prix ? Un service clients qui ne semble pas au courant des nouvelles mises à jour de l'application mobile et, des silos infranchissables entre le support clients et l'équipe IT compétente.", "Titre: Scam Texte: Pratiques commerciales douteuses. Leurs publicités incitent à créer un compte pour pouvoir profiter de leurs cartes de crédit avantageuses. Après création, un email automatique vous informe qu'ils refusent de vous accorder la carte sans préciser de raison. Scam.", "Titre: Mise à jour pénible sur smartphone Texte: Rien à dire sur la banque et les investissements.Par contre, sur le smartphone, chaque mise à jour nécessite une réinstallation complète avec redéfinition du profil. C'est pénible. Aussi, j'évite d'installer les mises à jour.", "Titre: les informations sont claires Texte: les informations sont claires le site est rapide et d'un usage commodeclient depuis 20 ans j'apprécie le service sérieux et professionnel pour un coût raisonnable.", "Titre: service clients desaparecido Texte: D'habitute je n'ai pas de problèmes , malgré leur difficulté technique à accéder les comptes. mais depuis quelque jours impossible de communiquer avec cette banque. service clients impossible à joindre, ni par e-mail, ni par téléphone. là àa fait 30 min au téléphone à attendre. une fois la connexion retablié, je vais cloturer mes comptes.", "Titre: La galère Texte: Depuis plus d'un mois et demi mon mari n'a plus de carte bancaire et malgré le fait que nous telephonions rien à faire elle n'arrive pas. De plus avec ma nouvelle carte bancontact plus de possibilités d'utiliser payconiq....tout en sachant que les distributeurs de cash disparaissent...Merci pour votre réponse qui ne resoud absolument pas le problème car la carte n'est toujours pas arrivée grrr", "Titre: client depuis des années et le service… Texte: client depuis des années et le service baisse année après année. Des semaines de délais pour augmenter un plafond visa alors qu'avant c'était réglé en quelques jours, une opposition de carte qui reste sans réponse malgré des mails de confirmation refusés, des cartes qui ne passent pas à l'étranger et dans des parkings, UNE HONTE ! La dernière en date est un prêt hypothécaire qui est impossible à réaliser car le site ne fonctionne pas et personne de disponible au téléphone. Keytrade c'est fini pour moi, on comprend maintenant pourquoi ce sont les moins chers du marchés...", "Titre: Client mécontent Texte: Bonjour,J'ai bloqué ma hardkey qui me permet de consulter mon compte, j'ai fais les démarches pour résoudre le problème, ai suivi à la  lettre leurs instructions, cela fait plus d'un mois et toujours pas de solution , pas de nouvelles de leur part. Réponse au téléphone inexistante même après  vingt minute d'attente. J'ai demandé la clôture de mon compte, curieux de voir leur réactivité", "Titre: Depuis la nouvelle carte(obligatoire)… Texte: Depuis la nouvelle carte(obligatoire) plus possible d'employer l'app payconiq... Indigne d'une institution qui s'appelle banque...Contact téléphonique ne sait pas me dire si ca va être résolu ou pas..", "Titre: Contact, svp ! Texte: Cela fait 3 mois que je tente désespérément d´obtenir un contact digne de ce nom 🥺Impossible d'effectuer un transfert de compte d´épargne vers compte à vue ... alors que je désirais acheter des bons d´État avec cet argent début septembre, il est toujours bloqué 😬 Par ailleurs, il y a quelques jours, j'ai égaré mon digipass (malheur à moi!) Pas de réponse au téléphone après 20´ d´attente, rien d´autre qu´une réponse automatique aux mails ou au formulaire de contact...La soi-disant demande automatique de nouveau digipass via Itsme aboutit à une page d´erreur En attendant, j´ai déjà reçu des rappels pour mes factures impayées 😲", "Titre: Honnêtement.... Texte: Une banque où les comptes à vue sont gratuits ainsi que les cartes de débit et de crédit, c'est super.Encore mieux, à chaque virement effectué, vous êtes remboursé de 5 Euro Cents. Et la cerise sur le gâteau, les taux d'intérêt des comptes d'épargne sont plutôt pas mal; pas les meilleurs mais sympa quand même.", "Titre: Depuis hier problème technique… Texte: Depuis hier problème technique impossible de faire un virement ! Toujours pas résolu… De plus quand on veut les contacter par téléphone le temps moyen de réponse est de plus de40 minutes…. On vous remballe en 5 minutes sans avoir aider et surtout on ne dit pas au revoir ou quoique ce soit et on ne raccroche pas afin de ne pas laisser dévaluation négative… service lamentable !!!J’ai eu qq1 qui m’a affirmé que tout serait en ordre ce n’est toujours pas résolu… Bravo !", "Titre: Depuis des années Texte: Depuis des années, j'apprécie fortement, tout est parfait. Dommage pour la nouvelle présentation de l'appli qui à mon goût est trop lourde et lente, je préférais la  précédente. Merci.", "Titre: Très déçu. Texte: Très déçu.Service clients injoignable, et peu sympathique voir désagréable.Les demandes administratives sont d'une lenteur innommable.Ce message recevra une réponse du style, votre satisfaction est importante pour nous, etc...Mais en fait c'est ainsi depuis des années.Bref, ne croyez pas les pubs pour Keytrade, elles sont à des kilomètres de la réalité.Triste.", "Titre: Contact impossible-Service inexistant- déplorable Texte: Contact impossible avec une personne en particulier, ou même un service interne. Etant client titres, certaines opérations demandent un suivi particulier.Je reçois, à ce sujet, des mails : ceux-ci sont identiques à ceux reçus d'un pays lointain, pleins de fautes d'orthographe et d'explications incohérentes.Tout ceci est INDIGNE d'une banque Belge.On vous dit de vous méfier des mails frauduleux, mais ceux envoyés par Keytrade, et en particulier par le service \"Corporate Actions\" sont honteux, plein de fautes et d'incohérences. Lorsqu'on leur écrit, aucune réponse, le mépris le plus total. Le même problème s'est produit en 2023, j'ai également réagis, sans suite....Lorsque je désire contacter un responsable, dont de belles photos ornent le site, cela est impossible (Monsieur Questiaux). Le contact téléphonique est aussi ouvert qu'avec une prison..., et toute adresse mail personnelle est proscrite. De quoi vous dégoûterde cette banque (où je suis client, mais dépité..) Je compte finalement demander l'avis de ces mails \"pourris\"  à l'ombudsman des banques. Merci de votre lecture et à réfléchir 2 fois avant d'en être captif comme client..... A.V", "Titre: Injoignables !!! Texte: Organise l'impossibilité d'entrer en contact avec eux.Il font des publicités partout, mais sont incapables de répondre à un simple appel téléphonique.Les délais de traitement des mails sont hallucinants (plusieurs semaines)Ce n'est plus la super banque que j'ai connu !!!", "Titre: banque archaïque Texte: pas de paiement en ligne (payconiq ou autres). Le solde ne se met à jour que très lentement. Les transferts mettent plus de 2 jours à être effectués. En résumé, il ne faut pas être pressé ! Le paiement instantané n'existe pas, vous l'aurez compris. Point positif : la gratuité. Mais ça existe ailleurs. La rémunération des transactions (quelques centimes) est maintenant plafonnée, ce qui ne fait que des cacahuètes. C'est plutôt un attrape-nigaud.", "Titre: Je conseille Keytrade Texte: Jusqu'à présent, l'ensemble des services sont de très bonne qualité. Les intérêts sont plus élevés qu'à ma banque principal, à terme je transfèrerais tous chez Keytrade.", "Titre: service client 0 systeme IT déficient Texte: Ils organisent l'impossibilité de les joindre 4 semaines pour répondre a un mail. injoignable par le téléphone, vous pouvez ecouter la musique classique très énervante. Le systeme informatique douteux fait des fautes et vous payez les pots cassés. un seul conseil videz vos comptes avant qu il ne soit trop pour votre épargne", "Titre: Belle expérience Texte: Belle expérience, je verse tous les mois une somme d'argent et je constate que le capital augmente avec parfois des variations.Cela correspond à ce que je cherchais comme investissement financier.", "Titre: j'apprécie la transparence Texte: j'apprécie la transparence, et la performance de Keyprivate.Le suivi du portefeuille est très convivial.L'achat de titres est très facile Je n'ai jamais eu de contact autre que par online mais cela fonctionne bien comme çà.", "Titre: Mauvais services Texte: Très mauvais services. On m'a volé de l'argent en ligne et la banque ne m'a pas du tout aidée. Selon le gestionnaire sur lequel je tombais, l'information était différente. Ils se renvoie la balle entre services, font des erreurs de suivi et puis ne donne plus de nouvelle. J'ai perdu beaucoup de temps et d'énergie à faire valoir mes droits qui n'ont pas été entendu alors que j'ai fait toutes les démarches nécessaires.", "Titre: Banque à bannir Texte: Banque à bannir, 1 - Demande de carte de débit pour mes enfants à pris plus que 4 semaines et les information étaient eronnés j'ai du refaire une demande qui à pris encore 4 semaines.2 - Le service client est injoignable 3 - Impossible de debloquer une carte de crédits via le  site, obligé de contacter le service client, qui est injoignable4 - Impossible de parler avec le management pour escaler.5 - Pas de payment Apple Pay et payconiq Comme dit le proverbe, \"When you pay peanuts, you get monkeys\"", "Titre: Client depuis 2021 -> satisafait Texte: Client depuis 2021 pour mon compte bancaire principal avec une VISA Gold gratuite, je suis globalement satisfait. La seule fois où j'ai contacté le service client, j'ai eu un retour assez rapide même si au final ça n'avait pas pu résoudre le problème à savoir qu'il y avait eu tout un temps un problème pour valider les paiements fait sur Amazon (résolu depuis un moment déjà). Juste dernièrement, un peu déçu du passage à la nouvelle carte de débit VISA débit avec laquelle on n'a plus la fonctionnalité de recevoir et envoyant des paiements dans payconiq. Si j'avais su (rien mentionné à ce sujet), j'aurais gardé mon ancienne carte jusqu'à expiration... Une fonctionnalité qui pourrait dès lors être introduite directement dans l'application Keytrade...", "Titre: clair et complet Texte: Toutes les info sont claires et facilement accessibles.Tarifs similaires à d'autres banques en ligne.Le placement d'ordre(s) est facile.La gamme de produits proposée est large", "Titre: Découverte Texte: Bonjour, je suis nouvelle cliente et je ne trouve pas d'info sur les virements instantanés, payants ou non payants? Je pense qu'il n'y a pas d'accès au payconiq, ce sui est bien dommage et embêtant. J'espère que ce sera vite disponible. Autrement, rien à dire pour le moment.", "Titre: Banque totalement nul. Texte: Banque totalement nul que j'utilise depuis quelques années car gratuit mais je vais finalement fermer mon compte car un service inutile ne me sert à rien. 1) Impossible de relier keytrade et payconiq !2) Impossible de faire de virement instantané !3) Impossible de sauvegarder mes bénéficiaires, tout s'efface à chaque fois !4) Impossible de me connecter à keytradebank sans le petit lecteur !Bref, keytradebank est d'une nullité totale...", "Titre: Suite à un départ à l’étranger Texte: Suite à un départ à l’étranger , j'ai transmis tous les documents demandés afin de solder mes comptes . cela fait plus d'1 mois et demi . Malgré des relances par mail, par tél , ça n'avance pas .. ha des mots d'excuses truffés de fautes d'orthographe j'en ai reçu mais depuis 1 mois et demi , par leur manque de professionnalisme, je perd de l'argent !", "Titre: Très bonne banque en ligne Texte: Très bon service banquaireService clientèle joignable et réactifDeux améliorations potentielles :- les caractères de la hardkey ne sont pas faciles à lire- le plafond de paiement n'est pas modifiable (même temporairement)", "Titre: SI JE POUVAIS METTRE ZERO ETOILE JE LE… Texte: SI JE POUVAIS METTRE ZERO ETOILE JE LE FERAISj'ai comme beaucoup été attirée par l'offre alléchante de rétribution pour chaque opération effectuée sur ce compte. Je me suis très vite rendue compte que les avis mentionnant que le service clientèle était injoignable étaient vrais! J'ai immédiatement demandé l'annulation de ce compte mais bien évidemment comme ils mettent des plombent à répondre, je ne pouvais plus l'annuler mais je devais le clôturer avec copie de ma carte d'identité.Pour des questions de sécurité j'ai refusé dans un premier temps d'envoyer je ne sais où la copie de ma carte d'identité ! J'ai dû m'y résigner mais là encore depuis des semaines j'attends la confirmation que ce compte est bel et bien clôturé ! A FUIR SI VOUS LE POUVEZ !!!!", "Titre: Carte Visa refusée sans explications sans jamais avoir été fiché négativement Texte: Fraîchement retraité, je souhaitais faire de Keytrade Bank ma première banque, et quitter ma banque historique ING dont je suis client depuis 45 ans, afin de bénéficier des services de KB à l'avenir, chez ING je possède un compte à vue, une \"réserve permanente\" (dont je n'ai plus le besoin) et une carte de crédit MC. Avant de faire ma mutation interbancaire, je souhaitais faire la demande d'une carte Visa Gold afin de ne pas me trouver sans carte de crédit avant de partir aux USA en juillet en quittant ma banque historique...je rêvais éveillé apparemment, ma demande a été refusée sans aucune explication comme beaucoup d'avis laissés ici. Jamais fiché à la centrale négative depuis mes 18 ans ! Cela m'apprendra à croire que des banques \"alternatives\" puissent fonctionner comme les autres, seule possibilité qui s'offrait à moi: enterrer mon souhait de devenir client, résilier mes comptes et rester chez ma banque historique !", "Titre: Service client injoignable Texte: Habituellement très content de cette banque, j'essaie desepèrement d'ouvrir un compte pour ma fille.Un mois que les documents demandés ont été renvoyés, et malgré plusieures relances par mail. pas de réponse.Ici cela fait 3h que j'essaie de toucher leur service client, sans résultat. La douce musique de valse, m'a poussé à contacter une autre banque et j'ai eu rdv dès le lendemain. Dommage", "Titre: Je suis très satisfaite des services de… Texte: Je suis très satisfaite des services de Keytrade ainsi que de la gratuité des comptes. Les taux d’intérêts sont intéressants. J’aimerais pouvoir utiliser l’application sans devoir recourir au boîtier.", "Titre: Je suis ancien client Fortunéo devenue… Texte: Je suis ancien client Fortunéo devenue Keytrade …je suis excédé par les problèmes techniques, avec beaucoup de mouvements boursiers, j’ai quotidiennement des problèmes opérationnels et je me prépare à changer de banque …les communications avec le personnel sont presqu’impossible et celui-ci est très désagréable les quelques fois ou après une interminable attente on arrive à avoir un contact !!! Je déconseille cette banque .", "Titre: J'ai été volé avec mon compte visa le 3… Texte: J'ai été volé avec mon compte visa le 3 décembre la somme de 995,11euros. Lorsque j'ai vu le vol j'ai directement sonner à la banque qui m'a fait remplir des formalités pour faire intervenir l'assurance que j'ai aussitot fait. Depuis le 7 decembre aucune nouvelle de la banque malgré mes multiples mails. Du coup ce jour, cette somme a été décompté de mon compte à vue! Certe banque bon marché mais très très médiocre dans le service.", "Titre: Compte inutilisable Texte: J'avais ouvert un compte lors d'une action permettant de recevoir 50€. J'ai bien reçu la carte mais je n'ai jamais reçu le code pour l'utiliser ... J'ai envoyé un mail pour obtenir des informations,  jamais eu de réponse.", "Titre: Service client désagréable Texte: Suite à l'ouverture d'un compte pour moi et un pour ma fille , j'ai dû appeler le service clientèle car ma fille a bien reçu sa carte mais moi non , j'ai été traitée comme une moins que rien sur un ton désagréable.  Ils peuvent désormais garder la carte car je vais résilier immédiatement.  J'aurais dû regarder les avis avant de m'engager. Franchement honteux .", "Titre: Facilité d'ouverture de comptes… Texte: Facilité d'ouverture de comptes gratuits et des applications. Rémunération des opérations sur le compte courant. Cash backs. Joignable aisément en cas de problème technique.  Conditions de placement généralement un peu meilleure que la concurrence.", "Titre: Plateforme internet plus avenante que… Texte: Plateforme internet plus avenante que celle de la plupart des autres banques belges. Considération du client. Meilleur rapport qualité/coûts.", "Titre: Expérience positive Texte: Expérience positive, tous les outils sont intuitifs (appli, site web, key). Personnel présent si besoin et taux d'intérêt les plus intéressants du marché. Super !", "Titre: Service client ridiculement lent à répondre, ils confirment eux-mêmes, c'est systématique Texte: Service client extrêmement lent à répondre au téléphone, c'est systématique, il est normal d'attendre 30 minutes, voire plus avant d'avoir quelqu'un qui décroche, c'est indécent venant d'une banque soit-disant \"de référence\" (j'en ai fait l'expérience plusieurs fois, ils disent qu'ils sont constemment submergés d'appels parce qu'ils ne sont pas assez dans l'équipe). Pas très professionnel.. la priorité de Keytrade Bank est clairement ailleurs (profit). D'autres banques sont clairement plus réactives et ont une approche plus respectueuse vis-à-vis de leurs clients. Dommage car pour le client, la réactivité du service fait partie de ses priorités, si ce n'est la première, attendre peu de temps au téléphone est une preuve de qualité, de respect, d'autres banques l'ont bien compris et sont bien plus sérieuses. Si le service client est important pour vous, comme il l'est pour moi, je déconseille fortement cette banque.", "Titre: Banque parfaite nous y sommes depuis… Texte: Banque parfaite nous y sommes depuis leurs débuts.. à conseiller vivement en sus pas de frais bancaires et transactions comme les virements payés 5 centimes sur votre compte !💪🏼", "Titre: Aucun souci avec Keytrade ! Texte: Aucun souci avec Keytrade !Améliorations souhaitées :- fonctionnement avec les QR codes dans Payconiq pour la carte Visa Debit- intégration avec Google Wallet", "Titre: Contact service client Texte: Contact du service clientèle pour des informations, personnel compétant, aimable, courtois et de bon conseils. Merci à l'équipe et aux services de Keytrade. Fabrice.", "Titre: Aucun frais de fonctionnement Texte: Aucun frais de fonctionnement, au contraire chaque transaction rapporte de l'argent, donc plus vous recevez de l'argent ou plus vous en dépensez, plus vous gagnez.  Je ne connais aucune banque qui agit de la sorte.", "Titre: Carte de débit bloquée Texte: J'ai ma carte de débit bloquée depuis 1 semaine et depuis une semaine j'essaye de contacter par téléphone le service clientèle...personne ,et la musique d'attente résonne encore dans ma tête.", "Titre: Services compétitifs et facilité d'usage. Texte: Le site web est \"user-friendly\" à tous les niveaux (virements, achats-ventes en bourse, etc.). Les taux d'intérêts pour l'épargne sont compétitifs. Pas de frais de garde pour le compte titres. Crédit pour toutes sommes entrantes.", "Titre: Bonne banque Texte: Bonne banque, bons services, très bonne application. Tarifs bousiers un peu trop élevés comparés à la concurrence.", "Titre: Manque de personnel et multiples erreurs Texte: Client depuis 5 ans j'en étais content, mais depuis quelques temps ce n'est plus possible d etravailler avec eux. Ils ont un gros manque de personnel. c'est d'ailleurs la réponse en mail automatique qu'ils envoient. les bugs se multiplient, entrainant des erreurs et impossible à corriger. Ils sont sur une très mauvaise pente...", "Titre: Je suis satisfait de votre banque en… Texte: Je suis satisfait de votre banque en ligne en général. Mais dommage que la connexion à l'app ne puisse se faire sans le digipass, p.ex. via itsme ou un code d'accès comme dans la plupart des banques. De par le passé un contact par téléphone ne m'a pas été agréable et n'a pas eu de suite rapide. Vous ne demandez pas de frais sur le compte courant et rémunérez même les opérations effectuées, très bien mais les intérêts que vous proposez sur la plupart des comptes épargne restent très maigres. Bien à vous.", "Titre: Banque en ligne super pratique Texte: Banque en ligne super pratique . Questions d'investissement et d'intérêt sur les comptes d'épargne c'est une des meilleurs.", "Titre: simplicité Texte: très simple pour ouvrir un compte et service client assez patient.", "Titre: Refuse de crédit hypothécaire Texte: Refuse de crédit hypothécaire (avec un revenu moyen mensuel sur les 24 derniers mois de 6 000€).En cause : J'ai changé d'employeur pour gagner plus.ET ils exigent des rénovations malgré un PEB D (ce que j'ai les moyens de faire sur fond propres et ne les regarde donc pas)Des clowns, mon crédit à été accepté PARTOUT ailleurs.", "Titre: Très bien mais pas de support client efficace Texte: Tant que vous n avez pas besoin d informations tout est parfait MAIS le suivi des demandes est pénible …. Lent et pas suffisamment précis", "Titre: Lenteur lenteur Texte: Un compte courant ouvert le 07/02/2024 et à ce jour, 19/02/2024, toujours aucune carte bancaire reçue, ni de code pin. Et il est bien sûr évident qu'il n'y a aucune urgence !La carte bancaire est arrivée le vendredi 23/02/2024 . A ce jour, 27/02/2024, pas de code pin et dès lors, impossible d'utiliser la carte bancaire. 20 jours depuis l'ouverture du compte!", "Titre: Je trouve vos services clairs et… Texte: Je trouve vos services clairs et précis. Vos tarifs sont les plus compétitifs du marché. Et vous êtes rapide lorsqu'il s'agit de vous adapter aux réalités du marché.", "Titre: Les manipulation est très aisée. Texte: Les manipulation est très aisée.Les produits du Key Plan en fonds sont bien choisis,mais ce serait mieux de pouvoir choisir quelques fondsen dehors de ceux proposés.", "Titre: L’application a beaucoup de problème… Texte: L’application a beaucoup de problème encore aujourd’hui (page blanche) je ne vois pas mon compte,et certaines dépenses sont très lentes à apparaître sur l’écran", "Titre: Pourquoi ne pas signaler le nombre de… Texte: Pourquoi ne pas signaler le nombre de clients en attente ?S'il y en a 5 j'attends, si il y en a 20 je raccroche.J'ai mis 45 minutes pour avoir une connection en appel içnternationnal ( Ténériffe)", "Titre: banque archaique, QR code et paiement via mobile pas possible Texte: Malheureusement je me rend compte qu’aujourd’hui il n’est pas possible de faire des paiements avec ma carte visa débit via mon téléphone ni de faire des paiements via QR code.C’est totalement hallucinant d’entendre cela pour une banque en ligne en 2023. Votre site parle de paiements en ligne mais se garde bien de mentionner cette limite incompréhensible de vos systèmes.Ceci est ultra handicapant et m’oblige à avoir un compte auprès d’une autre banque et de virer de l’argent de keytrade vers celle-ci.Avez-vous une date de mise en service de ses services BASIQUES dans le monde actuel et non d’il y a 5 ou 10ans ? si cela n’est pas résolu d’ici peu je fermerai sans doute mes comptes auprès de keytrade ou les laisserai dormir sans les utiliser.Je voulais aussi mentionner vos procédures pour récupérer les accès à l’application. Vous passez encore par courrier papier et documents à compléter a la main pour des raisons sois disant de sécurité. Encore une fois en 2023 de nombreuses solutions électroniques existent tel que ITSME ou docusign donc malheureusement ce genre de chose met 1,5 semaine chez vous contre quelques minutes dans de nombreuses autres banques. Bizarre pour une banque qui se dit en ligne", "Titre: Exactitude des comptes. Texte: Exactitude des comptes.Petit bémol - temps trop long pour maj en direct des comptes lors d'un paiement (trop différé).En général - très satisfait des services de KT", "Titre: Facilité d'utilisation. Texte: Facilité d'utilisation via le Web ou l'appli. Réponse rapide du service clientèle et toujours plus d'avantages que les autres banques.", "Titre: incompétence Texte: Problème de code pin avec ma carte de débit. Une fois je peux payer avec mon code pin et de manière aléatoire celui-ci se bloque... Depuis novembre c'est la 3eme fois qu'il faut changer de carte de débit car le problème ne se résout pas. De plus les gens aux services clientèles sont très désagréables et méprisants, ils oublient totalement qu'ils sont dans un service à la clientèle.On veut les joindre au numéro téléphonique proposé et de manière incroyable vous entendez votre téléphone vous dire que ce numéro n'est plus en service. Au secour... C'est quoi cette banque ???Je pense que je vais la quitter au plus vite... Ca sent le rachat et une fusion avec une autre banque...", "Titre: Il y a de bonnes choses mais encore… Texte: Il y a de bonnes choses mais encore énormément de choses qui vont pas comme les détails des paiements sont imprécis, un virement met parfois 2 jours avant d'arriver, payconiq ne fonctionne pas avec Keytrade, pas de virement direct et d'autres points", "Titre: Question sur une transaction Texte: J ai posé une question sur un ordre qui avait été passé sur mon compte titre et j ai eu une réponse très rapide et un sérieuse. Je suis client depuis 3 ans et très satisfait de la banque en général. Le compte bancaire est sans frais et on reçoit même 5 cents par transaction.", "Titre: Incompatible avec Payconiq Texte: Je changerai mon avis lorsque les cartes seront de nouveau compatible avec payconiq Ça fait des mois et toujours aucune solution ni alternative", "Titre: Une banque? Keytrade. Texte: Une banque?Une seule: Keytrade.Keytrade a prouvé qu'une banque peut être un partenaire, et ce 5 cents versé pour chaque transaction en plus d'offrir la gratuité de ses services en est l'exemple le plus pérenne.\"Quoi? T'es pas encore chez Keytrade?\"", "Titre: nous utilisons les services de cette… Texte: nous utilisons les services de cette banque depuis février 2020. ils sont très fidèles aux clients, responsables avec un accès rapide", "Titre: A n'utiliser que parce que c'est gratuit Texte: A n'utiliser que parce que c'est gratuit. Tout fonctionne mais tout est pénible, rien n'est optimisé, userfriendlyness c'est zéro... mais c'est gratuit.", "Titre: Une banque avec personne derrière.... Texte: Une banque avec personne derrière....Une banque doit être un partenaire.Impossibilité de joindre le service client, aucune réponse aux emails envoyés.", "Titre: Ouverture de compte catastrophique … Texte: Ouverture de compte confirmée par mail le 28 août par keytrade bank et depuis rien...un service clients difficile à joindre qui finalement vous répond que le dossier est en cours de traitement et qu'on remonte l information....jusqu'à la lune ? Je ne demande pas la lune juste une simple ouverture de compte.1 mois et demi pour une banque en ligne en 2023...c est surréaliste non ?Ça me fait peut de devenir client...", "Titre: Services bancaires impeccables Texte: Client depuis plus de 15 ans. Service impeccable dans les opérations bancaires (compte-vue, comptes d'épargne et placements)", "Titre: J'ai tenté de les joindres plusieurs… Texte: J'ai tenté de les joindres plusieurs fois, en moyenne 30 minutes d'attentes quand j'ai enfin eu une réponse (sinon ils répondent même pas). Et par mail délai de 2 à 3 semaines pour une simple question ...", "Titre: Excellent banque en avance même sur bcp… Texte: Excellent banque en avance même sur bcp de fonction , simplification des accès bancaires", "Titre: Toujours ok avec les produits de… Texte: Toujours ok avec les produits de Keytrade banque.Utilisation de la nouvelle application, facile et pratique.", "Titre: Vous aurez peut-être remarqué que j'ai… Texte: Vous aurez peut-être remarqué que j'ai vidé mes comptes .... Service NUL, on écrit, pas de réponse.Tout est déplorable et NUL depuis que la banque est sous pavillon Français.", "Titre: Super sauf 😉 Texte: Tout est bien chez vous sauf sur l'application  téléphone ou on ne vois pas le total des avoir comme sur le pc", "Titre: Je trouve formidable que keytrade soit… Texte: Je trouve formidable que keytrade soit totalement gratuit et qu’en plus de sa on reçoit chaque fin de mois une rémunération pour tout les paiements et virements effectué durant le mois…tout simplement la meilleur banque de Belgique.", "Titre: C'etait pas mal, mais à fuir maintenant Texte: Au depart, j’étais content de Keytrade, mais le service est devenu lamentable, voir inexistant. Impossible de les joindre (au bout de 45 minutes, ca vous raccroche au nez). Et quand vous les avez, ils ne savent rien faire en ligne, faut envoyer des messages qu'ils ne reçoivent pas...Bref, j'y suis, mais pas sur que j'y reste", "Titre: Très bon service Texte: Jamais de problème de connexion, tarif bon marché,  5 cents par transaction c'est top.Et donc je suis très satisfait du service.Peut être pouvoir payer en scannant un QR code dans l'app", "Titre: Infos transparentes et claires. Texte: Infos transparentes et claires.Nombreuses fonctionnalités et simplicité de l’application sur smartphone et ordinateur. Pas besoin de marchander pour obtenir un très bon taux de crédit hypothécaire.", "Titre: Service client inexistant Texte: Aucune personne compétente au call center lorsqu’il y a un problème technique", "Titre: Sécurité et facilité Texte: Info intéressante (augmentation du taux d'intérêt sur les comptes épargne) .. transmise rapidement.Accès sécurisé et facile aux comptes.Visibilité parfaite sur les comptes.Bravo !", "Titre: Keytrade Bank est aux abonnés absents Texte: Je ne peux que confirmer les innombrables messages qui disent que c'est une organisation qui n'à rien à faire de la satisfaction des clients. C'est clair pour moi, je ferme le compte et j'en ouvre un autre dans une \"vrai\" banque.", "Titre: Simply the best Texte: Tout gratuit, service clientèle dispo et compétent, meilleurs tarifs (épargne, bourse,...)", "Titre: Utilisation au top Texte: Utilisation au top, site web et application claire.Seule point d'amélioration pour moi : maque les virements instantané", "Titre: A fuir. Keytrade n'est plus ce qu'elle était ! Texte: Service client abominable.Les emails ne sont jamais répondus.Attente interminable au téléphone.Compte bloqué pour raison inconnue. Impossible de débloquer.", "Titre: Honteux! A fuir! Texte: Je reviens vers vous car malgré mes efforts pour quitter votre établissement pour le 15/3/2024 comme imposé, les retards et les erreurs s'accumulent de votre côté.1. Pour info, le transfert de mes titres est en cours vers ….. et j'ose espérer que cette fois, vous communiquerez le prix de ces titres à leur entrée dans mon portefeuille. ….. a déjà la liste des titres mais le transfert semble traîner chez l'émetteur.2. J'ai demandé le 09/02/2024, la liquidation de mes 2 KEYPLAN, ce qui apparaît \"en cours\" sur mon dashboard. Or, il reste 10 jours pour que cet argent arrive sur mon compte à vue et que je puisse le virer à la concurrence. J'ai également lu que \"si la vente du KEYPLAN est exécutée avant la fin de la 5ième année de souscription, les frais de vente s'élèveront à 9.95€ par fonds \"Étant donné que je n'ai pas demandé à être virée de la sorte, et que tant pour le transfert de mes titres vers …. en février 2024 que pour le transfert des titres de Mme Xxxxxx  vers mon compte titres Keytrade (en mars 2022), les erreurs se sont cumulées, j'ose espérer que vous n'appliquerez pas cette tarification forfaitaire sans quoi, je me verrai dans l'obligation de saisir le médiateur et d'informer Test-achats de vos pratiques scandaleuses. Pour rappel, en 2024, 2 titres ont été envoyés malgré mes mails chez ….., la valeur de ces titres à leur entrée dans mon portefeuille n'a pas été communiquée à l'autre établissement.En mars 2022, ma mère, suite à une donation en ma faveur, vous a demandé de transférer ses titres chez Keytrade ainsi que ses titres chez xxxxx sur mon compte-titres Keytrade. Or, j'ai constaté en préparant la clôture de mes comptes que les titres xxxx avaient été transférés sur le compte Keytrade ma mère et non sur le mien. Elle va donc ré-effectuer le virement de donation en mars 2024, soit 2 ans plus tard!!!Et finalement, pour vous informer d'un bug supplémentaire dans vos services, ma mère continue de voir mes comptes (sur lesquels elle a procuration) en \"statut bloqué\"", "Titre: Compte créé le 06 janvier Texte: Compte créé le 06 janvier. Ce 20 février toujours pas de carte de débit reçue. Les versions concernant cette carte de débit ne sont pas les même en fonction de la personne que vous avez au téléphone.", "Titre: Harcèlement administratif Texte: Harcèlement administratifMe demander un document daté de moins de trois moisalors qu'il s'agit d'un document annuel", "Titre: accessibilité Texte: accessibilité, efficacité, tarif.seul bémol, je n'ai pas pu utiliser mon compte pour acheter des bons d'état.", "Titre: Un établissement bancaire sérieux Texte: Un établissement bancaire sérieux dans ces services, que demander de plus ?", "Titre: Mauvais service bancaire NE repond PAS… Texte: Mauvais service bancaire NE repond PAS au telephone ni aux email evitez cette banque", "Titre: Plus de 10 ans chez Keytrade sans… Texte: Plus de 10 ans chez Keytrade sans soucis.Le petit problème est que l'on ne sait pas déposer de l'argent liquide dur le compte bancaire.", "Titre: Une banque attractive sans frais… Texte: Une banque attractive sans frais excessifs et avec des fonctionnalités uniques.", "Titre: Très bien Texte: Service bancaire disponible quand cela est nécessaire et fonctionnel, rien à redire.", "Titre: Les rendements sur livret sont faibles… Texte: Les rendements sur livret sont faibles et rien n'est fait pour fidéliser le client.", "Titre: Facile d'accès ,gratuit et payé pour… Texte: Facile d'accès ,gratuit et payé pour faire des transactions", "Titre: Accès à une large gamme de fonds et… Texte: Accès à une large gamme de fonds et d'ETF.disponibilité d'obligations limitée.", "Titre: Banque en ligne gratuite Texte: Banque en ligne gratuitePas de possibilité de payconic ou autre", "Titre: Facilite d’emploi sur le site Texte: Facilite d’emploi sur le site , accès rapide", "Titre: taux Texte: Keytrade a des taux d'intérêts corrects par rapport à d'autres banques", "Titre: Je quitte cette banque au plus vite Texte: Je quitte cette banque au plus vite, que des soucis et un service clientèle incohérent.", "Titre: Très satisfait de Keytrade Texte: Très satisfait de Keytrade. Bien davantage que toutes les autres banques.", "Titre: Tout simplement injoignable que ce soit… Texte: Tout simplement injoignable que ce soit par téléphone ou par messenger", "Titre: Lenteur et toujours pas client Texte: La lenteur de traitement est incroyable, j'ai fais une demande d'inscription depuis le mois de septembre , on m'a renvoyé un mail 4semaines après pour avoir les justificatifs envoyé que j'ai envoyé le jour même , re attendre 4semaines pour avoir une réponse , j'ai souscris a cette banque juste pour la promo d'ouverture mais je pense que vu le temps de traitement j'aurai le compte en 2024 ...", "Titre: Personne très compétente au téléphone… Texte: Personne très compétente au téléphone et très gentille", "Titre: Banque sans frais cachés Texte: Banque sans frais cachés. Efficace. Application mobile pratique", "Titre: Globalement satisfait des services Texte: Globalement satisfait des services, malgré quelques « couacs ». Site internet et application pourraient être améliorés (navigation parfois compliquée).", "Titre: QR CODE Texte: Dommage qu'il n'y ait pas de lecteur de QR code sur l'application", "Titre: Très bon service a distance Texte: mes soucis ont été réglés sans aucun problème. Merci", "Titre: Seul reproche Texte: Seul reproche : cette banque ne répond jamais aux mails qui lui sont adressés.", "Titre: Excellent service Texte: Site convivial. Contact téléphoniques cordiaux et efficaces. Taux d'intérêts corrects.", "Titre: Site Web complet Texte: Site Web complet, transactions faciles à réaliser.", "Titre: Top app Texte: Top app, qualité des services proposés", "Titre: Bonne banque gratuite et qui récompense… Texte: Bonne banque gratuite et qui récompense ses clients.", "Titre: Satisfait pour le moment aucun soucis Texte: Satisfait pour le moment aucun soucis", "Titre: Bonne gestion des Keytrade privé Texte: Bonne gestion des Keytrade privé", "Titre: site bien réalisé Texte: site bien réalisé fonctionnalités qui correspondent à mes besoins", "Titre: Je recommande Texte: Tout est clair, facile d'utilisation, les informations régulièrement fournies sont intéressantes.Je recommande bien sûr", "Titre: facile d utilisation et pas de frais!! Texte: Date de l'expérience: 27 septembre 2023", "Titre: Clair et accessible Texte: Le site est clair et facile d’utilisation", "Titre: Service client serviable prêt à aider Texte: Date de l'expérience: 11 janvier 2024", "Titre: Pratique et accessible en tous temps Texte: Pratique et accessible en tous temps", "Titre: Pas de frais caché Texte: Pas de frais caché , une aide permanente en cas de besoin. De bons taux...top !", "Titre: Je recommande keytrade bank Texte: Facile et gratuit c'est parfait", "Titre: Très avantageux par rapport aux autres… Texte: Très avantageux par rapport aux autres banques.", "Titre: Bon suivi lors de notre enprunt. Texte: Ouverture de compte et emprunt hypothécaire", "Titre: Achat du bon d'état via Keytrade Texte: Achat du bon d'état via Keytrade: très simple et rapide.", "Titre: Facile d’utilisation en général pour… Texte: Facile d’utilisation en général pour toutes opérations", "Titre: a fuir Texte: que des mauvaises experiences avec eux!", "Titre: excellent rapport qualité/prix Texte: Applications très simples d'utilisation, frais d'utilisation très limités et panel de produits abondant en possibilités d'investissement et d'épargne.", "Titre: Nouvelle app plus conviviale Texte: Date de l'expérience: 05 avril 2024", "Titre: Excellente banque Texte: Excellente banque, pas de frais à la c*n. C'est même elle qui nous paie", "Titre: Bonne banque et peu de frais par… Texte: Bonne banque et peu de frais par rapport aux autres !!", "Titre: Rapidité et attention apportées à mes… Texte: Rapidité et attention apportées à mes besoins", "Titre: Meilleure banque belge Texte: Meilleure banque belge, pas de frais et tout est gratuit !", "Titre: Très fiable Texte: Très fiable, simple et peu ou pas coûteux", "Titre: Facilité d'utilisation de… Texte: Facilité d'utilisation de l'application. Bonus pour chaque mouvement.", "Titre: Service optimal Texte: Service optimal et accessibilité à toutes les informations nécessaires", "Titre: La simplicité de l'utilisation du site… Texte: La simplicité de l'utilisation du site internet", "Titre: Connexion facile Texte: Connexion facile, info recherchée disponible", "Titre: Application intuitive Texte: Application intuitive. Taux épargne très intéressant.", "Titre: c'est parfait Texte: Date de l'expérience: 25 septembre 2023", "Titre: Satisfait Texte: Banque fiable et gratuite.", "Titre: Easy Texte: Simple.  Je fais moi-même quand je veux", "Titre: Application intuitive et complète Texte: Date de l'expérience: 15 mai 2024", "Titre: Chaque transaction est récompensée Texte: Date de l'expérience: 25 septembre 2022", "Titre: Rien à dire Texte: Très bon service client", "Titre: Facile d'utilisation Texte: Date de l'expérience: 30 mai 2024", "Titre: Facile d'utilisation. Texte: Date de l'expérience: 01 mai 2024", "Titre: Très bonne banque, Texte: Très bonne banque,", "Titre: très soft et claire Texte: Date de l'expérience: 03 octobre 2023", "Titre: Facilité d'utilisation. Texte: Date de l'expérience: 23 septembre 2023", "Titre: 1234 Texte: 1234567890", "Titre: L'application Keytrade est un couteau… Texte: L'application Keytrade est un couteau suisse par rapport à d'autres applications bancaires utilisées par ailleurs. Frais de transaction et de tenue de compte particulièrement intéressants.", "Titre: Un très bon compromis pour une banque. Texte: Un très bon compromis pour une banque.De plus, elle offre des taux d’intérêts bien supérieures à d'autres même si elle pourrait encore faire un effort.Malgré tout, quelques bugs lors de l'utilisation des cartes à l'étranger pas toujours reconnues (pompes à essence ou autre) mais rien de rédhibitoire.", "Titre: Une Banque vraiment gratuite et avec du… Texte: Une Banque vraiment gratuite et avec du service. Cartes crédit et débit gratuites. En plus récompensé à chaque paiement.", "Titre: Banque au top Texte: Banque au top, client depuis de nombreuses années, rien à dire de négatif !", "Titre: Rapidité Texte: Rapidité, simplicité", "Titre: Pratique Texte: Application pratique tant pour les opérations bancaires de base que la gestion des investissements.", "Titre: TRES MAUVAIS Texte: Voici quelques mois que j'essaie d'avoir une contact téléphonique avec cette banque, c'est chose impossible. Nous avons un compte à vue chez Keytrade où il reste 300 euros. Il nous est impossible de les utiliser. Nos données personnelles ne seraient pas à jour mais impossible de trouver le problème. J'ai envoyé 4 mails et j'ai reçu comme réponse \"problème de données personnelles\".Banque à éviter absolument", "Titre: Satisfait de vos services dans l’ensemble mais parfois difficile d’avoir accès au site dommage !!!! Texte: Satisfait de vos services", "Titre: Communication impossible Texte: Plusieurs mois pour enfin arriver à ouvrir un compte pour mes petits enfants. Ensuite, aucun suivi, aucune communication possible, seule réponse possible \"Nous avons bien réceptionné votre e-mail et nous allons le traiter. Nous connaissons un retard dans nos réponses. Nous tenons donc à vous informer que vous devrez probablement patienter\". Ça fait maintenant 2 mois !!!Banque à fuir au plus vite. Il y a beaucoup mieux en matière de suivi et de qualité en Belgique", "Titre: banque gratuite avec les services essentiels Texte: je suis client depuis plus de 10 ans de cette banque gratuite qui offre les services essentiels (carte de debit, de credit, compte epargne, compte courant) + les services de trading en bourse.manque quelques details comme l'intégration payconiq \"full\", le real time sur les transactions boursieres... mais rien de rédhibitoire. comme on dit il y a mieux ailleurs mais c'est plus cher", "Titre: Je suis client Keytrade depuis 2012… Texte: Je suis client Keytrade depuis maintenant plus de 10 ans, au début le service était d'une excellente qualité , l attente au téléphone ne dépassait pas les 4 à 5 minutes. Je dois constater que cette époque est bien révolue ... De nombreux bugs informatiques rendent impossible le payement par carte , il est très fréquent d'attendre plus de 30 a 40 minutes avant d'avoir une personne au téléphone. Bref le service n est plus à la hauteur ! C'est une banque sans frais  mais surtout une banque sans service client.", "Titre: Je suis cliente depuis quelques mois… Texte: Je suis cliente depuis quelques mois et, jusqu'à ce jour, je suis pleinement satisfaite, je n'ai eu aucune difficultés à obtenir par téléphone les renseignements utiles, et ce qui ne gâche rien mon interlocuteur était très patient et aimable. Enfin, j'apprécie le fait que les services bancaires soient gratuits.", "Titre: J'ai déjà l'expérience de qques années… Texte: J'ai déjà l'expérience de qques années chez Keytrade... Très content d'avoir quitté une banque qui me comptait pas mal de frais pour celle-çi. L'appli fonctionne correctement. Au début, l'assistance téléphonique était immédiate, ce n'est plus tjrs le cas. J'avais d'ailleurs parrainé un collègue qui a arrêté les démarches suite à ne pas avoir quelqu'un au bout de la ligne... Autre point négatif: pas de virement instantané. Mise à part ça, je ne regrette pas mon choix.", "Titre: Banque qui s'affiche \"Low Cost\", mais low service, enfin SERVICE Lamentable Texte: Services lamentables. Tant que tout fonctionne, vous avez de la chance, mais dès que vous avez un soucis, cela dure des mois sans encore être résolu. On passe des heures au téléphone à attendre. Une fois un contact étali, les gens sont de bonne volontés mais rien ne change dans les systèmes informatiques, ça continue et ils en arrivent à vous demander à nouveau de compléter les documents et formulaires pour la 3éme fois et certains employés en arrivent même à reprocher aux clients l'origine des problèmes techniques qui seraient du à des mauvaises manipulations.", "Titre: Alkhala Texte: ￼je suis  un Vendeur￼", "Titre: Bugs à répétition lors d'ouverture de compte Texte: Alors que nous étions ravis de cette banque, nous avons tenté à de multiples reprises d'ouvrir un compte pour un mineur et là grosse déception: nous avons perdu plusieurs heures car leur système bloquait chaque fois avant la fin.On appelle alors le service client qui voit que le document a été fait et signé par les représentants légaux mais qui nous dit qu'il faudra tout recommencer car le système a bloqué avant la fin de la procédure...", "Titre: facilite Texte: facilite, conviviatité, gratuité", "Titre: Depuis que je suis client je n'ai… Texte: Depuis que je suis client je n'ai jamais eu de problèmes chez keytrade.", "Titre: Très satisfaite Texte: Je trouve que cette façon d épargner, à la fois pour moi et pour mon dernier petit fils est parfaite", "Titre: Pas trouvé l’info dans les faq Texte: Date de l'expérience: 09 août 2023", "Titre: compte utilisé comme compte journalier Texte: Date de l'expérience: 10 août 2023", "Titre: Très mauvaise expérience Texte: Très mauvaise expérience, j’ai ouvert un compte chez eux pour pouvoir acquérir une carte Visa Gold mais ceux-ci ont refusé après avoir vu mes fiches de payes visiblement.. Déjà hyper discriminant parce que mon salaire n’est pas du tout précaire, mais soit. J’ai alors simplement formulé ma déception et ma résignation à clôturer donc ce compte tout frais, et ceux-ci m’ont envoyé un mail en me donnant ces explications (que je n’avais pas demandé donc c’est limite agressif): comme quoi Keytrade se réserve le droit de refuser de donner une carte gold bla-bla-bla en fonction de votre salaire net bla-bla. Cerise sur le gâteau, on écorche mon nom de famille dès la première phrase du mail… Un échec sur toute la ligne pour Keytrade.", "Titre: Zero Texte: Cette banque attire les clients avec de cadeaux mais surtout n'investissez pas avec eux . Moi j'ai perdu beaucoup plus que les petits cadeaux reçus. Très déçu.", "Titre: Banque très facile au quotidien Texte: Banque très facile au quotidien sans frais avec un bonus de quelques euros par mois grâce aux 5 cents par transactions. Cliente depuis 1 an", "Titre: 5 jours et je peux toujours pas vendre mon action Texte: Voilà l'info que j'ai quand je dois vendre une action avec 2 décimal derrière la virgule : \"Votre ordre ne peux pas être envoyé au marché à cause d'une mauvaise variation minimale du prix (Tick size). Veuillez réduire le nombre de décimales du prix Limit/Stop de votre ordre.\" je veux vendre mon action a un prix limite de 0,015 alors quel cote 0,0144 et je peut pas le faire car j'attend depuis 5 jours qu'il corrige leur système ..... j'espère qu'il ne me ferons pas perdre trop d'argent.", "Titre: Banque basique mais généreuse Texte: Cela fait de nombreuse années que j'y suis cliente. Je n'ai jamais fait appel au call center, n'en ayant jamais eu besoin, le site est super simple à utiliser. J'apprécie le fait de recevoir 5 cents à chaque opération et que les taux d'intérêts sur le compte épargne aient été revus à la hausse bien avant les autres banques", "Titre: Piètre service clientèle, graves retards pour les opérations manuelles. Texte: Demande de transfert de titres depuis mon Keyplan vers mon compte titres envoyée par mail le 22 juillet en utilisant le formulaire adéquat et avec copie de ma carte d'identité: le 1er août, opération toujours pas effectuée.Appel au service client \"on a bien reçu votre demande mais les délais sont longs\" (ça je m'en étais aperçu!), rappel par mail avec une réponse identique: \"Nous connaissons un retard... 15 jours ouvrables pour apporter une réponse\".Dommage, car l'interface web et l'app mobile sont conviviales et fonctionnelles pour les opérations qui ne demandent pas d'intervention humaine.En plus, Keytrade est la seule banque qui offre carte de débit gratuite et retrait sans frais dans tous les distributeurs, et carte Visa gratuite (sous condition de 12 transactions par an).", "Titre: ZERO FRAIS ! Une bonne banque, crédit hypothécaire, placements... Texte: J'ai fait mon crédit hypothécaire chez keytrade il y a 4 ans, très satisfait de mon expérience, aujourd'hui, j'ai investi un capital car cette banque propose un taux nettement plus intéressant que la concurrence.  De plus, une banque sans frais, c'est un restaurant offert chaque année :-D Continuez, j'ai vraiment confiance en vos services.", "Titre: Ouverture compte Texte: Rapidité du service, offre avantageuse (cashback), simplicité de l'app. Rien à redire.", "Titre: pas certaine d'avoir mon pret Texte: J'ai contracté un prêt hypothécaire chez eux, j'ai reçu l'accord de principe très rapidement. Sauf qu'il faut absolument une assurance solde restant dû. Je signe mon acte de vente le 07/08 et toujours aucune nouvelle de mon assurance, et Keytrade me dit ne pas me prêter l'argent sans cette assurance (qui soit dite en passant, n'est pas obligatoire partout), que faire Cardif traine et ce n'est pas de ma faute, en attendant je serai à la rue le 15/08, merci Keytrade pour cette fausse information en me disant que mon prêt était accordé", "Titre: Un problème ? Il n'y a personne pour vous aider. Texte: Extrème complexité pour accéder à mon compte, au point que cette fois ci je n'y suis pas arrivé. Ce ne serait qu'à moitié rien s'il était possible de joindre un helpdesk, mais là aussi, ils se prétendent surchargés de travail et ne sont d'aucune aide. Cela ne fait pas mon affaire, j'ai une échéance de paiement qui approche, et je ne puis accéder à mes économies ! Bref, je déconseille formelement.", "Titre: Reçu nouvelle carte de banque...avec… Texte: Reçu nouvelle carte de banque...avec procédure pour en obtenir le code pin. 5 tentative en 3 heure de temps  et toujours pas de code pin par sms (n° de Gsm correct). 3 appel call center : 45 minutes passées au tél et toujours personne qui réponds...Pour un nouveau compte... PAS TOP DU TOUT !!Finalement je vais supprimer le compte. Attendez vous à çà !!!", "Titre: Lamentable Texte: Continuellement des documents à remplir, des mails, des copies de c.i., des démarches en tous genres pour un simple accès à mon compte. Impossible de les joindre au téléphone. Impossible !", "Titre: !! LA PIRE BANQUE, SURTOUT A EVITER !! Texte: Un conseil pour celles et ceux qui se demandent si ça vaut le coup d'ouvrir un compte chez Keytrade Bank : surtout fuyez, c'est la pire banque que j'ai pu voir.Vous avez de l'argent sur votre compte mais pour une raison inconnue votre carte est inutilisable et ce à plusieurs moments. Des fois ça fonctionne, des fois pas. Très embêtant pour utiliser son argent... Et quand on les appelle, après de très très longues minutes d'attente, la personne au bout du fil ne sait pas vous donner une explication : parfois c'est incompréhensible pour eux et il faut envoyer un mail auquel vous aurez un retour deux ou trois semaines après en vous demandant si le problème persiste ou alors on vous dira que c'est un bug et qu'il faut attendre une ou deux semaines avant de pouvoir utiliser à nouveau la carte, merveilleux.Et je ne parle pas des écritures qui se font parfois 5 jours voir une semaine après une transaction !!! LA PIRE BANQUE, SURTOUT A EVITER !!", "Titre: Que des problèmes Texte: Très nombreux problèmes, impossible de payer avec un qr code et impossible d'ajouter ma carte sur payconiq. Certains payements sont parfois refusés alors que le solde est suffisant, c'est plutôt ennuyeux pour une banque.", "Titre: Virement refusé Texte: J'ai fait un virement vers un fournisseur en Espagne. Virement exécuté (print screen coome preuve). Une minute après le virement  est marqué comme REFUSE sur mon extrait de compte.Après 31 minutes d'attente au téléphone l'employé me dit que j'ai reçu un email avec un code explicatif du refus. Je lui ai dit que je n'ai pas reçu d'email (même regardé dans les spams) et que je ne reçois jamais d'email dans le cas d'un virement refusé (c'est au moins la 3ème fois que ça m'arrive). Ce qu'il conteste malgré l'évidence. ensuite encore 15 minutes d'attente pendant qu'il cherche la raison.La raison serait qu'il y a une erreur d'encodage...Je dois bien faire attention quand je refais le virement.N'IMPORTE QUOI !", "Titre: Contact téléphonique chaotique Texte: Contact téléphonique chaotiqueTemps d'attente trop long, sur 4 tentatives j'ai eu 2 fois un interlocuteur et à chaque fois la communication fus interrompue.J'ai envoyé un E-mail et j'ai reçu un retour automatique me signalant que le temps de réponse pourrait atteindre 4 semaines.Bravo pour la communication.", "Titre: Le suivi administratif est catastrophique Texte: Le suivi administratif est catastrophique.A déconseiller.", "Titre: Call center et incompétence Texte: J'attendais un transfert suite à la vente de ma voiture, après les avoir appelé (call center 25min d'attente) 5 fois pour les prévenir de l'importance de ce transfert, ils avaient tout simplement REJETE le virement car l'acheteur a mal orthographié mon nom!!! pas un coup de fil ni un email pour me prévenir, heureusement que l'homme était honnête et a refait un virement sur un autre compte en banque .... banque en ligne avec un call center qui n'y connait rien en banque ... Je quitte Keytrade en courant !", "Titre: Softkey Texte: Dans la continuité de mon avis du 08/07/2021.Après avoir cassé mon téléphone, et passé 3x beaucoup de temps à écouter la musique, je n'ai pas reçu la lettre de Keytradebank pour recréer une softkey en 4 jours ouvrables après notre appel. Je n'ai pas accès à mes comptes, Je ne sais pas si mon compte est suffisamment approvisionner pour payer mes domiciliations. J ai repassé 17 minutes au téléphone aujourd'hui pour avoir quelqu'un qui m'envoie une softkey, une hardkey dans les 5 jours ouvrables... Soit encore 5 jours sans argent...", "Titre: Comptes bloqués Texte: J'ai appelé 2fois aujourd'hui. Une fois car je ne me parvenais pas à me connecter. 32 min d'attente. Puis je m'aperçois que tous mes comptes étaient bloqués. La raison était que mes données n'étaient pas à jour, mais pour moi ce n'est pas une raison valable, combien même il est fixé par le législateur. La banque doit dans ces cas là me prier de mettre à jour mes données ce qu'elle n'a pas fait. J'ai appelé une deuxième fois et ai attendu encore 19min, car je ne voyais pas l'évolution de mon compte titre. Je ne la voyais pas car mon compte courant était bloqué. Le site aurait dû afficher que mon titres n'était pas visible car le compte courant était bloqué plutôt que de me laisser errer à chercher où étaient mes positions tout en me montrant la valorisation totale du portefeuille. Ces dernières années, Keytrade a instauré pleins de mesures techniques pour m'empêcher d'accéder à mon compte comme la softkey ou la hardkey qui sont les pires mesures d'authentification que l'on puisse trouver. Je n'ai que des problèmes de connexion alors que je n'en ai pas avec les autres banques. J'ai des comptes personnes physiques, mais impossible d'ouvrir des comptes personnes morales. Plus que les autres banques, celle-ci fait tout pour nous déposséder de notre argent et nous empêche d'y accéder en faisant semblant d'appliquer les règles de compliance comme ça l'arrange. Avant ils avaient au fil des années cela touché le fond, mais depuis la fusion avec Arkéma Crédit Mutuel, ils continuent de creuser. Arkema Crédit Mutuel qui incarne tous les échecs du secteur bancaire depuis 20 ans... Comment cette boîte a pu autant dégrader sa qualité de service en 17 ans?", "Titre: 19 min d'attente et se faire raccrocher au nez Texte: Vous me faites attendre au téléphone pendant 19 minutes pour décrocher et raccrocher immédiatement. Est-ce normal?", "Titre: Qualité service Texte: Client Keytrade depuis longtemps...suis très satisfait...taux épargne plus élevés   Si transfert de 1000 euros et plus, demande de la banque pour vérifier la \"normalité\" opération...Site internet rapide et aisé", "Titre: A fuir Texte: A fuir, suite à une fraude internet de grande ampleur, j'ai bloqué ma carte visa. Un paiement était toujours en réservation et ils ont refusé de l'annuler. Ils n'ont offert aucune aide. Bref les prendre pour ce qu'ils sont et les exploiter sans les enrichir.", "Titre: Service à la clientèle nul Texte: Tant que vous faites vous-mêmes les transactions, tout fonctionne - hormis la mise à jour du compte courant (touours en différé). Dès que vous avez besoin d'un CONTACT, soit par mail, soit par téléphone, ça devient TRES PROBLEMATIQUE, jour après jour. Jamais de réponse au tél malgré maints appels et de fort longues attentes qui vident le crédit d'appel de mon téléphone. Le centre d'appel est devenu injoignable alors qu’il y a quelque temps, vous obteniez une réponse dans les 5 min max et même le samedi. Mes finances sont-elles encore en sécurité dans cette banque, dans ces conditions ???", "Titre: Première impression favorable... Texte: Une bonne quinzaine de jours entre la demande en ligne pour l'ouverture d'un compte et la finalisation. Confirmation des différentes étapes par mails et réception des pièces \"matérielles\" (Nom d'utilisateur, carte de banque, digipass,...) par courrier postal. Il suffit de ne pas être complètement nul avec les procédures internet pour initialiser le digipass avec un code personnel (si vous avez choisi ce système pour vous connecter) et pour récupérer le code pin de votre carte (par sms). Que ce soit via le site transactionnel sur PC ou en utilisant l'application sur smartphone, tout a l'air de fonctionner sans problème. A voir dans le temps...", "Titre: J'avais écrit un avis la semaine… Texte: J'avais écrit un avis la semaine dernière, mais pas publié. (banque de m...) Je m'étonne que test achats recommande cette banque!Aujourd'hui, je veux retirer 220€ au distributeur qui me signale que mon solde est insuffisant alors qu'il y a 220.65€ sur mon compte: cherchez l'erreur!A mon retour de vacances je retourne à mon ancienne banque.", "Titre: Aussi longtemps que vous n'avez pas de… Texte: Aussi longtemps que vous n'avez pas de problème et vous n'avez pas besoin d'entrer en contact avec un membre du personnel, cette banque fonctionne bien. Or, si vous avez besoin d'entrer en contact une personne, c'est un véritable calvaire!!! Il vous faudra vous préparer pour écouter la \"musique\" et une voix qui ne cesse de répéter que \"Tout nos collaborateurs sont en ligne. Nous essayerons de vous aider le plus rapidement possible\". Ce n'est pas la première fois que j'ai attendu plus de 20 minutes pour pouvoir parler avec quelqu'un. A la fin, c'était une perte de temps, car la banque n'a pas pu m'aider pour résoudre mon problème. Je n'exclus pas que le service clientèle des autres banques soit aussi déplorable et exécrable que Keytrade. \"C'est la crise éternelle\"!!!!", "Titre: Bon bin un nouvel avis très négatif Texte: Bon bin un nouvel avis très négatif : voici plus d'un mois et 1 semaine que j'ai ouvert un compte en ligne et toujours aucune nouvelle.j'arrête là. je change de banque. Heureusement que je n'y ai rien versé...", "Titre: Banque gratuite avec un service parfait Texte: Banque gratuite avec un service parfait.Des réponses adéquates sont apportées via e-mail ou par téléphone. C'est vrai que l'attente au téléphone est un peu longue (25' aujourd'hui), mais aucune perte de temps en déplacement ou en attente au guichet. Le n° n'est pas surtaxé.Carte de crédit gratuite (avec retraits gratuits partout en Europe), gestion de compte gratuite, appli \"hyper pratique\", pas de lecteur de carte nécessaire... je suis ravi !Attention, il faut pouvoir se débrouiller un minimum avec tout ce qui est numérique (scanner code QR, activation carte, obtention code PIN etc...)", "Titre: À fuir ! Texte: À fuir !! J'ai ouvert un compte le mois dernier,je n'ai jamais reçu le boîtier pour la carte ni les informations... j'ai envoyé plusieurs mails, jamais reçu de réponse... impossible de les joindre par téléphone, temps d'attente interminable...bref,très mauvaise expérience....!! Je suis contente de ne pas avoir encore déposé d'argent,je quitte cette pseudo banque sur le champ", "Titre: Keytrade en chute libre.. Texte: (17/04/2023) Keytrade en chute libre... Je suis client depuis plus de 20 ans quand VM&S était bien belge. Depuis le rachat par Arkéa France, tout f* le camp... mails à \"info@\" qui restent sans réponse ni même un accusé de réception, appel téléphonique sans réponse après 25 minutes. Je dois aussi regretter le remplacement de ma carte bancontact qui est maintenant VISA Debit, et que l'appli bancontact ne supporte plus pour faire des paiements via QR code. Evidemment Bancontact, c'est inconnu en France. Ce score 1/5 est un coup de gueule et non pas mon appréciation sur les 20+ années où tout allait bien. Je reviendrai modifier mon avis (si Trustpilot le permet) s'il y a enfin un suivi à mon e-mail du 9 avril que j'ai renvoyé aujourd'hui.(Edit 09/11/2023) J'ai renvoyé une demande par mail le 17/10 et cette fois-ci j'ai reçu une réponse le 02/11 pour me faire dire \"comme vous l'avez peut-être déjà compris, l'option de paiement peer-2-peer de Payconiq via le code QR n'est pas compatible avec les plus récentes cartes de débit.Il n'est donc plus possible de payer quelqu'un directement ou de se faire payer via un code QR généré dans l'APP de Payconiq. \"C'est faux et archi-faux. Ma femme est chez Belfius et elle a reçu une nouvelle carte Bancontact qui n'est plus une Maestro mais une Mastercard Debit, à 16 chiffres. Et Payconiq fonctionne toujours, sans même avoir eu à enrôler la nouvelle carte.Pour le mensonge je maintiens mon 1* et on va me répondre \"nous sommes désolés d'apprendre\" bla bla...", "Titre: Plus de quatre  mois que j attend l… Texte: Plus de quatre  mois que j attend l ouverture de mon compte. Toujours pas de nouvelles !!!! Au téléphone, ils ne savent pas me dire où cela bloque.", "Titre: Très satisfait ! Texte: Très satisfait !Depuis peu, enfin!, les transactions sont débitées quasi immédiatement, quel bon en avant.Par contre lors de mon changement de carte (carte défaillante) mon ancienne a été désactivée 8j avant l’arrivée de la nouvelle… donc 8j sans possibilité de payement par carte et sans en avoir été averti.Pour le reste, ouverture de compte aisée en 2021, obtention de visa sans difficulté en 2021, ouverture de crédit hypothécaire assez facile en 2022.Et ils me paient 5cents/transaction Donc pour moi au moins 4 étoiles sur 5", "Titre: Jamais eu de problème  et toujours une… Texte: Jamais eu de problème  et toujours une bonne réponse au téléphone seul petit souci c'est le we le montant sur le cpt n'est pas toujours à jour.", "Titre: jamais de réponse au tél et réponse de robot par email ... Texte: Jamais de réponse au tél après maints rappels et longues attentes qui vident la crédit d'appel du tel ... Les réponses par email sont stéréotypées (réponse de robot) et ne correspondent pas au problème énoncé !Pas d'aide, ni tél ni email et on ne peut pas aller sur place à leurs bureaux ... ?????Pour moi, toutes mes connexions avec mon compte ont été bloquées sans raison: ils séquestrent vos avoir ...; Je ne sais pas comment débloquer soit par softkey ou hardkey, rien ne va ... !!!!et toujours aucune réponse au tél et j'attends encore la réponse par email ou suite au formulaire complété ... c'est à se taper la tête contre les murs ! On se demande vraiment si cette banque existe ou si c'est un leurre ?Entre-temps, mon argent est bloqué et que faire sinon, vraiment se taper la tête contre leur mur !! :-(Très très mécontente , déçue, horrifiée par cette absence de contact, et je ne sais pas à quelle instance porter plainte ????", "Titre: Gratuit mais service en dessous de… Texte: Gratuit mais service en dessous de tout.Impersonnel au possible.Jamais une explication, on vous dit \"c'est comme ça\".", "Titre: C'est la seul banque qui me paye. Texte: C'est la seul banque qui me paye pour l'argent que j'ai déposer chez eux, ok le service à la clientèle à du mal à suivre, mais bon sens, elle vous paye vos transactions! L'applis pourrait être plus aboutis, mais moi cela me va.", "Titre: Nickel Texte: Ouverture des comptes sans problèmes, assistance téléphone presqu'immédiate, application extra. Rien à redire", "Titre: Temps d'attente incroyablement long Texte: Temps d'attente incroyablement long, minimum 20 minutes... ensuite l'employé a été efficace mais c'est pas permis d'avoir à chaque appel un temps d'attente aussi long !! Parfois après 30 min y a toujours personne qui a décroché et ils ne proposent même pas un service de rappel", "Titre: impossible de contacter 35 min attente pour rien Texte: il y' a quelques mois on devait attendre max 5min au tel maintenant impossible d avoir le service après 35 min j ai abandonné bref une vrai catastrophe on dirait un entrepreneur que vous ne pouvez plus joindre et qui s en va avec votre argent ca fait peur surtout quand on sait que keytrade n a pas d agence !!!", "Titre: J'ai demandé un nouveau compte et de… Texte: J'ai demandé un nouveau compte et de supprimer un ancien compte (plusieurs fois), cette fois ils l'ont fait mais ont supprimés par erreur les deux. J'ai donc dû refaire une demande pour un nouveau compte : il y a 2 mois et toujours rien reçu... Je laisse tomber !", "Titre: Difficulté à ouvrir un compte Texte: J'essaie d'ouvrir un compte depuis plus de 2 mois.  En dépit de mes nombreux appels, les choses avancent tout doucement.  Difficile de comprendre...  Peut-être un manque de personnel dans cette société.Dominique Deschietere", "Titre: Le keyplan est une belle arnaque ca… Texte: Le keyplan est une belle arnaque ca fait 2 ans que j y ai souscrit et sur mes 1000 euro investi il me reste 840 euro donc ca rapporte rien pire on perd de l argent  donc je deconseille l ouverture de un keyplan chez keytrade bank", "Titre: Ouverture de compte Texte: Ouverture de compteDepuis Novembre 2022 il me contacte pour la même raison \" L'adresse que vous nous avez transmis ne semble pas correcte\"  hors que ça fait 4 ans que j'habite au même endroit et que j'ai jamais ce genre de blabla . Je pensais que c'étais une banque sérieuse mais manifestement ce n'est pas le cas . J'espère que c'est plus simple pour eux de clôturer un dossier que l'ouvrir ..", "Titre: Je déconseille ! Texte: 1. Keytrade n'est pas transparente avec ses clients. Ils ont refusé de m'expliquer les raisons de ma non obtention d'une carte Visa de base. Je voulais les connaître pour pouvoir y remédier. D'autres banques m'ont donné les conditions d'accès à leur cartes Visa. Keytrade m'a répondu qu'il s'agissait de popotte interne et qu'ils ne transmettaient pas ce genre d'informations à leur client. 2. Keytrade est une banque difficilement joignable qui ne cherche pas activement de solution pour améliorer l'expérience de ses clients. Keytrade est une banque en ligne. Les contacts se font donc par mail ou téléphone. Réponses tardives par mails, voir pas de réponse du tout. Longue attente au téléphone, redirigée au mauvais service, interlocuteurs désagréables, solutions mises dans les mains du client au lieu qu'elles soient réglées à la source par Keytrade. Une des personnes au téléphone m'a aussi dit que ma softkey ne servait pas aux paiements, mais juste à ma connexion à la banque. C'est faux, elle me sert aussi à effectuer mes paiements en ligne. 3. La softkey ne fonctionne pas pour tous les paiements pour lesquels la hardkey fonctionne. Ce n'est pas pratique, surtout pas pour une banque uniquement en ligne. Les seuls avantages de Keytrade sont quelle est gratuite, quelle partie pour les transactions et qu'elle offre un certain montant pour l'ouverture d'un compte. Pour le reste, je déconseille fortement", "Titre: Allo, il y a quelqu'un (de sérieux ici)? Texte: Je voulais ouvrir un compte suite à un changement dans ma vie. J'ai renoncé après ...10 semaines d'attente. Maintenant je comprends mieux pourquoi ils annoncent un service gratuit et essayent même d'attirer le chaland avec des promos. Un service de qualité, ça se paie. Allez, retour à une banque sérieuse. ils n'auront pas le fruit de mon labeur. Ciao", "Titre: Entièrement satisfait. Keytrade répond à mes besoins..comme plateforme d'investissement Texte: Je suis client chez eux depuis des années mais je l'utilise exclusivement pour des investissements.  Pas la peine de les voir comme une banque \"tout public\", ce n'est pas leur marché. Totalement satisfait de Keytrade mais j'utilise une autre banque pour mes opérations quotidiennes, cartes, prêts,...", "Titre: Je suis dans cette banque depuis fin… Texte: Je suis dans cette banque depuis fin 2021. Ce fut un peu le parcours du combattant au début car je faisais racheter mon crédit hypothécaire. Il a fallu batailler un peu pour le taux, pour conserver le taux mentionné dans la simulation. Mais ca a été accepté. Depuis je suis aussi chez eux comme banque quotidienne. L app et le site sont très faciles d'utilisation, jamais de bug ou de soucis jusque là. Pas de soucis avec la visa non plus. Quand j ai une question, j obtient toujours réponse adaptée de leur service commercial. Un petit bémol pour leur placements, au résultat négatif depuis 1an... mais la situation mondiale n est pas sous leur contrôle.", "Titre: Avis Keytrade Texte: Chers internautes, je pense que lorsqu'on lit un avis, il faut être extrêmement prudent (aussi bien en positif qu'en négatif). Les avis, que j'ai lu il y a quelques minutes, je ne suis même pas sûr qu'ils soient tous clients. Mon avis à moi.-> Pour ce qui du site web de Keytrade, je donnerais 4 à 5 étoiles. Clair, efficace, fonctionne correctement. Pour ce qui est de la sécurité par soft key, hard key, itsme. Pas de problèmes rencontrés. 4 ou 5 étoiles.J'ai fait appel au call center fin décembre et début janvier et il est vrai que le temps de réponse était/est mauvais. (fin décembre après 10/15 min), je raccroche. C'est la fin de l'année. Soyons tolérants. Aujourd'hui le 03/01, ils ont mis 10min49 afin de décrocher. Pas extraordinaire. La personne au tél a répondu à ma demande (à voir le suivi).Bon, je suis aussi client DB qui propose de nous rappeler dans les 24h. A voir ce que le client préfère. Je ne suis pas au courant des répercussions du rachat de cette  banque par le groupe Crédit Mutuel Arkéa. En résumé, assez étonné de la note si négative. Je reviendrai corriger cette note (à la baisse ou à la hausse) ultérieurement.", "Titre: Je ne comprends pas les avis négatifs Texte: Je ne comprends pas les avis négatifs... Pour ma part, je suis contente : le site internet et l'application fonctionnent bien, la partie Bourse est facile d'utilisation et la présentation claire. Pas de frais de garde pour les titres ni de frais bancaires pour les comptes.", "Titre: mediocre sur toute la ligne Texte: Au secours, les branquignols ont pris le pouvoir dans cette institution.  Intermédiaire bien peu fiable à fuir de toute urgence.", "Titre: Évitez cette banque si vous avez des… Texte: Évitez cette banque si vous avez des projets concrets. Ils sont nul dans tout les domaines.", "Titre: Très déçu de l évolution de keytrade Texte: Je suis très déçu de l évolution de cette banque.  Je suis client depuis bientôt 20 ans et eux qui étaient a la pointe dans tt les domaines  ( et que je recommandais a tout le monde) sont maintenant a la traine partout. Leur service client est un véritable trou noir. On s adresse  a une bureaucratie stalinienne. On vous répond que cela suit son cours. Et puis rien. Simplement pour ouvrir un compte additionnel cela prend une éternité. Je compte en semaine et je vais bientôt compter en mois. Même faire des achats en ligne avec des cartes keytrade pose souvent des problèmes ….. bref évolution dramatique qui sauf changement de cap fondamental ne présage rien de bon.   Qu ils arrêtent de donner 5 cents par transactions et consacrent leurs efforts a simplement avoir une banque qui fonctionne.", "Titre: le compte de mon compagnon est bloquée Texte: le compte de mon compagnon est bloquée, alors qu'il a envoyé la copie de sa carte d'identité.le compte est bloqué depuis le 17/09/2022 et on nous rétorque qu'il y a du retard dans les mails. hhhhhaaaaa une belle bande d'incapable et bien sur tout le monde va changer de banque.", "Titre: Je ne comprends plus cette banque dont… Texte: Je ne comprends plus cette banque dont j'étais très content. Il n'y a plus aucune réactivité. Je suis obligé de changer de banque, suite au blocage de mes comptes pour un scan de documents d'identité, les documents ont été envoyés le jour même mais depuis quinze jours il m'est impossible de payer quoi que ce soit, j'ai appelé. L'opérateur me dit que tout est en ordre mais il faut attendre la reaction du service. Manque de sérieux pour une banque…Dommage.", "Titre: Une vraie catastrophe....impossible de… Texte: Une vraie catastrophe....impossible de recevoir ma nouvelle  carte visa qui est arrivée à échéance....J'ai changé d'adresse depuis 2 ans et ils n'ont toujours pas fait la modification dans leur système !De plus impossible de la modifier moi-même par le site internet.Totalement incompétents Quand je pense que j'y suis depuis des années et qu'avant je n'avais aucun soucis....c'est décevant, je vais changer de banque !", "Titre: Carte de débit volée le 17 septembre Texte: Carte de débit volée le 17 septembre, toujours pas de nouvelle carte le 29 septembre! Pas de réponse à mon mail. Après une nouvelle demande par téléphone, une carte devrait m'être envoyée et cela prendra 1 semaine. Dans le meilleur des cas, il me faudra donc 3 semaines pour pouvoir utiliser à nouveau mon compte. Ma carte de crédit ING volée le même jour m'est arrivée le 20 septembre ... je ne recommande absolument pas Keytrade", "Titre: Service succession aux abonnes absent Texte: Liquider une succession chez Keytrade est le parcours du combattant .J'ai demandé la liquidation d'une sucession ,j'ai transmis ainsi que le notaire tous les documents depuis 8 mois et malgré de nombreux rappels toujours rien en vue , plus aucun signe de vie .Je n'ai plus confiance en cette banque depuis qu'elle est reprise par arkea .", "Titre: Faux prétextes et manque de transparence Texte: Il s'avère que au-delà d'un certain âge (lequel ?), il est impossible de sauvegarder et de faire traiter une demande de crédit immobilier. Au lieu de pratiquer une transparence à cet égard, Keytrade prétexte un 'problème informatique' (sic)  et vous engage à retenter vos simulations depuis un autre ordinateur !? En changeant les âges des demandeurs à la baisse sur le même ordinateur, miracle, ça marche  !!:-)) Belle crédibilité pour cette banque. Heureux de ne pas y avoir ouvert de compte !", "Titre: Je suis client depuis des années et je… Texte: Je suis client depuis des années et je n'ai jamais rencontré de problème sauf depuis le rachat par les français. Cette banque semble ne plus avoir aucun service clientèle. Tout prend un temps fou et leur demande sont erratiques et totalement incompréhensible pour certaines. C'est une vraie catastrophe. Au final, je pense que Keytrade n'existera plus d'ici 5 ans s'ils (mais je ne sais même plus s'il y a quelqu'un qui travaille dans cette banque?) y arrivent... Pour ma part, je m'en vais avant que le château de carte ne s'effondre", "Titre: Fuir à tout prix cette pseudo banque qui n'a que faire de \"ses clients\" Texte: Je n'ai qu'un mot à dire : FUYEZ cette banque et ne pensez JAMAIS à ouvrir un compte chez eux ! Même si on vous vend la gratuité et le remboursement de vos transactions !Cette histoire est longue mais vaut la peine d'être lue!Tant que tout va bien, pas de soucis, une app efficace, une vue claire sur les comptes, des transactions faciles. Mais quand un grain de sable ce met dans la machine aïe aïe aïe.Début mai, je demande une augmentation de ma ligne de crédit pour ma carte VISA étant donné qu'elle a servi à bloquer des réservations d'hôtels et que je souhaitait quand-même garder une petite réserve au cas où. Tout m'est indiqué de comment faire pour introduire une demande. Deux semaines après et à quelques jours de mon départ pour les USA, je me renseigne pour savoir où cela en est. On me répond que ma demande est en cours de traitement. La veille je retéléphone le matin et toujours la même réponse 'votre dossier est en cours', je leur précise que mon départ est le lendemain et on me certifie que ça va arriver. De retéléphoner l'après-midi si ce n'est pas ok. Ce que je fais vu que rien n'est encore fait. Là, à ma grande surprise on me dit que ma demande sera traitée en urgence … en urgence mais enfin j'avais entamé les démarches à temps. Je précise encore une fois à cette personne que je prends mon vol le lendemain aux aurores et qu'avec le décalage horaire et sans ordinateur à ma portée, j'aurai beaucoup de mal s'il faut encore faire quelque chose !Et toujours la même réponse : c'est encore et on ouvre un ticket ! Ah le ticket, qu'est-ce que je l'ai entendu celui-là ! Vous envoyez des mails, on vous répond d'être navré et que ma demande est remontée au service compétent !  Foutaise ! A ce jour, je n'ai jamais obtenu de réponses à mes questions. Mais le pire, c'est que ma ligne de crédit est arrivée le jour de retour en Belgique ! Bravo pour l'efficacité.Malheureusement mes déboires ne s'arrêtent pas là !Je perds ensuite ma carte de crédit, entre le moment où je m'en rends compte et celui ou je la bloque, elle a réussi à être utilisée sans le code. Incompréhension totale. Je me renseigne auprès de la banque en leur demandant comment cela était possible. Il fallait que je désactive la fonction sans contact. ! Ça paraît anodin comme cela mais il faut savoir que toutes les fonctions liées à la carte doivent être activées par l'utilisateur : achat en ligne / utilisation sur d'autres continents et j'en passe SAUF le paiement sans contact ! Un non-sens.J'ai contesté les transactions le 25/07, nous sommes le 11/08 et toujours rien, les mêmes paroles : votre dossier est en cours on transmet votre demande au service concerné !Je commence un peu par perdre patience et leur demande c'est quoi le problème avec les cartes de crédit : c'est le service, c'est avec VISA enfin y a un souci et là la réponse qui tue : nous comprenons madame mais nous sommes débordés surtout maintenant avec les demandes d'augmentation de ligne de crédit ! Ah je veux bien le croire : ils ont 'travaillé' un mois sur la mienne.La gratuité se paye et là j'en fait les frais ! Je vais donc retourner dans une banque classique avec de vrais interlocuteurs et surtout un guichet avec quelqu'un à qui parler. Quand je pense que j'ai failli renégocier mes crédits hypothécaires chez eux ! QUEL HOREUR !J'espère que mon récit empêchera de nouveau client à s'inscrire chez KEYTRADE car d'après tous les commentaires que je lis, 90% sont négatifs  !!!!!  Et le pire, ils ne répondent à rien, un scandale. J'ai pour habitude de les lire mais ici je ne l'ai pas fait et je le regrette amèrement !", "Titre: Service client nullissime Texte: Je confirme, service client deplorable. Ils font des erreurs et c'est au client a le regler lui meme. Il y a d'autres banques gratuites en ligne meilleure que cela", "Titre: Remis un formulaire d inscription il y… Texte: Remis un formulaire d inscription il y a 4mois et eu un mail puis plus rien…j ai appeler 3 fois à heure différente sur leur numéro pas gratuit bien sûr je viens de voir la facture 25euro pour que jamais personne ne décroche (je raccroche après 15minutes pcq jvai juste les insulte ) vraiment des guignols si vous voulez pas de clients ne faite pas de pub!", "Titre: C'est une bonne banque dans le sens… Texte: C'est une bonne banque dans le sens qu'elle nous verse quelques cents quand on fait des opérations! Aucune autre banque ne nous paie ! Donc à signaler  positive pour cela!", "Titre: Service client déplorable. Texte: Service client déplorable.Je n'ai jamais reçu de code de validation pour mon compte. J'ai envoyé plusieurs mails et à chaque fois on me répondait que ça allait arriver et que je devais patienter ou qu'ils avaient renvoyé le courrier. C'étaient souvent des réponses automatiques à moins que je ne m'énerve par mail. Cette histoire a duré près de 3 mois. Je me disais que je n'avais rien à perdre alors j'écrivais des rappels de temps en temps. Finalement, je suis passée à autre chose. Mais vu les retours que j'ai eu de leur part, je suis bien contente que mon argent ne soit pas chez eux. En cas de problème, sachez que vous ne serez pas aidés.", "Titre: Depuis presque 4 mois Texte: Depuis presque 4 mois, je suis confronté à des bugs sur le site \"bourse\" de Keytrade.Après plus de 12 demandes (mails / appels téléphoniques), je reçois des excuses et on m'informe que l'info a été transmise au département ad hoc... mais que tout cela ne m'empêche pas d'acheter ou vendre des actions.Bref, service nul de chez nul !!!", "Titre: La banque qui vous paye ... Texte: Je suis client chez Keytrade bank depuis plus de 20 ans. Je n'ai jamais rencontré de problème.Que ce soit avec la carte de débit ou ma carte de crédit (VISA Platinum) et toutes les assurances que celle-ci procure (annulation, rapatriement, accident de ski, etc.…). Carte VISA gratuite à partir de 12 opérations par an. Et cerise sur le gâteau, les opérations de payement me rapporte plusieurs euros par mois. Il est vrai qu'il faut une certaine dextérité pour utiliser le programme sur le NET, mais à 68 ans je m'en sors très bien. Dès lors, je ne comprends pas les détracteurs de cette banque en ligne non seulement gratuite, mais qui vous paie !", "Titre: Banque super efficace Texte: je suis client depuis 4 ans et j'en suis totalement satisfait, leur formules d'investissement sont très claires et intéressantes comparé aux autres banques,ce qui est sympa aussi c'est au lieu de payer des frais courant chaque mois (comme ING etc..) ici on reçoit un montant en fonction du nombre de transaction que l'on fait (sur le compte courant ) pour moi c'est une super banque et lorsque j'ai appelé le call center j'ai eu directement quelqu'un au bout du fil", "Titre: Ma banque principale Texte: Client depuis bientôt trois ans, je ne comprends pas les avis négatifs. Je me suis inscrit chez Keytrade pour un crédit immobilier, signé de mon canapé - essayez de faire ça ailleurs - et j'ai eu un dossier difficile, à cause de l'administration communale qui tardait à fournir certains documents. Keytrade m'a bien aidé, rassuré, j'ai eu un suivi de dossier très pro au téléphone.L'app iOS et le site web sont très clairs, pour la partie banque et investissement. Les produits keytrade sont compétitifs. Visa gold gratuite, pas de frais cachés.Le support par email est très efficace. Réponse en moins de deux heures, même vendredi à 21h!", "Titre: Tres bonne banque Texte: Tres bonne banque tres facile d utilisation et en plus de ça vous n êtes pas obliger de commander la carte bancaire", "Titre: Client depuis bientôt un an Texte: Client depuis bientôt un an. Je n'ai pas eu de problème, ouverture de compte individuel et compte joint gratuit, carte visa gold gratuite si 12 transactions par an ce qui se fait quasiment automatiquement. J'ai aussi commencé à tester leur partie investing avec un Keyplan tout est très facile d'utilisation. Pour le moment j'en suis ravi et au moins je n'ai pas l'impression de me faire voler pas des frais récurrents comme les banques classiques. Apres ce n'est pas encore au niveau des banques en ligne française.", "Titre: Aide inexistante et service succession… Texte: Aide inexistante et service succession invraisemblablement long. Les autres banques sont plus humaines, c'est dire.", "Titre: Attention en cas de décès familial. Texte: Attention, en cas de décès dans la famille, le service \"notary\" est d'une lenteur incroyable, plus d'un mois pour répondre. Les comptes bourses sont bloqués depuis plus de 6 semaines, je ne vous explique pas les dégâts en cas de chute comme ce mois de février.", "Titre: Bonjour Texte: Bonjour, en date du 9/01/2022 j ai demandé en ligne l'ouverture d un compte-titres en vue d'un transfert d un portefeuille existant. J'ai moi-même porté les éléments physiques à cette date en vue d'un traitement plus rapide de la demande. Plus d'un mois après même pas un accusé de réception et ce malgré un rappel par mail. Pour une banque en ligne un vrai désastre.... Je pars vers la concurrence.", "Titre: Bonjour. Désastre ! Texte: Bonjour.je suis client chez Keytrade depuis environ 20 ansPas de prob sauf depuis le changement de présentation destiné à améliorer le service ?????Le nouveau site est archiarchi nul, impossible d'avoir la ligne entière à l'écran ...sauf en minuscules caractères illisisibles pour un pensionné .En effet, le personnel ne sait pas ce qu'il dit, je possède 2 comptes et je souhaitais transférer des $ d'un compte vers l'autre.Le personnel m'a raconté nimporte quoi , pas moyen de transférer jusqu'à ce que je trouve moi-même la méthode.Quant à la visa, obtenue sans prob et rapidement , fonctionnement normal  pour le moment.Le prob est le site, si pas de changement, progressivement, à chaque vente je migrerai mais surtout pas vers la DB qui est encore plus nulle et extrèmement chère !Dernière précision, oui la nouvelle version du site est une catastrophe mais le reste des fonctionnalités est tout à fait correcte et je suis surpris que certains clients ne trouvent pas de réponse à leurs questions .Personnellement, je n'ai jamais eu de prob avec le service client keytrade..délais de réponse tjs courts, max 2 jPour le moment, je ne recommanderai pas Key, uniquement en raison de son site.Si celui-ci s'améliore je réviserai ma position", "Titre: Avis d'un nouveau client satisfait Texte: Ancien client depuis toujours chez ING et cherchant à obtenir un crédit, J'ai décidé de passer chez Keytrade Bank en raison de leur transparence et leur taux d'intérêt intéressant. Après plusieurs mois d'utilisation, je suis globalement content de leur service. Tous les comptes sont gratuits et la visa également (sous réserve d'être utilisée un minimum). Chez ING, je payais 50€/an pour la carte de crédit + quelques €/mois pour les comptes. Chez, KTB, on reçoit 5cent par transaction. En gros, au lieu de payer 100€/an, je les reçois.Pour le moment, je n'ai pas eu de problème : j'ai eu des réponses très rapides lors des échanges pour obtenir le crédit. Je n'ai pas encore essayé d'investir donc pour le moment je ne juge qu'une partie de leur service. En ce qui concerne la gestion bancaire, tout ce fait par leur site ou par l'application. De mon côté, je n'ai pas rencontré de \"bug\" pénalisant ou de problème particulier. L'authentification se fait par smartphone ou par un mini appareil, c'est assez simple.Bref, pour le moment, je suis content. On verra pour la suite", "Titre: Une banque ou joindre quelqu'un est… Texte: Une banque ou joindre quelqu'un est plus facile que vaincre le covid ... ha non en fait non, même mort j'aurai plus de chances d'avoir une réponse... on ne fait que te dire \"on va faire un rappel\" ... mais jamais on ne revient ...", "Titre: La dernière version est en effet bien… Texte: La dernière version est en effet bien moins intéressante que la précédente et présente de GROSSES lacunes.Je pense changer de fournisseur.", "Titre: Banque qui n'en a que le nom. Texte: Banque qui n'en a que le nom.Service client inexistant ou au mieux d'une incompétence crasse, frais d'ordres exhorbitants, interface de passage d'ordres nullissime, offre cartes de crédit qui confine au 'scam', à éviter absolument !La note actuelle est même généreuse.", "Titre: En 2022 Texte: En 2021, j'aurais donné 4 étoiles sans hésiter.Pour ce qui est des dossiers titres, tout était très bien jusqu'ici.Depuis la mise en service de leur nouvelle application, c'est maintenant  une veritable cata qu'ils appellent une \"amélioration\". Plus moyen d'imprimer correctement ce qui s'affiche à l'écran. Faut passer par export vers Excel (à maîtriser un peu) ou faire des printscreens.Plus autres difficultés ou problèmes.Si vous venez pour des dossiers titres, oubliez ! Aller chez leur concurrent (moins cher) où il y a aussi des problèmes d'impression mais c'est \"moins pire\".", "Titre: j'ai acheté un fond très connu les 50… Texte: j'ai acheté un fond très connu les 50 meilleurs entreprise mondiales les 50 titans keytrade a décidé de me le faire acheté sur la bourse de Londres du jour au lendemain un lundi matin je vois sur ma plateforme que les 50 titans ne valent plus que 0 USD tout perdu alors que sur Paris tout est ok d'après Keytrade la faute c'est un délestage et que il ne sont pas payé pour ce service \"j'aurais dûs le savoir\"après 25 ans je change de plateforme.Bonne chance pour les autres", "Titre: Quand un algorithme est plus important que l humain Texte: Quand ecris cet avis, la note etait deja de 1.6 sur ce site.Cette banque est oa banque de demain, aucune humanité, toute interaction importante ou non est algorithmique! Apres 5 appels, bonjour monsieur, vous envoyer ma nouvelle carte ou je ne vis plus... Oui nous savons mais notre donné qui vient du gouvernement est differente de ce que vous nous communiquer donc on peux pas.... Je peux rien faire... Ca fait maintenant 9 mois. Cette mascarade represente le miroir de notre société, si une info n est pas dans un tableau excel, c est forcément la mauvaise réponse. Oui l humain peux mal retranscrire mais dans une situation précise il peux faire quelque chose ui prend une seconde que le robot ne pourra jamais faire! Ca ne sera pas plus vert ailleurs mais je me donne deux ans pour sortir de cette banque.Ce système me donne envie de vomir!", "Titre: Je suis client depuis longtemps Texte: Je suis client depuis de nombreuses années, je n'ai jamais eu de souci avec la banque. Que ce soit au niveau de la plateforme informatique ou au niveau du service téléphonique. Maintenant, j'ai peut-être de la chance. Par rapport à d'autres banque comme Fortis que je quitte ou Delta Lloyd, il n'y a pas photo.À voir avec le temps, aucune solution n'est idéal. Mais celle-ci est de loin une des moins mauvaises du marché à mon avis.", "Titre: « Ouverture » d’un compte … Texte: En septembre, cette banque faisait une offre où ils offraient 50€ à l’ouverture d’un compte. J’ai rendu tous les documents pour ouvrir mon compte. Nous sommes en décembre et je n’ai toujours aucune carte ni aucun compte ouvert.", "Titre: bon produit avec garantie et gratuit... Texte: dans l'ensemble et par rapport aux banques standards, keytrade est bien.  c est gratuit, la visa a de bonnes assurances tout en étant gratuite si 12 achats par an, quelques problèmes technique sur amazon mais sinon, on peut dire qu'ils sont mieux que fortis en tout cas et que ca ne coute rien.", "Titre: La pire des banques Texte: La pire banque. Le tranfert interbancaire ne fonctionne pas avec eux. Service clients inexistant, 2 semaines pour avoir une réponse par e-mail. Presque impossible de les contacter par téléphone, et quand vous avez quelqu'un, ce sont des réponses creuses. A la limite un \"allez vous faire voir\" de leur part serait moins hypocrite.Paiement Amazon par Visa systématiquement refusé, il faut réessayer plusieurs fois avant que ca fonctionne. Et maintenant, ce sont les paiements Paypal qui sont refusés.Il ferait mieux de se recycler dans la culture de patates.", "Titre: Service clientèle hyper lent… Texte: Service clientèle hyper lent peu réactif. Il vous envoie de bureau en bureau bref énormément de perte de temps. A fuir absolument", "Titre: Je n'apprécie pas du tout la nouvelle… Texte: Je n'apprécie pas du tout la nouvelle présentation et souhaiterais retourner à l'ancienne mais c'est très difficile de contacter par téléphone alors comment faire?", "Titre: 2 Etoiles parce que pour moi le niveau… Texte: 2 Etoiles parce que pour moi le niveau de service fourni est en chute... deux problèmes Tech sérieux concernant la passation des ordres de bourses...en peu de temps... ceci sans qu'un message d'avertissement ne soit mis en ligne pour en informer le client (plus d'une heure à attendre au Tf pour qu'enfin on m'en informe ... alors que de ordres sont en cours!)... pour une banque faisant de la gestion boursière... pas sérieux. Le reformatage des écrans de trading... la gestion antérieure était plus claire/lisible... de plus et bien plus grave... suivant le service d'exploitation que vous utiliser (explorer, chrome, Edge) les sous-écrans ne sont plus utilisables (cela charge mais... vous attendez longtemps et au final impossible)... On reformate mais avec des programmes incompatibles avec les différents browser!!. Ayant été \"basculé\" d'office sur la nouvelle version j'ai du demander que l'on me remette sur l'ancien système. Si à l'avenir cette compatibilité informatique n'était pas réglée et l'ancien système supprimé... je changerais de banque. BIEN LIRE la nouvelle réglementation... le client devient une quantité négligeable!!! j'envisage sérieusement d'aller voire ailleurs et donc pendant mes prochains congés je vais aller voire les autres banques faisant de la gestion  boursière.", "Titre: Je suis client depuis que j'ai quitté…Delta Loyd Texte: Je suis client depuis que j'ai quitté la Delta Loyd qui me volait depuis des années avec des coûts prohibitifs quand vous êtes pauvre!  Ici c'est juste l'inverse ... mes cartes bancaires sont gratuites y compris visa.  Mieux encore depuis que je me suis inscrits j'ai du recevoir des centaines d'euros en cashback à coup de 5 cents!  C'est d'autant plus vrai que j'achète souvent de petits objets en ligne!  Merci à Keytrade pour m'avoir permis de quitter l'enfer de Delta Loyd avec des conditions avantageuses pour tous!", "Titre: Très content de cette banque que je… Texte: Très content de cette banque que je préfère à Fortis", "Titre: Je ne peux que confirmer Texte: Je ne peux que confirmer. Le service par téléphone est désastreux. Il faut attendre minimum 30 minutes pour avoir un interlocuteur qui n'aide pas vraiment. Pour obtenir une réponse aux emails, là aussi il faut être (très) patient.Lorsque tout est en ordre, disons quand même que le service bancaire proprement dit cela fonctionne plutôt bien. Carte VISA gratuite et rémunération (5 cents par transaction), c'est plutôt sympa.", "Titre: Impossible de devenir client (et tant mieux au final) Texte: J'ai ouvert un compte en ligne à la mi-septembre (le 16/09/21).L'ouverture traine, je téléphone donc 10 jours plus tard et on me répond que c'est normal qu'il y a du retard sur l'acceptation des demandes.10 jours plus tard, n'ayant toujours pas de nouvelles, je les recontactes. Après 30 minutes d'attente, on me répond qu'il y a un problème avec ma carte d'identité et qu'il faut que je la renvoi. Ce que je fait immédiatement. Et je reçois un accusé m'indiquant que tout est bien en ordre et qu'ils vont pouvoir procéder à l'ouverture du compte.Voila maintenant 15 jours que j'attends depuis ce dernier mail et toujours rien. J'ai tenté de leur téléphoner plusieurs fois mais jamais de réponse. Le plus longtemps que j'ai attendu au téléphone est 1h30 !!! Sans réponse. Bref à fuir.Ils ne vendent que du vent.Le seul point positif pour justifier les 1 étoile (on peut pas mettre 0). Est que leur musique d'attente est plutot sympas...", "Titre: Paiement refusé avec visa sur Amazon ! Texte: Date de l'expérience: 21 octobre 2021", "Titre: Service client exécrable Texte: Service client exécrable, on se demande même à quoi il sert. Je demande un rdv, on me répond qu’un numéro belge est obligatoire. Donc si je comprends bien, je n’ai pas le droit d’avoir un numéro étranger, même si je souhaite investir en Belgique. Du jamais vu! Apparemment ils n’ont pas besoin de nouveaux clients.", "Titre: A fuir Texte: A fuir , le service clientèle est injoignable (j'ai essayé de les joindre à plusieurs reprises et pendant plus de 30 minutes à différents moments de la journée)", "Titre: Plus de 1 mois pour une ouverture de compte bancaire ! Texte: Ça fait plus de 1 mois que j'ai fais une demande d'ouverture de compte à vue dans cette banque, tous les doc demandés ont été envoyés et je n'ai toujours pas eu de confirmation d'ouverture de compte, ni quoi que ce soit d'autre, ce n'est pas professionnel du tout.", "Titre: Keytrade n'en à rien à faire... Texte: Keytrade à décidé d'augmenter la sécurité de la carte visa... Du jour au lendemain, ma carte est refusée sur la plupart des sociétés de vente en ligne, dont Amazon ! Je demande à ce que cela fonctionne comme avant, on m'envoie bouler. Aucune solution proposée et ils ne répondent pas à mes mails ou Messenger (juste pour dire... Tant pis pour vous). Bref si la visa est devenue inutile, la banque keytrade également. Direction une autre banque qui aura un minimum de respect pour ses vieux clients", "Titre: Ne mérite même pas une étoile Texte: Ne mérite même pas une étoile, contact zéro, désagréable, sans compter que l argent pour les domiciliations doit être sur le compte 24h voir 48h avant sinon la domiciliation ne part pas et lorsqu'elle ne part pas rien ne nous averti, virement impossible après un certain montant sur appli obligation de se connecter via le site internet, sans compter que pour se connecter via le site il faut scanner un code QR qu on doit prendre en photo et qu on doit scanner avec le même téléphone, donc obligation d avoir toujours une personne tierce pour ouvrir le compte ainsi que de payer via site. Une vrai m..... Et pour couronner le tout, on ne peut verser du liquide sur le compte uniquement un retrait. Un Zéro pointer.", "Titre: Personnel peu aimable Texte: Personnel peu aimable, impossible de payer en ligne via leur application et le personnel vous prend de haut! Je ne recommande surtout pas !", "Titre: Keytrade \"c'est pas mauvais, mais c'est pas terrible non plus!\" Texte: Keytrade c'est un peu comme \"c'est pas mauvais, mais c'est pas terrible non plus!\".J'étais cliente chez ING jusqu'en Avril 2021, j'ai changé à Keytrade car ING devenait payant pour les + de 25ans et je doit dire que Keytrade est sérieusement à la masse niveau technologie.Je fais donc un récapitulatif des + et des - par rapport aux autre banques:Positif:+ compte à vue et épargne gratuit peu importe l'âge+ on a 5cent de gagné par transaction. On gagne plus d'argent grâce à cet avantage que sur un compte épargne (il faudra cependant voir quel va être le retour de pédale pour compenser cela côté Keytrade...)+ 50€ d'offert en devant client+ banque en ligne sympa et pratique (et chouettes couleurs)Négatif:- pas de QR code pour les virements instantanés (gros retard technologique)- le week-end faire une transaction entre vos comptes épargne et à vue met 2 heures avant d'arriver sur le compte à vue: je me suis retrouvée sans argent pendant 2 heures en vacances à cause de ça: chez ING vous avez l'argent direct en quelques secondes (gros retard technologique)- service client contradictoire: ils se contredisent entre eux (l'un dit \"on accepte les chèques FR\", on envoie le chèque original et finalement, quand on rappelle après une semaine sans nouvelle, l'autre collègue dit \"on n'accepte pas les chèques FR\")", "Titre: Un mois que je n'ai plus d'accès à mes… Texte: Un mois que je n'ai plus d'accès à mes comptes banquaire. Service client d'une nulité sans nom, une semaine d'attente pour une réponse à coté de la plaque, une autre pour autre réponse tout aussi médiocre ... Voila un mois que cela dure ... Un mois ... C'est trop long pour une banque ...", "Titre: Personnellement aucun soucis Texte: Personnellement aucun soucis, 5 jours ouvrables cartes et comptes opérationnel.", "Titre: HORRIBLE- À FUIR Texte: HORRIBLE- À FUIR Le service client en plus d’être désagréable ne sont jamais joignable ! De plus lorsqu’il y a un problème toujours aucun transféré de l’argent qui était sur ma carte volée depuis 3SEMAINES !! N’y aller jamais. Très mauvais et application la plus nulle du mondeDernière actualité : toujours aucune nouvelles depuis 2mois... Ils me fatiguent", "Titre: Client depuis 15 ans à la fois à titre… Texte: Client depuis 15 ans à la fois à titre personnel et pour mon entreprise , le centre d'appel est difficilement joignable et inefficace ,on se demande s'il y a quelqu'un au  front comme au back office  ... sans raison un virement en provenance de France a été renvoyé sur le compte de l'émetteur , du jamais vu dans ma carrière . La seule chose qu'ils savent faire c'est de faire poireauter les clients au téléphone . il y a mieux maintenant en Belgique !", "Titre: Une banque qui ne donne pas confiance. Texte: Je n'ai pas réussi à ouvrir un compte. Huit semaines après la demande d'ouvert de compte, on me dit que tout est en ordre et que c'est en cours. Plusieurs appel pendant l'attente et à chaque appel, on me dit que ça va arriver fin de semaine, que le dossier va être escaladé à l'équipe en charge de l'ouverture des comptes.J'ai attendu encore deux semaines, et on me sort encore le même refrain. Bref, c'est du mensonge afin de faire patienter les gens. J'ouvre un compte dans une banque pour y placer mon argent. C'est une relation de confiance. Si l'un des parti n'est pas honnête envers l'autre, ça ne peut pas marcher.J'ai demandé l'annulation de la création de compte.J'aurais certainement patienté si dès le début Keytrade avait été transparent et indiqué le délais pour une ouverture de compte, au lieu de mentir à ces futurs clients.", "Titre: SERVICE CLIENTELE DESASTREUX !! Texte: SERVICE CLIENTELE DESASTREUX !!! depuis >12 mois.Dialogue de sourds. Impossible de recevoir LOGON pour mon épouse malgré multiples coups de tél + mails.IMPOSSIBLE d'avoir un responsable/dirigeant au tél.Mon rating est au mieux: 0,5/5Etienne de Walque", "Titre: Désastreux Texte: Désastreux ! Aucun suivi clientèle. J attends mes cartes bancaires pour commencer à utiliser le compte que j ai ouvert en ligne mais rien ne vient depuis 5 semaines.Je vais me tourner vers une autre banque.", "Titre: Je donne 5 sur 5 car même si le service… Texte: Je donne 5 sur 5 car même si le service clientèle est long et laisse parfois à désirer. Je suis satisfait du compte, les cartes de débit et crédits. De plus, les produits sont ultra compétitifs. La seule banque en Belgique qui rétribue ces clients avec un véritable compte bancaire qui ne coute rien.", "Titre: Au final je suis satisfaite de Keytrade Texte: Bonjour,c'est vrai que le service client est désastreux et j'ai aussi bien galéré pour l'ouverture de mon compte client + visa, mais le fonctionnement du compte est parfait, l'appli est nickel (ce qui est rare), le paiement en ligne est d'une simplicité déconcertante.Donc au final, en ce qui concerne mes comptes, je suis satisfaite de Keytrade.", "Titre: Cloturation du compte sans… Texte: Cloturation du compte sans justificatif.Mail envoyé pour connaître la raison, jamais eu de réponse. Service minable", "Titre: Un désastre Texte: Un désastre. Cette banque a clôturé mon compte unilatéralement. J'étais client depuis sa création. Pas de recours possible et perte d'argent sur la clôture obligatoire de certaines positions.", "Titre: A éviter. Perte de temps total - incohérence dans leurs services Texte: Début des négociations le 18 mars 2021 pour un rachat de crédit hypothécaire.La simulation faite en cette date n’est malheureusement plus valable car sauvegardée et non envoyée (alors que la personne de contact chez eux m’avait garanti que les simulations enregistrées jusqu’à date de validité restait valables). Soit on adapte le taux en leur faveur mais ça reste intéressant.Je reçois l’offre de crédit avec les 25 documents à envoyer.. j’ennuie mon employeur, celui de mon compagnon.. on fouille dans tous nos documents pour leur renvoyer les documents demandés en temps et en heure.Tout est bon. J’ai un de leur collaborateur en ligne. Il me reste juste à faire expertiser la maison à hauteur de 250€. Je fais les démarches.Aujourd’hui 12/04 (un mois après le lancement du dossier) c’est soit disant refusé car nous avions fait appel au report du crédit pendant la période covid (chose légal qu’on offert toutes les banques).Nouvelle règle chez eux. Ils ne refinancent pas les crédits qui ont pu bénéficier de cette aide.Plutôt que de le dire directement... non 1 mois d’emails, d’appels, d’attente... etc pour rien.Communication très difficile.. plusieurs jours pour avoir quelqu’un en ligne. Mauvaise coordination de leurs services.. un dit oui.. l’autre dit non.. qui croire?Perte de temps.. fuyez..", "Titre: juste bon a ouvrir des comptes ... MAUVAIS partenaire Texte: juste bon a ouvrir des comptes .... notion de service est ZERO et hyper procedurier. ouvrir un compte 10 minutes ...cloturer votre compte pas de fin ....", "Titre: Scandaleux. Texte: Dommage que l'on doit quand même cocher une étoile. Scandaleux. Je possédais un compte et j'ai demandé pour effectuer un virement en chine pour un objet que je souhaitais acheter. Ils ont considéré cela comme une transaction \"pro\" et un mail annonçant qu'on allait clôturer mon compte mais que je devais faire la demande moi-même pour le clôturer ! 2 mois passe, et ce matin, je remarque que mon compte ainsi que la visa sont supprimés de l'interface keytrade, sans aucun avertissement. Quid des domiciliations, quid du solde restant sur le compte, quid des paiements en cours sur ce compte ? J'attends toujours la réponse. Bref, en ouvrant un compte chez eux, il faut savoir qu'on peut vous \"gicler\" comme un malpropre du jour au lendemain. Pas très rassurant quand on parle quand même d'argent...", "Titre: Je ne peux pas mettre 0 étoile car le… Texte: Je ne peux pas mettre 0 étoile car le mériterais, service clientèle inexistant, et pas un seul responsable de se rendre compte que ce service est d'une nullité incroyable. Plus de 70 minutes au téléphone avant d'avoir quelqu'un qui ne sait en fin de compte, pas vous aider. Messieurs de la direction, peut-être cherchez vous à faire couler la banque ? Je pensais ouvrir un compte titre mais ce serait du suicide, et des l'intention des peuples de fidélité je clôture mes comptes, un conseil éloignez vous de cette banque. Keyt32691 et je signe, peut-être qu'un responsable un vrai m'appellera mais je doute fortement.", "Titre: Perte de temps Texte: Je fais le tour des banques afin de refinancer mon crédit hypothécaire, et je tombe sur keytrade. On nous vend un taux bas, pas de frais de dossier, pas d'obligation d'asrd/ass incendie. Ca a l'air top.Le 07/12 je fais une simulation sur leur site dans 'mon espace personnel'. Le produit m'intéresse, je souhaite entrer une demande. Mais le site est buggé (dans Chrome), impossible d'encoder les données. J'envoie immédiatement un email à leur support. Le 10/12 on me répond avec un email générique que je dois encoder ma demande dans 'mon espace personnel'. Ca commence bien.. Le 13/12 j'encode la demande via Safari, la procédure est longue, beaucoup de documents à fournir, il faut installer un software additionnel pour signer, mais ok ça marche. Et puis plus rien, silence radio. J'appelle, j'envoie des mails, ça ne donne rien. Le 28/12 ma demande tombe à expiration. Le 08/01 (oui 1 mois plus tard!) ma 'gestionnaire de dossier' m'appelle pour la première fois. Super, j'ai qqn du 'business' au téléphone, je vais pouvoir poser mes questions. La personne me dit que je ne dois pas être impatient et m'indique qu'il manque un document (qui n'était pas demandé sur leur site). Ensuite je lui dis que j'ai reçu d'autres propositions de la concurrence: est-ce que Keytrade peut s'aligner ? Réponse : ah monsieur je ne sais pas, ça dépend des taux directeurs blablabla. Bref, je laisse tomber keytrade, ça devient trop n'importe quoi. C'est quand même dingue: le client vient à eux avec un dossier solide, prend du temps pour trouver un workaround à leurs problèmes techniques, prend l'initiative d'appeler/envoyer des mails quand la demande tombe à expiration, et au final se fait dire qu'il est impatient et n'obtient aucunes vraies réponses à ses questions légitimes.", "Titre: Demande ouverture de compte début mois… Texte: Demande ouverture de compte début mois de septembre documents signés et envoyer aujourd'hui nous sommes le 16/ décembre toujours pas de nouvelles rien rien le plus absurde je reçu un email me disant que les documents est conforme.. Fiez fiez encore..vous méritez même pas une étoile.", "Titre: À FUIR Texte: Client chez eux depuis 3 mois, j'essaie d'avoir les comptes, les cartes, les autorisations de découvert en ordre. RIEN. Pas de réponse aux mails, des réponses du style \"j'écris un mail interne au service\" au help desk.J'ENVISAGE SÉRIEUSEMENT UN RETOUR À MON ANCIENNE DEUTSCHE BANK!!! Même si cela doit me coûter un peu d'argent, là au moins j'ai un service.", "Titre: Cela fait 1mois que j'ai introduit une… Texte: Cela fait 1mois que j'ai introduit une demande d'ouverture de compte.Une réponse, tout est en ordre si nécessaire on vous contacte. Plusieurs courriels pour avoir le message \"merci de vouloir ouvrir un compte chez nous, veuillez remplir les documents en ligne\"On se moque de qui !?", "Titre: A fuir ... Texte: J’étais client chez eux et assez satisfait, mais depuis quelques mois le service était devenu déplorable. La première qualité d’une banque en ligne devrait être d’être joignable, mais mes emails ont tout bonnement été ignorés et lorsque j’avais la chance d’avoir quelqu’un en ligne, les informations données s’avéraient par la suite incorrectes et le seul soucis de mon interlocuteur était de s’entendre dire qu’il avait répondu à toutes mes questions ( on se serait cru chez Amazon...) . A fuir si vous ne voulez pas perdre votre temps et votre énergie.", "Titre: 4 semaines pour un compte ! Texte: J'en suis à 4 semaines d'attente pour l'ouverture d'un compte et aucun retour de Keytrade sur mes multiples mails...Je vais donc retirer mes autres comptes et partir chez une autre banque !", "Titre: Rien à redire Texte: Je suis client depuis quelques années (compte ouvert pour faire \"mumuse\" en bourse mais faut être tous les jours sur les sites pour cela...Au niveau banque, rien à dire, nettement plus rentable que les autres, 5 cents par transactions, d'office, on est gagnant. Les commentaires négatifs sont souvent générés pas la frustration (délais d'attentes, etc) mais personnelement, jamais eu de soucis..", "Titre: Très satisfaite Texte: Bonjour,Je suis stupéfaite de voir tous ces avis négatifs !Je suis chez Keytrade depuis deux ans, quelques connaissances depuis plus et je n'ai JAMAIS eu aucun soucis avec cette banque ! Je les ai appelé une fois pour une question d'appli parce que je ne comprenais pas grand chose et on m'a répondu de suite très très clairement, patiemment et gentiment.Mais je vois que la plupart des messages datent de la période de confinement, c'est peut-être à cause de ça. Il est vrai que tous les secteurs ont étés touchés donc soyez un peu patients et compréhensifs.Merci", "Titre: Franchement je ne comprends absolument… Texte: Franchement je ne comprends absolument pas les avis des négatif , je suis client chez eu depuis plus de 5 ans ..1 c est gratuit ( notamment carte visa ) et on vous paye carrément pour les opérations 2 service Skype et téléphonique, efficace et rapide3 jamais aucun de souci d appli ou pc banking.4 plusieurs personnes on été parrainées et en sont très satisfaiteset je passe les détailMaintenant c est une banque qui prends des précaution a ne pas faire de prêt a des personnes a risque , ce que je trouve tout a fait normal ...je suis surpris de l avis de certaine personne , peut être est le covid qui monte a la tête ....", "Titre: Qualité en chute libre Texte: Clients depuis leurs débuts (époque du lancement des banques en ligne pour taux d'épargne élevés et comptes-titres gratuits), pour les services ne nécessitant pas trop de contacts et peu d'usage du site.Malheureusement ils ont repris, notamment, tout d'abord la clientèle Kaupthing lors de sa faillite, puis surtout Cortal, qui elle était une banque avec un personnel compétent et dévoué!: on pouvait y déposer des avoirs nécessitant plus de questions, personnalisation des services etc.!Même s'ils ne nous servent que de banque de dépôt épargne et titre, donc les visites du site sont rares et les obligations de contact encore plus, la qualité des services ne cesse de chuter.Nous pensons sérieusement à les quitter.", "Titre: C'est la banque que je conseille Texte: À part un bug persistant dans l'application mobile et desktop, je n'ai jamais rencontré de problème avec ce service. On a facilement quelqu'un au téléphone et ils répondent par mail. Ce sont les moins chers. C'est la banque que je conseille à tout le monde.", "Titre: 19 jours après la perte de ma carte de… Texte: 19 jours après la perte de ma carte de débit, j en reçois enfin une nouvelle... mais elle ne peut être activée car le logiciel d activation signalé que les 4 derniers chiffres de la carte ne sont pas correct. Bref, banque à éviter car incapable de fournir un service de qualité acceptable car admettons qu un remplacement de carte de débit est un acte basique.", "Titre: Je tombe par hasard sur le site d'avis Texte: Je tombe par hasard sur le site d'avis, et suis étonné des avis négatifs. Mes comptes prof' et privés ( titres également) sont depuis de longues années chez Keytrade, et je n'ai jamais eu de souci. Il est vrai que les avis négatifs portent en principal sur les crédits, ce qui n'est pas mon cas. Je suis très satisfait de la gratuité de nombreuses choses, et des 5 cents/opération. Mais il y a certaines améliorations à faire, notamment dans la présentation des virements.", "Titre: Prix chers bugs et mauvais services. Texte: Prix chers buts et mauvais services.", "Titre: A éviter Texte: Bonjour,En lisant vos avis, je suis bien content qu'il m'ont refusé un refinancement.Pourtant j'avais prouvé qu'il y avait 6000€ de rentrée mensuel pour un remboursement de 910€ par mois. Il voulait que je leur prouve que j'ai un compte avec min 20000€ en dépôt et il voulait aussi réduire  le temps ( de 20 ans à 16 ans). J'ai compris qu'il n'avait aucune envie de me proposer un prêt et on tout fait pour me dégouter", "Titre: Apparemment ouvrir un nouveau compte… Texte: Apparemment ouvrir un nouveau compte suite à une succession est au-dessus de leurs possibilités. J'essaye de faire transférer des titres de mon papa décédé il y plus d'un an et cela leur pose des problèmes insolubles. Je suis allé 3 fois sur place, ils me disent que cette fois tout est ok et puis ils me redemandent des copies de cartes d'identités déjà fournies.", "Titre: Lamentable 3 mois pour obtenir une… Texte: Lamentable 3 mois pour obtenir une réponse NEGATIVE !!!!!!!!!!!!!!!!!!!!!!!!!!!!honteux pas d'autres mots !", "Titre: Fuyez cette banque!! Texte: Fuyez cette banque! demande de crédit hypothécaire, ils font poireauter 2 semaines et faire payer 250€ d’expert pour au final dire que suite au 01/01/2020 (avis banque nationale pour prêt a 90%, ce qui est compréhensible) mais surtout que du au covid-19 ils n acceptent plus de faire des crédits à 100%. Merci de m’avoir fait perdre mon temps et mon argent! Merci aux banques pour la solidarité! Elle est belle l’Europe des banques...", "Titre: Ai attendu 3 semaines pour rien.. Texte: Ai attendu 3 semaines pour rien... si ce n'est me faire aboyer dessus!J'ai finalement souscrit mon crédit hypothécaire ailleurs. Dans une vraie banque! En plus d'être lents, ils sont hyper désagréables. J'ai eu au téléphone une hystérique qui m'a carrément hurlé dessus! Je rejoins donc les nombreux avis négatifs écrits ici. Ne perdez pas votre temps avec ces guignols!", "Titre: de Charybde en Scylla Texte: Je suis client chez eux depuis près de 20 ans (quasiment à leurs débuts).  Au départ, courtier en ligne efficace qui répondait parfaitement à mes besoins et ce, avec des coûts très concurrentiels par rapport aux autres intervenants, on est passé à une banque \"fourre-tout\" mauvaise en tout.  La plateforme de courtage est désastreuse avec de terribles lenteurs et, de plus en plus souvent, l'impossibilité d'y accéder.  De plus, les frais prélevés ne sont, à présent, plus du tout concurrentiels.  Bref, pour ma part, la coupe est pleine et je change de crèmerie.", "Titre: Mensonges à répétition Texte: Dossier déposé le 14 janvier. J'ai dû appeler toutes les semaines pour savoir ce qu'il en était de mon dossier. Aucun respect pour les clients. M'assure de me donner un retour dans la journée. Ne rappelle jamais. Pour finalement le 10 mars après 3 appels d'affilé, ils finissent par m'envoyer un mail pour ne pas m'autoriser à ouvrir un compte chez eux sans aucune explication. Tellement de mensonges ce sont entremêlés ces dernières semaines. C'est dommage", "Titre: J'ai un compte depuis plusieurs 10 ans… Texte: J'ai un compte depuis plusieurs annees...et la vitesse de reponse du site ne fait que se degrader.  Le site est assez bien fait pour une banque en ligne mais ils n'ont pas la capacite pour gerer le nombre de clients et le volume de transactions.  Le service telephonique est egalement assez lent.  En resume, un mauvais service pour une banque en ligne.  Je viens d'ouvrir chez Medirect en esperant que le service soit meilleur.", "Titre: Service clientèle Texte: J 'avais eu un petit problème avec mon abonnement  Le service m'a téléphoné =l'employé=M.Olivier a réglé le problème rapidement ! Il est,en outre,une personne aimable,polie,efficace:merci à lui .très contente de son intervention MERCIIIIIIIII", "Titre: Je confirme les avis précédents.. Texte: Je confirme les avis précédents... désastreux, pas de suivi, service en ligne et mail sans réponse..; catastrophe, une demande de compte de plus d'un mois et rien , pas de contact, pas d'explication, très mauvaise image... à mon avis ils ne veulent pas de clients supplémentaires... un conseil : évitez cette banque vous allez perdre du temps et de l'énergie pour rien, et dire que test Achat en a fait un modèle dans son enquête, preuve qu'ils ne sont vraiment pas objectif ou qu'ils n'ont as fait de demande en ligne eux même..; c'est comme toutes leurs enquêtes d'ailleurs..", "Titre: Service clientèle catastrophique (voire… Texte: Service clientèle catastrophique (voire inexistant)Après avoir essayé de réunir les conditions pendant deux mois pour migrer tout chez eux, j'ai abandonné cette idée. Le service à la clientèle est quasi inexsitant ce qui n'est pas acceptable pour une banque en ligne. Ne perdez pas votre temps...", "Titre: Service clientèle désastreux Texte: J'ai ouvert un compte commun chez Keytrade en novembre 2018 et pensais sincèrement qu'il s'agissait d'une bonne idée. Problème, je n'ai jamais su utiliser mon application car le code QR envoyé par Keytrade (après un délai assez long de 15 jours) ne fonctionnait pas. Lorsque j'ai demandé un nouveau code QR, on me l'a envoyé près d'un mois après ma demande. J'étais assez heureux de voir qu'il fonctionnait mais j'ai vite déchanté dans la mesure où je devais obtenir un code de récupération auprès du service client de Keytrade. Après plusieurs appels et plusieurs essais infructueux, le service client m'a dit qu'il n'avait aucune solution à part m'envoyer une nouvelle fois un code QR. Bref, on tourne en rond et on avance pas. Le service client ne donne que des réponses stéréotypés à croire que le personnel se contente de lire une feuille avec les étapes à suivre sans réfléchir et sans prendre les choses en main. J'ai décidé de clôturer mon compte après une tel service désastreux. J'ai envoyé une demande d'ouverture de compte auprès d'ING et j'ai disposé d'un compte commun avec accès à l'application dans l'heure.Je conseille donc aux gens qui n'ont pas de temps à perdre de passer directement pas une banque connue. Bonne journée à tous.", "Titre: really bad customer service Texte: J’ai envoyé plusieurs mail pour une demande de nouveaux logins sur une période de 2-3 jours, aucune réponse! Les appels n’en parlons pas, aucune réponse non plus ! Bad customer service, rarement vu cela...", "Titre: Incompétent dans tous les domaines Texte: Incompétent dans tous les domaines:- Comptes inexactes suivant la plateformes- Bugs répétitifs - Niveau informatique, c'est le néant- Ne sont jamais disponibles et ne répondent pas- Ne ferme pas les comptes malgré les documents envoyésBanque française ==> Fuyez", "Titre: Un service clientèle qui manque d'empathie et pas professionnel. Texte: Une communication exécrable, les délais de réponse sont juste irréelles en 2019 avec tous les technologies existantes.Comme souvent si c'est compliqué au début d'une relation il faut s'attendre à 10x pire en cas de pépins...Cette banque comme ses consoeurs Neo Banques, s'adresse à des clients basiques avec des opérations toutes simples. Préférez toujours une grande banque classique ayant pignon sur rue. D'autant que la différence en frais n'est pas insurmontable . Pour ma part j'ai déjà testé plusieurs Neo Banques, leurs ADN sont assez semblables.Quand tout va bien, pas de stress. Mais quand ça va plus, bonjour le stress, comme ils n'ont pas de bureaux physiques, pas facile de leur mettre la pression. Et les télé-opérateurs se cachent derrière leurs écrans. A force de tout digitaliser et de réduire les couts partout. Il n'existe plus aucune relation humaine de qualité."]