["Titel: Rekening openen is blijkbaar onmogelijk Tekst: Sinds midden juni een rekening proberen openen, we zijn nu eind augustus en ik heb nog steeds geen nieuws of rekening. Blijkbaar hebben ze klanten genoeg. Berichten naar de helpdesk geven als antwoord: gelieve nog even geduld te hebben of we kijken het na. Nog nooit meegemaakt…", "Titel: Geen reactie Tekst: Ik heb nu al drie weken geleden gevraagd om mijn beursrekening op te zeggen volgens hun voorwaarden. Ze doen niks en reageren niet. Geen telefgoontje, geen mail... Niks. Wellicht ga ik binnenkort volledig weg bij hen. Slechte bank.", "Titel: Ben al jaren klant en ik had vroeger… Tekst: Ben al jaren klant en ik had vroeger totaal geen! klachten,maar! sinds men het programma heeft veranderd voor trading en andere is alles zwaar achteruit gegaan op alles! werking,snelheid antwoorden,service etc etc . Mijn persoonlijke banking reeds lang geleden verhuist en nu nog alleen met trading. Het enige dat mij nog tegenhoud zijn de schandalige kosten om je aandelen te verhuizen. Maar als dit nog lang gaat duren verhuis ik heel de boel!", "Titel: Kan geen aankopen meer doen van aandelen Tekst: Kan geen aankopen meer doen van aandelen met iPad. Probleem sleept al twee maanden aan. Net een gemiste oproep gehad van Keytrade. Tot 2 x toe bel ik terug met de vraag mij door te verbinden met persoon met wie ik converseer per mail. Ik wordt echter niet doorverbonden, ik moet maar een mail schrijven. Je komt dan op de rol en kan telkens een week wachten op antwoord. Service en toegankelijkheid zijn dramatisch. Wist niet dat dit nog bestond.", "Titel: Vriendelijke service met lange wachttijden Tekst: Ik heb af en toe problemen met bankieren en dan zijn ze wel goed bereikbaar via telefoon. De wachttijd is altijd heel erg lang (soms meer dan een uur) maar ze helpen je wel vlot verder. Ook altijd heel vriendelijk. Mailen is afgeraden voor dringende zaken, ze mailen niet snel terug.", "Titel: De medewerkers liegen Tekst: De medewerkers liegen. Geen 50 euro gekregen omdat ik blijkbaar de promocode niet ingaf. Dus heb er meer dan 6 keer voor moeten bellen en telkens zeiden ze dat het in orde ging komen. Inmiddels langer dan een maand later en nog niets gekregen. Ik heb tijd  en geld verspilt met telkens te moeten bellen. toen ik de voorlaatste keer belde zeiden ze tegen mij dat ze de 50 euro zouden storten. Dit gebeurde niet dus heb ik weer een week later gebeld en zeiden ze me dat ze het niet gingen storten omdat ik de code ben vergeten in te geven. Ze hebben me zo vaak gezegd dat de storting ging gebeuren en dan pas na de 7de keer gebeld te hebben zeiden ze dat ze de storting niet zouden doen. Ze zijn niet te vertrouwen.", "Titel: Alles is goed , maar .... Tekst: Alles is goed . De app is voldoende. Is gratis en krijgt vergoeding per verrichting. Daarnaast zijn er ook belangrijke minpunten. Overschrijvingen zijn tergend traag. Dit zal misschien verdwijnen wanneer de banken verplicht worden om snel overschrijvingen uit te voeren. Ook het koppelen van Payconiq was heel omslachtig. Verder gebeurt alles als bij andere banken maar trager.", "Titel: Fraude gebeurt met mijn kredietkaart… Tekst: Fraude gebeurt met mijn kredietkaart voor een aanzienlijk bedrag met 3 cijfers. Keytradebank heeft mij volledig vergoed. Ik lees daarnet dat maar 1 op 3 slachtoffers worden vergoed door de bank. Proficiat", "Titel: Ik kan niet via qr code betalen. Tekst: Ik kan niet via qr code betalen.Vb:qr code aangemaakt met verzoek tot betaling aangemaakt door Pnb Fortis app.Wordt niet gelezen door Keytrade scanner.Bij betalingen bij winkeliers die geen payconic app.gebruiken dien ik dan casch te betalen.Deze casch heb ik dan niet altijd bij wat dan voor problemen zorgd.", "Titel: Rekeningen afsluiten. Tekst: Rekeningen afsluiten.TF 026799000  geen reactie \"al onze lijnen zijn bezet\"drie keer opgeroepen geen teken van leven +- 120 min al gebeld. Verschillende mails gedaan geen reactie. Ik ben ten einde raad en al mijne tijd aan verspild. IK zal uiteindelijk dit moeten oplossen via een aangetekend schrijven of via testaankoop een klacht indienen. Dit probleem is al vanaf 13/02/2024 aan de gang. Moet er nog zand zijn??? Klantenservice onder nul.", "Titel: Geen hulp Tekst: Had per ongeluk een overschrijving gedaan naar verkeerde bankrekening. Naar hun helpdesk gebeld en gevraagd of ze me konden helpen met het bedrag terug te vorderen. Het antwoord was neen, tot als ik zei dat ze wettelijk verplicht zijn hiervoor een dossier te openen en hiervoor al het mogelijke doen. Toen konden ze plots wel een dossier openen en gingen ze mij binnen de 48u op de hoogte houden? Tot op heden niets gezien of gehoord. Gelukkig was de andere rekeninghouder zo vriendelijk om het bedrag meteen terug te storten.", "Titel: heel tevreden Tekst: ik gebruik deze als 2de bank en denk eraan als eerste te gebruiken. Met kan ik dankzij visa debit wel betalen met visa in frankrijk. MIJN ING MAESTRO WERKT OP VELE PLAATSEN NIET. Wij organiseren iedere zaterdag samenkomst vrienden eten en drinken en ze betalen mij telkens op einde van de avond met payconicq. Zie niet waar probleem is. Enige minpunt is instant betaling en als je betaald dat je niet ziet wat op de rekening staat en wat beschikbaar is.", "Titel: Ervaring bij Keytrade Tekst: Bij jullie wordt je zwzniet overstelpt met nutteloze reclame,graag had ik stapje verder gedaan qua investeren,maar daar zal ik hulp bij nodig hebben.Die ga ik bevragen bij mijn zoon,die ook klant is bij jullie.Hopelijk komen we er samen uit.", "Titel: Waarom Keytrade Tekst: M.i. heeft Keytrade alles waar een digitale bank aan kan voldoen. Goede service, snelle verwerking van het gevraagde en een eerlijke intrest. Als kers op de taart ( eurocent per verrichting, geen schatten maar aangenaam op het einde van de maand.", "Titel: Heel slecht telefonisch ontvangen, niet geholpen Tekst: Ik belde het nummer +32 8 679 90 00 en kreeg een man aan de lijn die absoluut niet wilde luisteren naar wat ik te zeggen had, hij herhaalde maar dat niet naar hem luisterde en dat ik een inlogcode nodig had en als ik zeg die heb ik zegt hij meneer als u mij onderbreekt leg ik af. en dat heeft hij dan ook gedaan nadat ik nogmaals aangaf de inlog code te hebben..", "Titel: De enige bank waar je geld krijgt bij het gebruik van je rekening Tekst: Al jaren tevreden klant. Een bank die je niet laat betalen voor het beheer van je eigen geld. App is beter geworden, maar nog niet optimaal. Jammer dat de functionaliteit met Payconic niet meer werkt zoals voorheen. Al bij al zeer tevreden.", "Titel: Keytrade & Payconiq Tekst: Na een lange wachttijd eindelijk een medewerker aan de lijn gehad met de vraag waarom mijn kaart niet aan Payconiq gelinkt wordt. Uiteindelijk krijg je een email met de nodige uitleg en het verzoek om terug te bellen als het niet lukt. Opnieuw kon de kaart niet gelinkt worden en dus opnieuw gebeld. Een ander medewerker wist dan te vertellen dat er een probleem is met de relatie Payconiq en Keytradebank. Er volgde een heel omslachtige, onbegrijpelijke uitleg ... met als resultaat : gewoon afwachten tot het probleem opgelost is.", "Titel: No nonsense online bank voor wie dagelijks bankieren wil Tekst: Al 2j klant bij Keytrade: meestal positieve ervaringen! Bewust gekozen voor deze bank: bij mijn vorige bank slechte ervaringen gehad (aan het loket al te vaak wandelen gestuurd) en bij Keytrade werkt alles gewoon (online) zoals ik verwacht. Pijnpunt is misschien wel de trage reacties op jouw mails.  Maar is nog altijd beter dan een bank waar je aan het loket toch doorgestuurd word naar... het hoofdkantoor 'per mail'. Een vriendin van mij was laatst nog over het klagen over een (dure) rekening zij had bij ING: aan het loket komen... enkel op afspraak in haar geval...Ideale bank voor dagelijks bankieren, zonder franjes, goedkoper dan goedkoper...", "Titel: Duidelijk en handig Tekst: Fijne aangename en handige app waar zeer veel zelf geregeld kan worden. Indien je ergens vastloopt is snelle en duidelijke hulp te beschikking. Zeer tevreden van de service en de bankdiensten in totaliteit.", "Titel: tevreden klant Tekst: gratis rekeningen en kaarten.5 €cent per verrichting is stimulerend.Beurs verrichtingen worden correct uitgevoerd, opmerking: wel duur.verklaringen over beurstermen zaten vroeger in een les tool dus is nu onvindbaar", "Titel: Storting Pensioensparen Tekst: Zoals paar dagen geleden hier ook al werd vermeld kon ook ik mijn pensioenfonds niet beheren... zelfde wit scherm.Dit is ondertussen verholpen, maar nu krijg ik bij het storten van 1020 € steeds de melding \"Uw storting is niet bevestigd, gelieve opnieuw te proberen.\"Al 50 maal opnieuw geprobeerd... niks helpt !Email geen antwoordt en telefoon wachten, wachten, wachten zonder antwoord.", "Titel: Mooie reclame daar blijft het dan ook… Tekst: Mooie reclame daar blijft het dan ook bij... liegen dat ze bepaalde documenten niet ontvangen hebben of iets niet ondertekend is... wou klant worden maar als zo met klanten hun gegevens omgaan hoeft het niet meer.", "Titel: Je doet een aanvraag en hoort er niets… Tekst: Je doet een aanvraag en hoort er niets meer van. Je vraagt dan feedback en krijgt GEEN feedback. Je belt dan en dan zijn ze nog eens ARROGANT. Niet aansluiten bij Keytradebank. Steeds arrogante firma", "Titel: Alles is gratis bij Keytrade Tekst: Niet slecht voor een bank waar alles gratis is. In het algemeen ben ik heel tevreden. Gratis rekeningen, gratis debet- en kredietkaart. En met hun \"5 cent/verrichting\" actie krijg ik elke maand tussen 1€ en 2€ op mijn rekening kado. Sinds kort werken ze samen met Itsme. Zeer handig.Een minpuntje is dat ze nog geen instant overschrijvingen ondersteunen.", "Titel: Super, maar met ruimte voor verbetering. Tekst: Super service in vergelijking met de klassieke banken. Gemakkelijk te gebruiken app. Het lukt wel niet altijd om online iets betaald te krijgen via de smartphone. Op dat moment kan je niet anders dan de app gebruiken van een andere bank, ... en dat zou toch echt niet de bedoeling mogen zijn.", "Titel: Keytrade nog betrouwbaar? Tekst: Keytrade blijkt niet meer in staat om op een redelijke termijn te reageren op schriftelijke correspondentie. In sommige gevallen bevestigen ze zelf een wachttijd van 1 maand!! Heb hetzelfde ondervonden met Telenet. Maar dit is wel een bank! Is het nog wel veilig om daar uw centen aan toe te vertrouwen? Ik beperk in ieder geval mijn eigen risico's.", "Titel: Tevreden Tekst: Ik ben heel tevreden, alles verloopt heel vlot in een duidelijke app (en ook bij het internetbankieren). Gratis service en de 5 eurocent bonus is een leuk extraatje dat motiveert om de kaart in de winkels te gebruiken!", "Titel: De klantendienst was bij mij in ieder… Tekst: De klantendienst was bij mij in ieder geval wel vlot te bereiken, op 21 juli dan nog wel! Ik kreeg een heldere uitleg  van een competent medewerker. Hier geen klachten dus.Ondertussen 12 dagen verder nu. Klantendienst nog altijd redelijk vlot bereikbaar, in tegenstelling tot mijn rekeningen waar ik nu al 12 dagen na elkaar niet kan inloggen. Je zult deze bank maar als hoofdbank hebben 😒", "Titel: Ooit werkt het Tekst: Uiteindelijk werkt alles, maar zonder support mag je het vergeten.2 jaar geleden opstart rekening. Of het nu om de bankkaart ging, de hardkey login, de opening rekening, de visa. Elke keer loop je wel ergens op een foutmelding en werkt het systeem niet zoals men beweert dat het zou moeten werken. Elke keer heb je support nodig om iets te doen. Soms hang je 3 kwartier in de wachtrij, soms is de verbinding superslecht.We hebben nu een tweede bankrekening nodig. Support beweert dat dit via de homepage /onboarding kan.Bij de tweede rekeninghouder krijgen we een foutmelding. Support beweert dat dit niet kan.Tja... Elke keer prijs.", "Titel: Te stringente processing van product… Tekst: Te stringente processing van product aanvragen of wijzigingen. Alles gaat meestal goed. Eén afwijkende parameter en het \"past\" niet.In dit geval een document voor afsluiting Visa kaart.", "Titel: Afsluiten rekening lukt niet. Tekst: Voor de aankoop van een garage had ik mijn geld nodig. Ik haalde het af van Keytrade en vroeg, in september vorig jaar (!) om mijn rekeningen af te sluiten. Ik vulde het daarvoor bestemde formulier in en stuurde het op. Geen reactie. In  november vroeg ik nog eens om de rekeningen te sluiten, in december stuurde ik het formulier als bijlage nog eens door. Ook nog eens einde januari 2024. Ik kreeg wel, na geruime tijd, jullie excuses en beloftes ....Dat vraagt geen nadere verlaring!", "Titel: Een ongelooflijk slechte website Tekst: Een ongelooflijk slechte website. Altijd problemen met inloggen zoals:'Er ging iets fout, gaf u alle informatie correct in? Gelieve contact op te nemen met onze klantendienst als deze fout zich blijft voordoen. (code 6015)'. Als het dan lukt dan vlieg je er snel weer uit. Al met verschillende geprobeerd, allemaal hetzelfde... nog nooit problemen gehad met banken maar dit hier slaat alles...", "Titel: Wat een klucht… Tekst: Wat een klucht…De aanvraag voor een bankkaart en het installeren van de bijbehorende app voor mijn dochter geraakt niet opgelost. Sinds juli vorig jaar heb ik herhaaldelijk contact opgenomen via e-mail en telefoon om deze kwestie op te lossen, maar tot op heden is er geen vooruitgang. Geen enkele QR-code werkt, geen enkele herstelcode werkt, na kantooruren zo goed als niet bereikbaar (alhoewel op alle briefwisseling het telefoonnummer staat) enz …Ik raad deze bank ten zeerste af… ik stop er alleszins mee…", "Titel: Ondanks deze gratis is Tekst: Ondanks deze gratis is, inclusief kredietkaart is het echt een slechte bank bij momenten van urgentie/noodgevallen. Het is een volledige online bank met 1 kantoor in het Antwerpse. Maar voor bijna alle diensten ivm blokkeringen kredietkaarten / kaarten en app moet je inbellen. Want verschrikkelijk is. Via mail replyen ze weken later pas. Idd je een bankrekening zoekt die je niet actief gebruikt, bijvoorbeeld voor beleggingen, is het een oké bank. Van zodra je deze bank wil gebruiken als hoofdbank is het een ramp. Bespaar u de problemen en neem een betaalrekening bij conrurrenten.", "Titel: sinds meer dan 20 jaar ben ...ik klant… Tekst: sinds meer dan 20 jaar ben ...ik klant van Keytrade en bijna nooit heb ik enig probleem ervaren.en deed er zich een probleem voor belde ik gewoon naar Keytrade..Meestal een vriendelijke meneer stond mij dan op korte tijd te woord en loste het probleem via de lijn direct op.Daarvoor mijn hartelijke dank aan jullie team...Groetjes:Daniel uit Dendermonde.", "Titel: Extreem slechte klantenservice Tekst: Extreem trage, slechte en ongeinteresseerde klantenservice!!Het duurde vier (4!) maanden alvorens ik toegang hersteld had nadat ik m'n inloggegevens kwijt was.Deze vertragingen waren voor 100% te wijten aan Keytrade Bank.Tientallen telefoontjes en emails zonder antwoord - absoluut te vermijden zodra je ook maar iets nodig hebt van de klantendienst!!", "Titel: Antwoord op Veronique Tekst: Mijn ID was helemaal niet verlopen of vervangen, noch die van mijn partner, waarmee ik ook heb proberen aanmelden. Ik heb mijn ID  en itsme zowel voor als na mijn aanmelding bij Keytrade zonder problemen kunnen gebruiken bij andere sites.Weigering van kredietkaart terwijl we aan alle voorwaarden voldoen zonder mededeling van reden is wel heel willekeurig en á la tête du client. Een serieuze bank onwaardig.", "Titel: Payconiq werkt niet helemaal Tekst: Het zou een 5 zijn mocht je terug payconiq volledig kunnen gebruiken met een Keytrade rekening. Wanneer komt hier eindelijk een oplossing voor ?", "Titel: Zeer tevreden Tekst: De kosten verbonden aan de zichtrekening zijn over het algemeen vééel lager dan bij de grootbanken. Duidelijke tarieven. Handige app voor beleggingen. Zeer tevreden.", "Titel: plotseling blokeren van al mijn rekeningen Tekst: plotseling blokeren van al mijn rekeningen zonder boe of ba geen tel geen bericht via email of op mijn acount interne post nietsna 3 weken an email dat ik mijn adres niet had aangepast bij mijn verhuisik heb nog twee andere banken had ik ook niet gedaan maar daar absoluut geen probleem,mailtje gestuurd met de nodige doc en hub alles ok en dit zonder de rekeningen te blokerenkeytrade trachten te contacteren tot mijn verbazing permanent gesloten ik denk dat ze in slechte papieren zitten en dat ik mijn geld kwijt benwat een slechte bank GEEN AANRADER ondanks hun reklame NIET DOEN IS MIJN ADVIES", "Titel: Ervaring met Keytrade Bank. Tekst: Ik ben eigenlijk geheel toevallig bij Ketyrade Bank terecht gekomen omdat mijn vorige bank haar Belgische activiteiten stopte. Ik heb alleen maar zeer goede ervaringen met Keytrade Bank. Super.", "Titel: contact met de bank kan beter Tekst: ik heb over het algemeen enkel positieve ervaring.hetgeen volgens mij wel beter kan is het contact met de klant.Dit mag zeker via mail maar kan volgens mij wel sneller en duidelijker", "Titel: Gelukkig is het gratis, anders zou ik er niet voor kiezen Tekst: P2P betalingen tussen je vrienden via Payconiq werkt niet meer sinds verplichte overstap naar Visa debet kaarten.Betalingen die door een technische fout (of welke reden dan ook) van hun kant niet geboekt worden, waardoor je Visa debet kaarten geblokkeerd worden (ondanks genoeg saldo). Dit had ik recent voor in Frankrijk. Dus daar sta je dan met geblokkeerde kaarten, zonder dat je de klantendienst kan bereiken.Klantendienst is nauwelijks tot niet bereikbaar. Een vraag stellen, je mag van geluk spreken als je binnen EEN MAAND antwoord krijgt.Gelukkig is alles gratis, dus uiteraard kan je geen top service verwachten. Dat is dan ook meteen de enige reden waarom ik er een zichtrekening heb.Dus 1 ster omdat er alles gratis is en 1 ster omdat de intrest op je spaarrekening er hoger is dan bij de grootbanken. Maar verder is deze bank geen enkele ster waard.", "Titel: Keytrade deletes my account without giving any reason Tekst: Ik kreeg recent twee e-mails van Keytrade waarin stond dat de bank mijn account en rekeningen gaat opzeggen/blokkeren.Een reden werd niet vermeld en de (telefonische) klantendienst kon mij niet helpen. Enkel \"een specifieke dienst binnen de bank (Keytrade Bank KYC)\" wist waarom en hoe e.d. en die kon ik \"enkel via mail contacteren\".Ik heb intussen volgende reactie gekregen van KYC (via mail, want telefonisch wil men mij niet te woord staan): \"Hierbij bevestigen wij onze beslissing om de bankrelatie tussen ons te beëindigen. In overeenstemming met onze algemene voorwaarden geven wij geen redenen voor onze beslissingen om relaties te sluiten.\"", "Titel: Abominabele ondersteuning Tekst: Klantservice onbestaande (zowel telefonisch als per mail), als je een probleem hebt kan je de boom in zo blijkt. Ik wacht al 41 dagen op een reactie, zelfs na een half dozijn herinneringsberichten. En de telefoonlijn neemt er simpelweg niemand op.App is alleen van kwaad naar erger gegaan. Payconicq-integratie verdwenen en de app laat je regelmatig niet toe om aan te melden. Ik was een (redelijk) tevreden klant, maar het voorbije jaar doet me overwegen de rekening te sluiten en op een ander te gaan.", "Titel: MISERIE !!! Tekst: Nadat men mijn visakaart om een door mij ongekende reden had geblokkeerd, stond ik daar … bij het autoverhuurbedrijf in het buitenland! dit wil je écht niet meemaken, je krijgt je auto niet, je moet een nieuwe reservatie maken en daarbovenop ben je dan nog je geld kwijt op de koop toe!!! En als je dan vraagt aan de klantenservice waarom dit is gebeurd dan krijg je doodleuk het antwoord: Tjah, als er een verdachte handeling gedetecteerd wordt … !!!Hallooooo, is een auto huren in Malaga dan zó verdacht. Bel de klantenservice om je kaart te deblokkeren … 21 minuten, alstublieft!!! Oooh wat vervloek ik die bank momenteel!", "Titel: Nieuwe rekening openen lijkt onmogelijk te zijn. Tekst: Op 15/10 online een rekening geopend (als nieuwe klant).  Drie weken later hierover nog niets vernomen en gebeld naar de Klantendienst waar men mij wist te vertellen dat dit 4 weken of langer kon duren.  Op 27/11 nog steeds geen nieuws ontvangen en opnieuw gebeld naar de Klantendienst waar men mij vertelde “dat ze het gingen bekijken”. En ik die dacht dat Keytrade een serieuze(re) bank was...", "Titel: Zeer slechte ervaring Tekst: Ik ben twee jaar geleden verhuisd van België naar Italië. Alle documenten bezorgd die Keytrade mij gevraagd had. Dit had immers ook gevolg dat ik vrijgesteld werd van Belgische roerende voorheffing. Talrijke telefoons(call center Keytrade telkens: \"het komt in orde meneer\") en emails later woon ik voor Keytrade nog altijd in België en betaal ik 30% roerende voorheffing. Ik heb na 2 jaar de moed opgegeven en alles overgezet naar Belfius, waar alles wel direct in orde en correct was. Veel miserie en Keytrade heeft mij uiteindelijk meer gekost aan geld en tijd dan een traditionele bank.", "Titel: TE VERMIJDEN ! Ga naar een andere beursmakelaar ! Tekst: Vermijden ! Vermijden !Onkunde en onwil troef !Ze weten niet dat een keuzedividend bestaat van Shell aandelen en geven het dividend, ondanks expliciete vraag in cash !ONKUNDE TROEF bij Keytrade bank !GEEN ANTWOORDEN OP herhaalde mails, geen contact mogelijk via telefoon na 30 min aan de lijn te blijven wachten !", "Titel: Verjaardagsmaand Tekst: Email om vrienden uit te nodigen klant te worden in de maand van mijn verjaardag, en geld te kunnen uitdelen, én krijgen: Goeie marketing", "Titel: Tot hiertoe een zeer goede ervaring Tekst: Tot hiertoe een zeer goede ervaring ; geen enkel probleem. Nu zitten wij met een fishing probleem en hopen dat Keytrade bank daar goed werk zal verrichten!!!", "Titel: Ooit top, maar nu flop! Tekst: Al jaren klant bij deze bank. Maar problematisch bij een erfenis 2 jaren geleden. Recentelijk veranderen ze plots hun beleid (in mijn geval gaat het over het instellen van limietorders). Dat wordt nergens aangegeven, noch richtlijnen hierover. Hier verlies je ontzettend veel tijd mee (dat is nog het minste). Toegezegde commerciële gestes worden vervolgens niet uitgevoerd. En je blijft maar bellen naar hen. Nooit zo'n slechte service gehad bij een bank. Mijn besluit is gemaakt. Ik ben hier weg.", "Titel: gebruiksvriendelijk Tekst: gebruiksvriendelijk, alhoewel er soms meer vragen zijn, maar dat is te wijten aan de hogere leeftijd waarin ik me bevind.", "Titel: Zou liever 0 sterren geven althans voor… Tekst: Zou liever 0 sterren geven althans voor de laatste persoon die ik aan de lijn had. De vorige zou ook in ons service center aan de slag kunnen maar die laatste. Onvoorstelbaar hoe arrogant hij omgaat met klanten.Soit ook jammer dat mijn dochter haar kaart die ik op 13/10 aangevraagd heb nog steeds niet kan gebruikt worden en dat ik nu nog een bijkomend document moet invullen. Konden jullie dit niet in de aanvraag verwerken of 5 weken geleden opvragen?Wel fijn dat ze constructief reageren op een review ;-)", "Titel: Telefonisch zéér moeilijk bereikbaar Tekst: Telefonisch zéér moeilijk bereikbaar.  2 maal tot een half uur in wacht , zonder resultaat.  3de keer na 20 minuten wachten eindelijk iemand aan de lijn gekregen.  Het ging om een verplichte procedure om een herstelcode voor Softkey te verkrijgen. Er is dus géén alternatief.  Bizar en onaanvaardbaar.", "Titel: Topbank! Gewoon doen Tekst: Topbank! Je bent soms een beetje op jezelf aangewezen, maar je weet ten minste dat je niet betaalt voor allerlei diensten en managers die je toch niet gebruikt (of je toch niet echt vooruithelpen). Heel tevreden van de app en de website. Cheerz", "Titel: Dit is niet ernstig meer Tekst: Dit is niet ernstig meer : op 4 december '23 gaf ik Keytradebank opdracht mijn (weliswaar bescheiden) effectenportefeuille te liquideren. We zijn nu meer dan een maand verder en er beweegt niets.Ook eerdere ervaring met Keytrade zijn ronduit negatief : onbereikbaar, geen of zinloze reactie van een 'bot' op mails en bellen geeft alleen wachtmuziek. Toen ik een voorgaande ervaring neerpende in Trustpilot kwam er die standaard verontschuldiging van zgz. 'Veronique' (waarschijnlijk een bot) maar het resultaat is... niks !", "Titel: Gratis en eenvoudig Tekst: Gratis en eenvoudig Geen probleem", "Titel: Was vroeger ok. Nu alleen maar problemen met betaalkaarten. Tekst: Vroeger nooit problemen. Sinds enkele maanden al in verschillende winkels gestaan dat betalingen niet lukken of kaarten om onbekende redenen geblokkeerd raken. Bellen naar klantendienst is ook al een ramp. Men is niet onbeleefd maar een oplossing krijg je niet. Momenteel in het buitenland met geblokkeerde visa om duistere redenen. Allee men heeft het zogezegd gedeblokkeerd maar vooraleer ze terug werkt moet ik een afhaling doen in België. Daar ben ik veel mee in de Dominicaanse republiek. Maw ik ga veranderen van bank en ik raad niemand deze bank nog aan. Wat een verschil met vroeger.", "Titel: slechte klantendienst Tekst: Klantendienst telefonisch nauwelijks bereikbaar. Als je mailt ontvang je een automatisch bericht dat het tot 4 weken kan duren eer je een antwoord krijgt.  Is dit toelaatbaar ?? Bij mij werd een betaling in het kader van een domiciliëringsopdracht blijkbaar geweigerd. De bank laat het zelf niet weten, ik moet het horen van de begunstigde.  Klacht zowel telefonisch als per mail gemeld op 19.10. Betaling nog steeds niet uitgevoerd. Correspondent aan telefoon kon niet zeggen waarom betaling geweigerd werd.  Meer nog : hij kon zelfs de weigering niet opheffen.  Ik wacht nog steeds op antwoord/rechtzetting. Begunstigde nog steeds niet betaald....", "Titel: Géén verbinding mogelijk ??? Tekst: Ik kreeg sinds gisteren avond en nu nog steeds totaal geen verbinding meer naar mijn rekening niet met mijn app maar ook niet on line krijg ik met Keytrade verbinding ???Ook klantendienst telefoon is rampzalig want blijkbaar nemen die tussen de middag niet op  ! Uiteindelijk werd het toch opgelost via de klanten dienst en moest ik mijn iPad totaal herprogrammeren en de app verwijderen herplaatsen en terug een profiel aanmaken Eind goed alles goed", "Titel: Payconiq deels ondersteund en dienstverlening is treurig Tekst: Payconiq slechts deels ondersteund--> ik kan vrienden/kennissen/onbekenden niet betalen door hun QR-code te scannen. Dit wordt telkens geweigerd. Als online bank zou ik verwachten dat zij deze methodes juist wel ondersteunen. Hun oplossing? Doe het handmatig via 'contactpersonen'. Dat is geen 'oplossing' maar wel het omzeilen van het probleem. Ik heb niet het GSM-nummer van elke persoon die ik - al dan niet sporadisch - tegenkom!Daarnaast werd mijn aanvraag voor een credit card meermaals geweigerd.Bij die aanvragen staat telkens duidelijk vermeld dat je op de hoogte wordt gehouden van de beslissing via e-mail, maar dat is niet waar. Je moet het zelf opvolgen via het Keytrade portaal, een e-mail ontvang je niet. Een duidelijke reden waarom de aanvraag geweigerd wordt, krijg je ook niet.Nadat ik gebruik maakte van de bankoverstapdienst om terug te keren naar KBC (na jarenlang Keytrade klant geweest te zijn), gaf KBC zonder enig probleem een credit card met die limiet. Bedankt Keytrade dat jullie je cliënteel zo weinig vertrouwen.Update 30/01/2024: Een zeer algemeen en nietszeggend antwoord van Keytrade. Maak het de kat wijs.", "Titel: Het is niet meer wat het was Tekst: Al vele jaren klant. Heel lang tevreden als internetbank. Maar bijzonder teleurgesteld na geval van visa-kaart fraude waar, op een uitzondering na van een medewerker van de klantendienst, elke vorm van degelijke communicatie over oorzaak, gevolg, stand van zaken en oplossing afwezig is. Ik ben ervan overtuigd dat er wel een oplossing zal komen, helaas na vele weken. Duidelijke communicatie zou een hoop onduidelijkheid en frustratie kunnen verminderen. Klanten snel binnenhalen is een ding, ze een goede service bieden, dat is een andere uitdaging geworden voor deze bank.", "Titel: Slechtste klantendienst Tekst: Ik was bij Moneyou overgenomen door Keytrade bankAlle documneten werden hiervoor aan Keytrade bezorgt.Kreeg email (niet via het Keytrade inlog platform) met vraag naar mijn belastingsaangifte e.d. na overschrijving van Izola banking naar de Keytrade rekening.Op vraag of deze email van Keytrade kwam (via het inlog platform) enkel een bevestiging gekregen van het ontvangst van de email maar nooit een bevestiging dat de vraag van hun was.Ik heb dus de vraag niet beantwoord.Na enkele maanden werd mijn rekening zonder boe of ba afgesloten.Ik heb reeds klacht ingediend via de financiële ombudsdienst maar vrees dat dit niet zal helpen.Vermijd Keytrade.", "Titel: Kostenvrije bankrekening. Tekst: Kostenvrije bankrekening.Gratis \"Bank\" kaart.Gratis \"Visa\" kaart onder voorwaarde.5 cent per verrichting.Betere intrest dan bij grootbanken.", "Titel: GEWOON WEGBLIJVEN ! Tekst: GEWOON WEGBLIJVEN !Alles duurt een eeuwigheid : een rekening openen. bellen naar de klantendienst. antwoorden op emails.De waslijst van de technische problemen die ik al ervaren heb wil ik iedereen besparen. Payconiq werkt niet bij Keytrade. als je jezelf een boel frustraties wil besparen, ga naar een andere bank !", "Titel: Zeer slechte klantendienst Tekst: Zeer slechte klantendienst. Het duurde enorm lang om mijn rekening te activeren. Bij het aanvragen van een debetkaart liep er vanalles mis, 2 maand later pas ontvangen. Bij het aanvragen van een kredietkaart was het helemaal verkeerd. De nodige documenten werden geupload en 4 weken later krijg ik een mail dat alles geblokkeerd is. Kan hierdoor geen verichtigen doen en kan niet meer aan mijn spaarcenten. Teleurgesteld alles dan maar opgezegd bij Keytrade en alles laten overzetten naarmijn klassieke bank. Zoals gevraagd formulier ingevuld met de nodige stavingen maar ik wacht nu al 4 weken en er is nog helemaal niets gebeurd.", "Titel: Keytrade werkt nog echt zoals het moet… Tekst: Keytrade werkt nog echt zoals het moet ...Voor de mensen dus. Handig, makkelijk toegankelijk online, en met een belonings systeem, voor verrichtingen.", "Titel: Niet binnen te geraken in callcenter… Tekst: Uitsluitend telefonische ondersteuning bieden is helemaal oké voor mij. Echter, je geraakt gewoon helemaal niet binnen in het callcenter. In totaal al 2 uur geprobeerd zonder succes. Moest er een call-me-back functie aangeboden worden zou dit de situatie wel verbeteren. Doe aub een kleine investering in jullie callcenter. Dit is ondermaats en Keytade gaat hierdoor klanten verliezen.", "Titel: Snelle en degelijke service Tekst: Snelle en degelijke service. Documenten vind je vrij eenvoudig terug. Alles werkt vrij intuïtief. Een ideale bank om eenvoudig zelf te beleggen.", "Titel: Een slechte helpdesk Tekst: Ik ben sinds + 20 jr klant bij Keytrade bank, maar de laatste jaren is de klantendienst gewoon slecht!Op 14 nov stuur ik een email dat ik geen internetaankoop kan doen via Keytrade, en ik krijg als antwoord dat wegens overdrukte ik 14 werkdagen moet wachten op antwoord. Na die vervaltijd stuur ik op 6 dec een nieuwe herinnering en krijg als antwoord dat ik 5 werkdagen moet wachten.Op 14 december krijg ik als antwoord op mijn nieuwe herinnering dat ik 5 werkdagen moet wachten.Op 21 december krijg ik een antwoord waarbij men mij verwijst bij \"inlogproblemen\" naar de FAQ, terwijl ik nooit inlogproblemen heb ! Wie werkt daar eigenlijk in die helpdesk?", "Titel: Bij sommige banken/brokers geef je…Keytrade forever? Tekst: Bij sommige banken/brokers geef je liever geen ster dan 1 ster...dit is voor Keytrade Bank het geval.Klant sinds 2007.Sinds de overname door Crédit Mutuel Arkéa in 2016 is dit geëvolueerd van beste broker naar probleembroker.Zelf werk ik met een marginaccount.Wat loopt er nu allemaal verkeerd?A:Sinds meer dan een jaar kan je geen interne overschrijvingen uitvoeren van de ene interne rekening naar de andere...laat staan overschrijvingen naar een andere externe rekening.B:aan-verkoop valuta USD/Euro/USD is ook al onmogelijk sinds meer dan een jaar.C:hun uitleg ...onze ICT zoekt naar een oplossing maar vinden ze niet...gevolg ze hebben beslist om deze dienst(kredieten via margins) te annuleren...wegens gebrek aan klanten.Leuk ...ze maken nu reclame met woonleningen...dus als er niet genoeg klanten meer zijn stoppen ze deze dienst ook waarschijnlijk...moet je dan je huis verkopen?D:hun prijsbepalingen (GAK) bepalen ze via APP...waar aan-/verkoopkosten niet berekend zijn...laat staan de juiste berekeningswaarde.E:als je overschrijvingen wilt laten uitvoeren moet je een bericht sturen naar Credit Keytrade omdat ze toestemming moeten geven...na een week zijn deze nog niet uitgevoerd.F:telefonisch contact: een ramp...ooit meegemaakt dat je meer dan dertig minuten moet wachten.", "Titel: We zijn gepensioneerden en 60 +… Tekst: We zijn gepensioneerden en 60 + waardoor we niet digitaal top zijn. De zaken eenvoudig houden is de boodschap. Soms verschijnen er vaste meldingen bij een aandeel ( vb LSP ) en dan klik je erop en krijg je een leeg venster. LET OP : Onze computer MC Book is UP TO DATE ! Dan zit je daar en zou je moeten telefoneren om uitleg. Dat is niet zo evident. Dan bellen we maar niet en hopen we dat het eens aangepakt zal worden zonder dat we klagen.", "Titel: Onbestaande \"online\" service. Tekst: Sinds 2021 klant omwille van voordeligste lening. Toen beslist om al onze bankzaken ook bij Keytrade te doen. Ze profileren zich als online bank zonder fysieke kantoren maar hun online service is alles behalve snel, vlot en vriendelijk. Voor de aanvraag van een nieuwe zichtrekening zit ik nu al 5 maanden te mailen en te bellen. Ik moest zelf een handgeschreven document bezorgen met de reden voor aanvraag. En dat voor een online bank?? De rekening en kaarten zijn nog altijd niet in orde. Nu blijkt ook dat hun nieuwe betaalkaarten Payconiq niet meer ondersteunen. Ze lijken er ook niet snel een oplossing voor te bieden. Onbegrijpelijk slechte \"online\"  service. Overgeschakeld naar Argenta.", "Titel: Betreft: trage en onvolledige levering van inloggegevens Tekst: Onlangs heb ik online een rekening bij uw bank geopend. Na ontvangst van een bevestigingsmail ging ik ervan uit dat alles in orde was. Er werd aangegeven dat ik een brief zou ontvangen met de inloggegevens en een QR-code. Na drie weken wachten was er echter nog steeds niets in mijn brievenbus aangekomen.Hierop heb ik contact opgenomen met uw klantenservice. Zij boden een oplossing aan en stuurden een nieuwe brief. Deze brief arriveerde na een lange week eindelijk, maar tot mijn grote teleurstelling bevatte deze geen herstelcode, waardoor ik niet kon inloggen in de app.Ik ben zeer ontevreden over deze gang van zaken. Het proces heeft veel te lang geduurd en de communicatie was gebrekkig. Daarnaast is het feit dat de tweede brief opnieuw onvolledig was, zeer frustrerend. Deze situatie heeft mij onnodig veel tijd en moeite gekost en heeft mijn vertrouwen in uw dienstverlening geschaad.Ik verzoek u dringend om deze kwestie zo spoedig mogelijk op te lossen. Graag ontvang ik per direct de benodigde herstelcode zodat ik eindelijk toegang kan krijgen tot mijn account. Tevens verwacht ik een verklaring en een passende compensatie voor de geleden ongemakken.Ik zie uw reactie met interesse tegemoet.", "Titel: Zeer tevreden als bank Tekst: Zeer tevreden over de bankverrichtingen/ bank gedeelte.Enige minpunt zijn de iets hogere kosten bij beursverrichtingen.Anders heel goede app, tarieven, keuze betaalkaarten.", "Titel: Problemen met bankkaart Tekst: Problemen met bankkaart en nog een aantal dingen. Klacht moeten indienen bij ombudsfin. Weinig of geen respons van Keytrade. Zeer slechte service", "Titel: Nutteloze bankrekening en app Tekst: In september 2023 veranderde ik van iPhone 11 naar de iPhone 15. Sindsdien werkt de app niet meer. Een poosje nadien begon de bankkaart kuren te krijgen en weigerde systematisch te functioneren. Als ik dan de bank hierover belde, kreeg ik als antwoord: « Ze staat nog open » (???). In oktober had ik de bankkaart weggelegd, omdat ik wegens dringende zaken naar de kliniek moest. Bij mijn terugkomst thuis was ze verdwenen en heb ik haar laten blokkeren bij Cardstop. Ik heb dit gemeld bij de bank. De bankbediende, verantwoordelijk voor het hernieuwen van de bankkaarten vroeg mij naar de drie laatste verrichtingen op mijn bankrekening ??? En gisteren stuurden ze reklame over de nieuwe debetkaart, wat mij letterlijk deed ontploffen. Nu heb ik een klacht ingediend… Ik heb inmiddels met de bemiddelaar die de klachten behandelt, gesproken. Mijn besluit de Keytrade bank te verlaten, stond reeds vast, aangezien het om een vrij groot geldbedrag ging. Zes maand is doodgewoon te lang om iemand aan het lijntje te houden.", "Titel: Te veel minpunten Tekst: Voor dagelijks gebruik met de kaart: top. Maar daar stopt het helaas ook.Sinds kort kan je de debitkaart niet meer in Payconiq gebruiken voor particuliere betalingen. Je kan dus geen geld meer sturen naar of geld ontvangen van je vrienden met je Keytrade kaart in Payconiq. Dit was met de vorige debitkaart wel gewoon mogelijk. Onbegrijpelijk nu dit niet meer weg te denken is bij een groot publiek.Ook in het buitenland zijn de kaarten niet betrouwbaar. Onlangs in Frankrijk werden verschillende betaligen geweigerd met de kaart, zowel de debit- als de kredietkaart. Dit gebeurde aan verschillende kassa's, maar ook bvb. aan verschillende péagestations. Zeer vervelend dus. Je moet dus steeds zorgen dat je een kaart bij de hand hebt van een andere bank. Die werkte trouwens wel overal waar de Ketrade kaart niet werkte, waardoor het duidelijk was dat het probleem enkel bij Keytrade kaarten voorkwam.Wil je dus meer dan enkel kaartbetalingen binnen België, raad ik Keytrade niet aan. Zeer jammer, want voor de rest wel tevreden van hun formules en online platform bvb.", "Titel: Geld van uw rekeningen overschrijven… Tekst: Geld van uw rekeningen overschrijven naar andere bank duurt meestal vrij lang tegen dat die uitgevoerd zijn.", "Titel: Rekening afsluiten is probleem! Tekst: Sinds eind september 23 hebben we de  procedure gevolgd van Keytrade om onze rekening af te sluiten. Vandaag 27 november nog steeds niet uitgevoerd na meerdere keren contact per mail en ook telefonisch. Ook gaan er kleine bedragen van de zichtrekening (die op 0 stond), waar wij geen vat op hebben en geen toelating voor gaven. Keytrade is niet beschaamd om dan een mail te sturen dat het saldo negatief is, terwijl ze er zelf aanzitten en nog steeds niet het nodige deden om deze af te sluiten, zoals al 2 maand geleden aangevraagd. Zelf kan je blijkbaar niets doen om de afsluiting effectief te doen, je bent volledig afhankelijk van Keytrade, die naar mijn mening de klant oplicht op deze manier.", "Titel: Ik kan mijn pensioenfonds niet beheren Tekst: Ik kan mijn pensioenfonds niet beheren, na het drukken op de knop beheren krijg ik een wit scherm te zien. Ik probeerde een andere browser maar ook dit geeft geen oplossing. Ik nam telefonisch contact op en bleef ongeveer een half uur aan de lijn ik werd in die tijd drie keer in wacht gezet. Er werd me gezegd dat er een ticket wordt aangemaakt en dat het probleem verholpen zal worden, dit is nog steeds niet het geval.", "Titel: onbereikbaar, bieden geen snelle oplossing Tekst: Net als bij Eliane... De aanvraag voor een bankkaart en het installeren van de bijbehorende app voor mijn dochter raakt niet opgelost. Al maanden probeer ik herhaaldelijk contact op te nemen via e-mail om dit op te lossen, maar tot op heden niets... Ik raad de bank af.", "Titel: Keytrade is verdubbeld in… Tekst: Keytrade is verdubbeld in transactiekosten. Bij Bolero de helft voor zelfde aankoop en aantal. Ik ga hier weg Karl", "Titel: Beste online bank van België Tekst: Zeer goede ervaring. Eenvoudige ap die doet wat het moet doen. Bijna alles is gratis en ik krijg 5 cent per verrichting op mijn zichtrekening!", "Titel: Gewoon een goede en eerlijke bank Tekst: Gewoon een goede en eerlijke bank: alle verrichtingen goed vermeld, correcte informatie over de toestand van beleggingen, eerlijke prijzen en rentes,... kortom gewoon zoals een bank moet zijn.", "Titel: Slechte dienstverlening Tekst: Slechte dienstverlening! Ik wil mijn keyplan stopzetten. Ik heb al midden augustus mijn aanvraag daarvoor ingediend. We zijn nu een maand verder en er is nog steeds niets gebeurd. Ze zijn moeilijk bereikbaar (30 min wachten bij het bellen naar de helpdesk, een week wachten op reactie via mail). Als je iets zegt dat klinkt als een klacht krijg je erg defensieve reacties en zijn ze niet klantvriendelijk. Teleurgesteld over deze bank. Hopelijk zie ik ooit nog het geld van de verkoop van mijn fondsen op mijn beursrekening verschijnen!Ondertussen opgelost", "Titel: Zeer slechte service!! Tekst: Zeer slechte service!!! Al 2 maanden aan het wachten tot EIN-DE-LIJK mijn rekeningen overgezet zijn. Soft key installeren was een ramp, hard key werkt nog steeds niet en nu blijkt payconiq ook niet te werken.Ik verander NU meteen terug naar een andere bank. Die zal misschien duurder zijn, maar wél werken!!!", "Titel: Online Beleggingen Tekst: Werk met Keytrade voor beleggingen. Wisselde 14 dagen geleden van GSM en sindsdien wachtende op een brief (!!!) met nieuwe user gegevens. Telefonisch niet bereikbaar en op mails geen reactie😞. Ongelooflijk voor een online platform.", "Titel: Ik hebop 3 augustus de transfer Tekst: Ik hebop 3 augustus de transfervan onze aandelen van Keytrade bank BE naar Lynx aangevraagd.aandelen van vodafone werden nog steeds niet overgedragen,desondanks talrijke aanmaningen, zowel via mail als via telefoon van onszelf, en ook aanmaningen van Lynx.Telefonische klantendienst méér dan 1 uur wachttijd.  Op mails wordt niet gereageerd.De redelijke termijn van overdracht werd ruimschoots overschreden.NOOIT werd me een reden medegedeeld waarom de aandelen van vodafone niet meegetransfereerd werden.Ik heb zo het vermoeden dat onze aandelen misbruikt worden door de bank om short te gaan,en dit zonder onze toestemming.Ik zie geen andere reden waarom deze aandelen nog niet werden overgedragen,en waarom geen reden wordt gegeven om deze overdracht niet te laten plaatsvinden.Bank met héél slechte dienstverlening.  Totaal niet aan te raden, én zelfs helemaal niet meer zo goedkoop.  Vragen 0,5% per geldwissel in andere munt.", "Titel: Onprofessioneel en niet transparant Tekst: Onprofessioneel en niet transparant. Er wordt reclame gemaakt met Visa kaarten. Na storten van een bedrag dat hoger is dan de limiet van de kaart (voorwaarde is 1000 euro) en een inkomen dat meer dan voldoende is om terug te betalen wordt kredietkaart gewoon geweigerd. Men wil ook niet zeggen waarom, als ik aanbied meer inzicht te geven in onze financiële toestand, wordt daar niet op ingegaan, er wordt dus niet op basis van financiële mogelijkheden beslist, dat is duidelijk. Valselijk reclame maken om klanten te lokken en die dan met onduidelijke communicatie met een kluitje in het riet sturen. Ik had wat eerder ervaringen moeten opzoeken, want ik ben duidelijk niet de enige met deze ervaring. Sommige mensen worden al maanden aan het lijntje gehouden met hun \"gratis\" producten.", "Titel: Onbereikbare klantendienst Tekst: Mijn Visa is onbruikbaar - probeer vruchteloos telefonisch bank te contacteren. Dan maar mails versturen, totaal geen reactie. Het totaal van mijn wachttijd telefonische oproepen 86 minuten en geen resultaat. Wie verspeelt hier zijn tijd? Onbegrijpelijk!", "Titel: Aandelen en etfs aankopen Tekst: Aandelen en etfs aankopen op andere dan de Brusselse beurs, is veel te duur, zeker voor kleinere bedragen", "Titel: algemene ervaring Tekst: alles wordt correct en in een meer dan redelijke tijd uitgevoerd of opgelost; alleen heb ik recent geen hulp of informatie nodig gehad.", "Titel: Keytrade goede bank, maar.... Tekst: Keytrade is een goede bank met een goed digitaal platform. Het is een goede bank als tweede bank en niet als hoofdbank. Reden: de klantenservice bij problemen is enorm. Mijn rekeningen zijn geblokkeerd en ik zit al een maand te proberen om dit eraf te krijgen bij de klantendienst. Ik word constant van de ene naar de andere partij verwezen intern in de bank. Ondanks de goede bank is deze service ontoelaatbaar.", "Titel: Zolang je geen klantendienst nodig hebt… Tekst: Zolang je geen klantendienst nodig hebt is het meer dan OK maar wat een ramp als je er wel één nodig hebt. Onbereikbaar, incompetent, onbeleefd. Dit geeft een heel wrang gevoel. Ik heb daar behoorlijk wat geld staan maar niets lijkt te helpen. Zelf als je een officiële klacht indient bij hun klachtendienst antwoorden ze dat ze een termijn nemen van 4 weken om je te antwoorden.Ook bij de gewone mails gebruiken ze die termijn maar je krijgt nooit een deftig antwoord.", "Titel: Nieuwe debetkaart Tekst: Ik ontving een nieuwe debetkaart met de nodige richtlijnen om die in gebruik te nemen", "Titel: Onbereikbare support Tekst: Sinds de overname zijn ze amper nog bereikbaar. Kosten zijn gestegen, apple Pay werkt niet, Payconic is problematisch. Helpdesk bellen is gewoon een drama, en op mails wordt pas gereageerd na een week.", "Titel: Ik kan alleen maar bevestigen wat ik… Tekst: Ik kan alleen maar bevestigen wat ik hier al eerder lees.  Klantendienst niet te bereiken.  Half uur aan wachtbandje gehangen en dan maar uit pure frustratie ingelegd.  Dan maar mailtje ... met standaard antwoord: feedback kan tot 1 maand (!!!) duren.   Wat ik nog deed bij Keytrade bank was sowieso al niet veel meer.  Ik ga alles weghalen nu.", "Titel: Ramp, ultra lange wachttijd Tekst: Ramp. Iedere keer een ultra lange wachttijd om iemand te spreken te krijgen .. die mij dan niet kon helpen. De Belgische administraties zijn 10 keer beter! Nee, Keytrade heeft voor mij afgedaan.", "Titel: Al 15 jaar klant Tekst: Zeer tevreden gemakkelijk om informatie te krijgen zonder lang te moeten wachten  aan de telefoon.", "Titel: Pensioensparen kan niet ingetekend worden Tekst: Pensioensparen kan niet ingetekend worden: je krijgt steeds de melding ¨Uw storting kan niet bevestigd worden, gelieve opnieuw te proberen¨  en er is voldoende provisie. Gemeld op 4 januari 2024. Vandaag opnieuw ettelijke malen geprobeerd. Idem probleem. Klantendienst gebeld: ¨U wordt zo spoedig mogelijk geholpen¨ betekent in praktijk na 1 uur wachten doorgeschakeld en daarna opnieuw een half uur wachten. Ze proberen u af te schepen door een reeks problemen op te sommen, die in feite pure interne keuken van Keytrade bank zijn waar een klant niets aan kan doen. Op mijn vraag wanneer dit in orde gaat zijn (we zijn al halverwege januari) kunnen ze dat in de verste verte niet meedelen. Ongelofelijk slechte service. Ware het niet dat het pensioenspaarfonds vanwege het stopzetten van de activiteiten van Rabobank bij Keytrade bank terecht gekomen is en een overzetting naar een andere bank ongetwijfeld weer hoge kosten met zich meebrengt, we zouden nooit voor Keytrade bank kiezen. Elk jaar hebben we hetzelfde probleem met het pensioensparen hier.", "Titel: Spookbank?… Tekst: Doe aanvraag voor nieuwe toegangsrechten. Na een week nog geen reactie. Probeer tot vervelens toe te bellen. Antwoordantwoordapparaat, keuzemenu en dan eindeloos wachten om uiteindelijk zonder communicatie achter te blijven. Hoe het verder moet?", "Titel: KEYTRADEBANK vermijden. Tekst: Reeds jaren klant, maar nu probleem met softkey. Kan niet meer inloggen. Telefoon krijgt je NOOIT iemand aan de lijn. Via mail idem. Al enkele weken hopeloos geprobeerd. Service onbestaand. Wordt hier GEEN klant. Ga naar Bolero, Saxo of Lynx. Bij probleem kan je nooit meer aan je geld of effecten. Dit is een regelrechte schande ! Hopeloos !", "Titel: Jarenlang was ik een tevreden klant bij… Tekst: Jarenlang was ik een tevreden klant bij jullie. Sinds kort trekt jullie service echter of zeer weinig. Het duurt uren om de app te gebuiken, laat staan de computer. Jullie zijn haast niet bereikbaar en als we jullie kunnen bereiken krijgen we als boodschap: Los het zel o, jullie staan zelf in voor jullie rekeningen, ... Ik zou zeer graag al mijn producten bij jullie stopzetten. Ik hoop dat ik hier geen jaar op moet wachten!", "Titel: Geen maandelijkse kosten verbonden Tekst: Geen maandelijkse kosten verbonden voor beheer, zelfs een klein voordeel per verrichting.", "Titel: Ik heb verschillende keren geprobeerd… Tekst: Ik heb verschillende keren geprobeerd een extra rekening te openen. Reactie kwam er niet...", "Titel: enorme slechte klantendienst zowel… Tekst: enorme slechte klantendienst zowel telefonisch (zo goed als onbereikbaar, heb na 45 min ingelegd) als via email, zeer lang wachten op een reactie", "Titel: Goede app Tekst: Goede app, soms wel lang wachten voor klantenservice maar wel steeds vriendelijk.", "Titel: Vlotte werking Tekst: Vlotte werking; mooie rente; goed overzicht bij de diverse deelrubrieken.", "Titel: Waardeloze bank!!! Tekst: Waardeloze bank. Bij problemen is de telefonische helpdesk onbereikbaar. Wij hebben meerdere uren moeten proberen om uiteindelijk niemand aan de lijn te krijgen. Verder werkt de Payconiq functie niet meer sedert de nieuwe debetkaarten werden uitgegeven. Ook voor minderjarige kinderen is een bankrekening oninteressant. Er kunnen namelijk geen overschrijvingen gemaakt worden zonder de tussenkomst van een meerderjarige. Ik raad deze bank volledig af en ga al mijn rekeningen afsluiten en veranderen naar een andere bank.", "Titel: Wacht nog steeds op softkey Tekst: Enkele weken klant geworden. Wacht nog steeds op softkey om account te kunnen activeren maar tussentijds wel al kaart ontvangen.", "Titel: vermiste nieuwe debet kaart Tekst: Sinds 11 oktober, debet kaart gecancelled, zogezegd vervangen door een nieuwe.Heb hen uiteindelijk gemaild en ik doe echt mn nbest om geen contact met hen te moeten zoeken want ze zijn zo onvoorstelbaar arrogant en traag.Wacht al 8 dagen op antwoord over waar die zogezegde nieuwe debet kaart is.Ze hebben mijn huidige kaart gecancelled en een vervanging is in geen velden of wegen te bekennen.Heel handig.En dit soort onzin is het geval bij ELKE nieuwe kaart.Dit is geen bank, dit is een slechte grap.Ze zijn te druk bezig volgens hen. Men moet maar wat geduld oefenen. DAT is het enige antwoord dat ik krijg van hen als je hen een mail stuurt.Na 20 jaar ga ik maar van bank veranderen, dit is niet ernstig meer.", "Titel: Kredietkaart werkt al meer dan 2 weken niet meer Tekst: Sedert meer dan 2 weken is er een \"technisch probleem\" met mijn Visa kaart bij Keytrade Bank.Men werkt eraan, zo luid het. Intussen kan ik geen betalingen doen met deze kaart.Iemand hetzelfde probleem?", "Titel: Geld ontvangen met QR code met Payconiq… Tekst: Geld ontvangen met QR code met Payconiq gaan niet meer sinds de nieuwe “Visa Debet” kaart.", "Titel: Onbereikbaar Tekst: vreselijke bank. Onmogelijk iemand aan de lijn te krijgen, zelfs na ontelbare pogingen op alle mogelijke dagen en uren. Ook geen reactie op emails.", "Titel: Blijf aub weg van deze bank Tekst: Blijf aub weg van deze bank.   Ondermaatse service.  Een helpdesk de naam onwaardig.  Ik ben/was al meer dan 20 jaar klant, maar ik transfereer deze week alles naar een deftige bank en schrap mijn rekening.", "Titel: Het gemak van een online bank Tekst: Het gemak van een online bank. Eenvoudig kredietkaart bestellen in enkele clicks.", "Titel: Leuk dat je geld terugkrijgt bij het… Tekst: Leuk dat je geld terugkrijgt bij het gebruik van je bankkaart. Zeer overzichtelijk qua sparen, lenen,... En zijn steeds een stap voor op de hele grote banken.", "Titel: Heb toch op de website moeten zoeken… Tekst: Heb toch op de website moeten zoeken hoe je de nieuwe staatsbon op 1 jaar kon kopen. Niet echt klantvriendelijk.", "Titel: Valse reklame Tekst: Gratis bank en kredietkaart?(basis)Kredietkaart geweigerd terwijl al jaren Gold bij andere bank...Valse reklame.", "Titel: Koersen komen sterk vertraagd binnen Tekst: Koersen komen sterk vertraagd binnen, terwijl transactiekosten ook wel vrij hoog liggen.", "Titel: Heb een rekening geopend bij Keytrade… Tekst: Heb een rekening geopend bij Keytrade en zou daarvoor 50 euro krijgen gestort. Twee jaar later heb ik dit nog steeds niet gekregen. Het zelfde hoor ik nu van mijn schoonouders. Dit is niet netjes van Keytrade dus laat je niet foppen.", "Titel: Vlot en goedkoop Tekst: Online bankieren verloopt vlot en met de nieuwe kaart kan je nu ook online betalen", "Titel: Wil een rekening openen maar geraak… Tekst: Wil een rekening openen maar geraak niet verder dan de laatste pagina. Ik zou iets niet ingevuld hebben, terwijl dit wel is. Heb het opgegeven...", "Titel: Plaatsen orders gaat vlot. Tekst: Plaatsen orders gaat vlot.Overzichtelijk dashboard.Te weinig keuze bij obligaties.", "Titel: Vreselijk! Tekst: Vreselijk! Het is onmogelijk om uw geld op te nemen zonder juridische hulp. Ik raad ten zeerste aan om dit bedrijf te vermijden! Probeer met het profiel over dit bedrijf te praten.", "Titel: een goede bank? Tekst: een goede bank?? volgens mij waar je niet voortdurend reclame krijgt om fondsen te kopen", "Titel: Teleurstellende ervaring met gebrekkige service en vertraagde transacties bij  Keytrade Tekst: Na een teleurstellende ervaring met deze zogenaamde « bank » voel ik me genoodzaakt mijn ervaring te delen. Ik heb recentelijk geprobeerd mijn aandelen te verkopen, maar de service was ronduit verschrikkelijk. Na weken van wachten en meerdere keren contact opnemen met de klantenservice, ben ik nog steeds niet in staat geweest om mijn geld te ontvangen.Elke keer als ik contact opnam met de klantenservice kreeg ik tegenstrijdige informatie en beloftes die niet werden nagekomen. Het gebrek aan communicatie en de onwil om mijn probleem serieus te nemen, heeft geleid tot aanzienlijk financieel verlies en frustratie aan mijn kant.Ik ben diep teleurgesteld in de incompetentie van deze bank en hun onvermogen om klanttevredenheid te waarborgen. Ik raad ten zeerste af om zaken te doen met Keytrade, tenzij u bereid bent om te worstelen met vertragingen, verwarring en gebrek aan service.Het is duidelijk dat deze bank niet de beloften nakomt die ze maken in hun marketingmateriaal en ik zal mijn financiële zaken elders afhandelen in de toekomst.", "Titel: Vermijden Tekst: Vermijden. Deze bank doet zijn best om reviews te verwijderen dan op zichzelf te werken om te verbeteren.  Mijn advies, vermijden.  Het is echt niet de best keuze", "Titel: Iedere maand wordt een bepaald bedrag… Tekst: Iedere maand wordt een bepaald bedrag door de bank belegd in aandelen. Ik ben zeer tevreden.", "Titel: Een goede service en ook de intrest op… Tekst: Een goede service en ook de intrest op de spaarrekeningen zijn beter dan bij andere banken.", "Titel: Ik heb geen problemen Tekst: Ik heb geen problemen. Winkelen met de kaart en nog een beetje verdienen is top. Ik moet het van de kleine dingen hebben", "Titel: Poging tot telefonisch contact wegens… Tekst: Poging tot telefonisch contact wegens probleem met debetkaart. Na 15min vruchteloos wachten geef ik het maar op...", "Titel: Slechte administratie Tekst: Slechte administratie, rekening wordt ongemotiveerd geblokkeerd, mails worden niet of traag beantwoord, klantenservice niet adequaat.N.B. Zelfs de reactie van Keytrade op bovenstaande review was een nietszeggend, niet concreet standaardzinnetje.", "Titel: Ik heb na enkele weken nog altijd niks… Tekst: Ik heb na enkele weken nog altijd niks gehoord van een wijziging adres en toegang tot rekening", "Titel: Profileren zich vooral met aandelen… Tekst: Profileren zich vooral met aandelen platform ben hier al jaren klant maar ondertussen is dit het meest verouderde,traagste en duur platform om op te traden klantendienst krijgt trouwens *-10", "Titel: waarom wordt er geen keuze meer gemaakt… Tekst: waarom wordt er geen keuze meer gemaakt tussen het nederlands en het frans bij de opname van de telefoon, dit kan voor mij een breekpunt zijn om bij keytrade te blijven, ik wil vanaf het begin in het nederlands te woord gestaan worden", "Titel: Achterdochtig over betalingen Tekst: Uit het niks krijg ik een vraag om een betaling te verantwoorden met documentatie en dergelijke. Doe ik niet met mijn geld wat ik wil?Mij zijn ze alvast kwijt als klant!", "Titel: Ooit werd ik verplicht om over te… Tekst: Ooit werd ik verplicht om over te schakelen van Rabobank naar een andere bank... omdat ze ermee gingen stoppen hier in België. Ik heb deze bank gekozen om wat geld te laten opbrengen. Na bijna twee jaar klant te zijn heb ik totaal niets van opbrengsten gezien, niettegenstaande dat ik toch wel wat geld heb belegd via hun eigen fondsen heeft het voor mij totaal niets opgebracht... in tegendeel, niets anders dan verlies. Dat was toch niet het geval bij Rabobank in der tijd...  Nu kan je zeggen, je weet dat op voorhand, ja natuurlijk weet ik dat op voorhand. Het is al jaren aan de gang. Ik weet één ding: nog drie jaar en ik zet alles over naar een ander want zo brengt het gewoonweg niets op! Ik raad niemand deze bank aan, want zelfs als je een mail naar hen verstuurd krijg je na lang wachten een standaard mail terug met de dingen die ik al weet. Geen oplossing, niets. Voor beginnende beleggers is deze bank te mijden. Eén ster is zelfs nog teveel, het liefst zou ik geen ster willen geven!", "Titel: Klantvriendelijkheid kennen ze niet. Tekst: Als bank is Keytrade misschien goed maar hun service is beneden alle peil. Klantvriendelijkheid is hen onbekend. Een voorbeeld, onze bankkaart was bijna vervallen dus wij vragen aan keytrade voor een nieuwe kaart. Wij merken dan dat de kaart zou verstuurd zijn. Na 2 weken nog geen kaart dus we sturen, via de contactpagina in Keytrade, een bericht om te vragen wat er gaande is. Geen antwoord. Een week later valt de bankkaart eindelijk in de bus (3 weken vroeger verzonden). Je kan dan kiezen om de nieuwe code te ontvangen via SMS, dat doen wij maar dat lukt niet. Dus telefoneren naar Keytrade. 40 minuten wachten en eindelijk een medewerker aan de lijn. Ze doen dan een check om te zien dat je het wel echt bent en je moet dan inloggen. Maar dat lukt niet zo snel en de operator heeft geen tijd meer en sluit het gesprek af. Ze vinden het normaal dat jij 3 kwartier wacht maar als je ze eindelijk aan de lijn krijgt dan hebben ze plots zelf geen tijd meer.Dus opnieuw een bericht verstuurd aan Keytrade maar weer geen antwoord.  Drie dagen later dan nog maar eens per telefoon contact opgenomen. Natuurlijk weer langer dan een half uur wachten maar de medewerker nu kon ons wel helpen. Eindelijk. Maar ons vertrouwen in Keytrade is ernstig geschaad en wij vragen ons af of we geholpen worden als er eens een ernstig probleem is.", "Titel: Na een goede uitleg van Mr Tekst: Na een goede uitleg van Mr. Wouters is de transactie goed verlopen. Ik heb hem daarvoor ook via mail bedankt.", "Titel: Klantenservice is een dikke nul!!! Tekst: Klantenservice is een dikke nul!!!Ik hou Argenta als backup om snel weer te kunnen overstappen.", "Titel: Niet tijdig een nieuwe debet kaart Tekst: Al een aantal jaar klant zonder problemen tot recent. In het begin van de vorige maand merkte ik op dat mijn kaart zou vervallen en ik had nog geen nieuwe kaart gekregen. Ik belde zelf de klanten dienst op om proactief het probleem te vermeiden. De klanten dienst kijk het na en toevallig net die dag zou mijn nieuwe kaart verstuurd zijn en ik zou deze zeker hebben voor de eind datum. De maand verstrijkt, geen nieuwe kaart, oude is geblokkeerd kan niet meer betalen in de winkel. Terug 5 tal pogingen om de klanten dienst te bereiken per telefoon want per email krijg ik geen reactie. \"Door technische fout is de kaart niet verstuurd maar die is opgelost en de kaart is net vandaag verstuurd\". Toevallig elke keer dat ik bel, zou de kaart diezelfde dag verstuurd zijn geweest. Indien toeval (wat mijn merkwaardig lijkt) zijn ze ook de eerste keer niet eerlijk zijn geweest want toen was die kaart ook al onderweg. Ik heb ondertussen uit noodzaak een gratis rekening bij KBC geopend om terug een werkende kaart te hebben en had mijn kaart van de nieuwe KBC rekening sneller dan de vervang kaart van Keytrade. Fouten kunnen gebeuren maar als de klant zelf er vroeg bij is om het op te lossen wordt er gewoon niets mee gedaan. Ook geen begrip voor het ongemak, ze gaan er van uit dat je wel ergens anders ook klant zult zijn en zo het gemis kunt opvangen. Ik vraag mij af of ik ooit de vervang kaart zal krijgen. Als je dagelijkse bank kun je beter anders zoeken dan Keytrade.", "Titel: Jammer dat we niet 0 sterren kunnen… Tekst: Jammer dat we niet 0 sterren kunnen geven al enkele malen een betaling willen doen in de supermarkt ondanks dat er geld op de rekening staat, maar dat lukt niet even bellen voor het probleem wachten aan de telefoon na 25 min nog altijd het muziekje.", "Titel: Ik ben tevreden  over de service Tekst: Ik ben tevreden  over de service, zowel op de zichtrekening als de recent opnieuw licht stijgende intrest op de spaarrekening en langzaam evoluerende key private.", "Titel: Jarenlang klant...Service ondermaats Tekst: Jarenlang klant...Service ondermaats. Torenhoge kost om 1 verrichting van een afgesloten rekening bevestigd te krijgen. Gebruik van Visa kaart, online is problematisch. Als belegger geen feed-back, info, ....Telefonische contactname is problematisch. Beloftes worden gedaan, niet nagekomen (terugbellen).", "Titel: Als je graag eens 1 uurtje dezelfde muziek hoort Tekst: Na 2 keer meer dan 40' aan de lijn te hangen heb ik maar ingelegd. Hopeloos. Wacht nu op het antwoord via e mail, maar daar heb ik ondertussen ook lage verwachtingen van.", "Titel: 20 Jaar klant bij Keytrade bank! Tekst: Ben zo ongeveer 20 jaar klant bij Keytrade bank, voor zicht-, spaar,- en effectenrekening, Visa en Keyplan. Altijd zeer tevreden geweest over de tarieven, service en de veilige inlog en interface voor het bankieren en beleggen in aandelen. Zeer uitgebreide \"Globale Analyse\" met veel info over beursgenoteerde bedrijven die u vaak niet vindt bij andere banken/brokers, zeer handig om zelf te beleggen in aandelen. Mooie duidelijke interface/dashboard met verschillende info over je portefeuille, indexen, grondstofprijzen, real time koersen, enz... Oprecht nooit enig probleem ervaren, de telefonische service/info is makkelijk en snel bereikbaar tot 22u., men is steeds vriendelijk en behulpzaam, helemaal TOP!Bovendien 5 cent per bankverrichting cadeau, ook de % cashbacks bij aankopen bij partnerbedrijven is zeker een aanrader.Ben klant bij meerdere banken/brokers en kan stellen dat Keytrade er voor mij positief bovenuit steekt qua klantvriendelijkheid, behulpzaamheid, online banking en werking effectenrekening  (aandelen) en de gunstige tarieven. Wie Keytrade geen goede bank/broker vindt zal die naar mijn gevoel  nooit vinden. Nog enkele ervaringen:27/11/2021 contact gehad met Keytrade via mail, mijn mail verstuurd om 9:24u en om 10:18u al antwoord. Tweede mail gestuurd om 10:29u en om 12:44u al antwoord. Gisteren 26/11/2021, op vrijdagavond 20u telefonisch contact opgenomen en vrijwel direct antwoord, na een drietal veiligheidsvragen te beantwoorden om mijn identiteit te controleren meteen een deskundige en vriendelijke uitleg gekregen , \"OP BLACK FRIDAY 20U\" terwijl alle beurzen gesloten zijn, ook de Amerikaanse, probeer dat eens bij een andere bank. Dank u Keytrade! 10/12/2021 Vrijdagavond 20:30u telefonisch contact opgenomen en na de keuzemenu is er direct opgenomen door een vriendelijke medewerker en na een paar veiligheidsvragen heeft hij mij perfect en deskundig te woord gestaan. Keytrade doe zo verder, helemaal TOP!21/02/2022 Telefonisch contact opgenomen om 21:20u, na 2 beltonen is er opgenomen en ben ik vriendelijk en professioneel te woord gestaan.Na mijn jarenlange (intensieve) ervaring met Keytrade bank is en blijft Keytrade mij favoriete bank/broker.", "Titel: Mijn kaart werd geblokkeerd Tekst: Mijn kaart werd geblokkeerd, want ik heb het in Rusland gebruikt.ik wist niet over de sancties   En de bank besloot mijn rekening af te sluiten.", "Titel: Aanmaak Azur rekening duurt te lang. Getrouwheidspremie niet correct berekend Tekst: Samenvatting :Slechte helpdesk support. Lange wachttijden aan telefoon. Openen van Azur rekening neemt 6 weken in beslag en is zeer omslachtig. Probleem met behoud (of berekening) van getrouwheidspremie/verwervingsperiode bij transfer tussen HF rekening en AZUR rekening en terug. Dit probleem is uiteindelijk na 3,5 maanden opgelost.22/06/2023:Aanvraag Azur rekeningUiteindelijk drie weken na aanvraag een vriendelijke behulpzame medewerker aan de lijn gehad. Heeft mij beloofd om de Azur rekeningen laten aan te maken op korte termijn. 24/07/2023:Nog steeds geen rekening.In tussentijd deel van de fondsen naar andere bank getransfereerd.31/07/2023:Een bericht gekregen op mijn GSM. Volgens het bericht heeft iemand mijn GSM nummer op mijn Keytrade account gewijzigd. Met Keytrade hierover gebeld. GSM nummer was niet gewijzigd. Hadden hiervoor geen verklaring. Vreemd.Aangelogd op website. Blijkbaar is er een nieuwe zichtrekening / spaarrekening en beleggingsrekening gecreeerd terwijl ik enkel twee Azurrekeningen had gevraagd.Ook mail gekregen van Keytrade \"Welkom bij Keytrade bank…\". Ik ben blijkbaar een nieuwe klant.Probeer dit nu aan te kaarten via telefoon maar geraak niet binnen .Uiteindelijk opgegeven om te bellen en klacht ingediend. Wachttijd 4 weken volgens de auto reply.Ja veel frustratie, tijd en telefoonkosten voor het openen van twee spaarrekeningen. U weze gewaarschuwd…Ik probeer nu iemand te bereiken hoger in de Keytrade hierarchie om dit aan te kaarten.03/08/2023:Uiteindelijk is er een vriendelijk reactie gekomen van Keytrade ( dank zij deze review veronderstel ik ) en werden de Azur spaarrekeningen correct aangemaakt. Mijn input bleek waardevol en zou worden gebruikt voor de verbetering van de dienstverlening. Succes gewenst !08/08/2023:Op 07/08/2023 uitstaand saldo getransfereerd van HF spaarrekening naar AZUR spaarrekening. Op 08/08/2023 uitstaand saldo opnieuw getransfereerd van AZUR spaarrekening naar HF spaarrekening. Volgens de rentesimulatie van Keytrade is mijn getrouwheidspremie verloren op de HF spaarrekening en begin ik nu met een nieuwe periode van opbouwen van getrouwheidsintrest verworven binnen 365 dagen. Dit is niet correct. Ik behoud wettelijk mijn getrouwheidspremie/verwervingsperiode die ik al heb opgebouwd, bij een transfer tussen twee gereglementeerde spaarrekeningen en terug binnen dezelfde bank. Deze transfer mag drie maal per jaar gebeuren zonder verlies getrouwheidspremie. Ik heb daarom een correctie gevraagd van de berekening van de getrouwheidspremie waar ik recht op heb.Om 21.30 binnengeraakt bij helpdesk om dit ook telefonisch te bespreken. Na identificatie door medewerker doorverbonden en opnieuw in de wachtrij gezet. Uiteindelijk ingehaakt wegens lange wachttijd.10/08/2023:Antwoord van Keytrade dat er geen probleem is met de berekening van mijn getrouwheidsintrest. Ik heb opnieuw mijn uitleg gedaan en hoop op enig inzicht vanwege Keytrade. Zoniet zal ik mij tot de ombudsman van de federale overheid/ombudsfin moeten wenden om de knoop door te hakken. Uiteraard zal ik ook de FSMA op de hoogte brengen.17/08/2023:Antwoord van Keytrade. Blijkbaar is er een bug in het IT systeem waardoor de intrest calculatie niet correct wordt berekend. Het gaat worden rechtgezet.22/08/2023:Vandaag gecontroleerd of de intrestberekening nu correct is maar spijtig genoeg is dit nog steeds niet in orde.19/09/2023:Vandaag gecontroleerd of de intrestsimulatie nu correct is maar spijtig genoeg is dit nog steeds niet het geval.28/09/2023: Uiteindelijk klacht ingediend bij Ombudsfin. 13/11/2023:Nog steeds geen oplossing.21/11/2023:Bericht gekregen van Ombudsfin. Het probleem met de verkeerde intrestsimulatie is opgelost voor alle betrokken klanten. Eind goed al goed. Maar het heeft wel zeer lang geduurd. Bij deze sluit ik deze topic af. Conclusie:Ik heb veel tijd in Keytrade gestoken en aangezien tijd = geld moet ik besluiten dat het gratis verhaal van Keytrade met een korrel zout moet worden genomen. Ik denk niet dat Keytrade te kwader trouw is maar de customer support moet dringend beter. Aangezien er toch een oplossing is gekomen en rekening houdende met de concurrentiële intrestvoeten op de spaarrekening in combinatie met de mogelijkheid om te beleggen op de beurs upgrade  ik mijn beoordeling van 1 naar 3 sterren.", "Titel: Omdat alles verliep zoals ik verwachtte. Tekst: Omdat alles verliep zoals ik verwachtte.", "Titel: 12 jaar tevreden klant Tekst: Prettige interface en app, volledig gratis en behoorlijk vlot telefonisch te bereiken als het nodig is.", "Titel: Onmogelijk om deze bank telefonisch te… Tekst: Onmogelijk om deze bank telefonisch te bereiken, en berichten worden ook niet beantwoord.  Wat een geblunder.", "Titel: Alles wat we opgeven ,wordt correct…perfecte uitvoering Tekst: Alles wat we opgeven ,wordt correct uitgevoerd.", "Titel: 𝐆𝐞𝐥𝐝 𝐤𝐰𝐢𝐣𝐭 𝐠𝐞𝐫𝐚𝐚𝐤𝐭? Tekst: -Sorry, uw geld dat door onze technische fout verloren is gegaan, betalen wij niet terug, Keytrade Bank-BzZzT BzZzt, Mail van Keytrade bank: – Technische fout in de app.Beste, we fucked up. Een technische fout deed zich voor. Betalingen worden mogelijks niet uitgevoerd. Maar geen probleem! Administratieve kosten als gevolg hiervan, betalen wij terug.- Ok, thx Robin Hood, ik hou het wel in de gaten. Gelukkig gaan er niet veel betalingen via die rekening omdat het van mijn bijberoep is.Dag 1: niets te zien. Dag 2: niets te zien. Dag 3? Jep, je hebt gelijk, niets te zien. Enkele dagen later: Iets te zien! Say whuuut? Aaahh maar NIET in de Keytrade app. Nee… in Paypal! Daar worden mijn betalingen correct afgerond. - Thx, pall!Alles is op tijd betaald dus er zullen wel geen “administratieve kosten” zijn zeker? ...Het gaat uit mijn hoofd.3 maand later en ik controleer al mijn betalingen uit goede gewoonte. Een betaling is dubbel uitgevoerd door dé technische fout. Ik neem contact op met Keytrade bank.Eerste mail: 2 weken zonder antwoord, typisch, dus ik bel. 1 uur luisteren naar hun beste playlist en… KLIK:- Hallo meneer… Ja dat klopt, wij erkennen de technische fout... Ok even kijken… Oeps, het is langer dan 2 maand geleden. Jammerrr, dat betalen wij niet meer terug na 2 maand. Doei!- Jullie geraken mijn geld kwijt, ik heb daar bewijs van en jullie betalen mij niet terug?- Jep, zo gaat het bij Keyfraud. See ya!Ontvang geld, raakt wat kwijt, oeps! Geen probleem! Uncle Keytrade bepaalde een korte periode waarna je niets terugbetaald ookal is het jouw fout. Thx Keytrade Bank, je was de ster van dit verhaal.", "Titel: Bende dieven Tekst: Bende dieven, we geraken gewoon niet meer aan ons geld Geen antwoord via mail, telefoon...De naam bank niet waardig.En al veel gedupeerden.  Blijf er aub weg!!", "Titel: contactcenter onbereikbaar Tekst: al dagen telefonisch niet binnen te geraken in het contactcenter en geen antwoord op emails", "Titel: Aantrekkelijke spaarrente. Tekst: Aantrekkelijke spaarrente.Competent en correct verder geholpen door hun klantendienst. Keytrade medewerkers zijn klantvriendelijke aan de telefoon.Een innovatieve en overzichtelijke online bankieren website.", "Titel: Activatie probleemloos verlopen Tekst: Activatie probleemloos verlopen, hadceerfer een probleem ombinvte liggen, maar met de hulp van het contact betreffende paswoord verliep alles vlotjes.", "Titel: Goede dienstverlening voor redelijke prijs Tekst: Alles werkt technisch goed. Transactieprijzen zijn redelijk en transparant", "Titel: Oude versie van de app werkte sneller Tekst: Datum van ervaring: 04 april 2024", "Titel: Makkelijk Tekst: Makkelijk, veel info, ruime keuze", "Titel: Help desk Tekst: Help desk. Gisteren 45m in wacht alvorens er opge’omen werd", "Titel: snelle en gemakkelijke toegang via app Tekst: Datum van ervaring: 01 oktober 2023", "Titel: Handig voor overal via de app in te… Tekst: Handig voor overal via de app in te spelen op de markt", "Titel: Meer dan een half uur wachten aan de… Tekst: Meer dan een half uur wachten aan de telefoon. Geen reactie. Bedroevend.", "Titel: Tevreden met mijn rekeningen Tekst: Tevreden met mijn rekeningenSimpel en duidelijk!", "Titel: Heel tevreden Tekst: Tevreden, rap en goed.De intrest mag nog hoger.", "Titel: Heel eerlijke bank Tekst: Heel eerlijke bank. heel erg tevreden hoor.", "Titel: Payconiq werkt niet meer met Keytrade… Tekst: Payconiq werkt niet meer met Keytrade kaarten", "Titel: Top service,bedankt Tekst: Top service,bedankt", "Titel: vlotte werking Tekst: Datum van ervaring: 03 mei 2024", "Titel: Van voorloper tot naloper: kan Keytrade Bank nog dieper zinken? Tekst: 15 jaar terug was Keytradebank een voorloper. Intussen is het een wanhopige nahinker geworden met een klantendienst die zichzelf bedient, maar zeker geen klanten. Sindsdien blijken functionaliteiten van het platform niet te werken, scheept de helpdesk de client dagenlang af liever dan het probleem aan te pakken, het laat de client urenlang aan de lijn hangen, waarna de lijn verbroken wordt, juridische vragen omtrent bankzaken blijven onbeantwoord of worden ronduit verkeerd beantwoord, het afsluiten van een rekening neemt meer dan 6 MAANDEN in beslag, alsmede talloze rappels, informatie over betalingen van de gespecialiseerde dienst binnen de bank blijkt gewoonweg fout te zijn, compliance is de incoherentie zelve en vooral, de problemen schijnen niemand bij de 'bank' te boeien! Als client krijg je vooral te horen dat je vraag hen irriteert, dat er eindeloze procedures moeten worden gevolgd om het antwoord te krijgen op de vraag waarom het platform niet correct werkt, alsof dat jouw probleem is als client, maar vooral niets te maken heeft met de bank, dat je zal op de hoogte gehouden worden zonder dat dit ooit het geval is, dat een geldwissel van EUR in USD buiten een effectentransactie om een veelvoud kost van dezelfde geldwissel voor hetzelfde bedrag waarin daar bovenop een effectentransactie vervat zit. En de CEO van de bank is zonder twijfel nog de meest apathische van allen. Onvoorstelbaar hoe een persoon die zijn organisatie niet kan motiveren, die blijkbaar niet de minste leiding geeft en die nooit antwoordt op klachten die hem rechtstreeks worden toegestuurd jarenlang ongemoeid wordt gelaten en blijkbaar zijn zetel heel relaxt kan blijven bezetten. Misschien moet de NBB de werking van deze 'bank' eens nauwkeurig tegen het licht houden, want er gebeuren veel dingen die betekenen dat Keytrade Bank die naam niet meer waardig is.", "Titel: Goedkoop bankieren zonder rompslomp Tekst: Online werkt uitstekend. Informatie vlot beschikbaar. Goedkoop bankieren", "Titel: onbereikbaar Tekst: onbereikbaar, noch telefonisch, noch per email", "Titel: Klantenservice niet te bereiken. Tekst: Klantenservice niet te bereiken.De online applicaties werken voor geen meter.", "Titel: Alles gaat heel vlot Tekst: Alles gaat heel vlot, kosten zijn niet te hoog", "Titel: Duidelijke website Tekst: Duidelijke website, het verdienmodel bij verrichtingen met de rekening", "Titel: Alles verloopt goed Tekst: Datum van ervaring: 28 september 2023", "Titel: Blijkbaar lukt het niet om een… Tekst: Blijkbaar lukt het niet om een overschrijving te doen met de app.", "Titel: Zeer tevreden Tekst: Datum van ervaring: 30 september 2023", "Titel: Snel en eenvoudig Tekst: Datum van ervaring: 27 september 2023", "Titel: Geen problemen totnogtoe Tekst: Geen problemen totnogtoe. Telefonische assistent is accuraat en voldoende.", "Titel: Eenvoudig en voordelig Tekst: Eenvoudig en voordelig", "Titel: Tenminste een bank die denkt aan klant Tekst: Datum van ervaring: 18 oktober 2023", "Titel: Goede interestvoet op spaarboek. Tekst: Datum van ervaring: 02 oktober 2023", "Titel: Goedkope online bank met duidelijke… Tekst: Goedkope online bank met duidelijke dienstverlening.", "Titel: Zeer goedkope bank met kwaliteitsvolle… Tekst: Zeer goedkope bank met kwaliteitsvolle dienstverlening.", "Titel: Tevreden Klant. Tekst: Zeer tevreden. Efficiënt gebruik!", "Titel: Alles ging naar wens! Tekst: Datum van ervaring: 22 september 2023", "Titel: alles loopt vlot Tekst: Datum van ervaring: 17 september 2023", "Titel: Superhandige en overzichtelijke app Tekst: Datum van ervaring: 14 maart 2024", "Titel: Logische opbouw Tekst: Datum van ervaring: 06 maart 2024", "Titel: Zo maar uit dank Tekst: Datum van ervaring: 25 maart 2024", "Titel: Keytrade is onbereikbaar bij problemen. Tekst: Datum van ervaring: 30 mei 2023", "Titel: Geen opmerkingen. Tekst: Datum van ervaring: 27 augustus 2023", "Titel: Website Tekst: Duidelijke website", "Titel: Correcte informatie Tekst: Datum van ervaring: 20 september 2023", "Titel: Telefonisch onbereikbaar Tekst: Datum van ervaring: 07 september 2023", "Titel: Login is catch 22 - helpdesk neemt niet op Tekst: Login is catch 22: de login via web vraagt om de softkey op je GSM profiel. De app op de GSM vraagt om de softkey van de webtoepassing.Helpdesk neemt pas op na meer dan half uur.Uiteindelijk is er wel een oplossing gevonden", "Titel: pensioenfonds keytrade Tekst: Ik heb mijn pensioenfonds twee maanden geleden verkocht, maar het vrijgekomen bedrag is nog steeds niet beschikbaar. Telefonisch is keytrade onbereikbaar. Ook op de inmiddels 5 verstuurde E-mails met de vraag voor uitleg ontvang ik geen enkele reactie (buiten een auto-replay). Bij Argenta was de verkoop van mijn pensioenfonds binnen drie dagen in orde en stond het geld op dag 4 op mijn zichtrekening.", "Titel: Ik heb voor de moment nog geen goede… Tekst: Ik heb voor de moment nog geen goede ervaring met deze bank.Ik moet al 5 weken een login per post toe gestuurd krijgen , maar blijkbaar na de 2e login te versturen weten ze mijn adres duidelijk niet te vinden !! Wat vreemd is want de debetkaart had ik na 7 dagen al ontvangenIk kan maar beter een andere zoeken om te sparen en beleggen.", "Titel: slechte service Tekst: slechte service, wachttijden en doorverbinden, niet doen, hoe kan zo een bank een banklicencie krijgen, begrijp ik niet, kan er dan  niemand ingrijpen en dat zo laten blijven verlopen, een schande", "Titel: Geen Payconiq functie meer! Keytrade stapte eruit! Tekst: Heeft geen werkende payconiq meer sinds nieuwe bankkaarten. Ze verwijderden de functionaliteit bij elke nieuwe kaart. Ik ben er bijna 20 jaar klant, maar ik denk er nu aan om over te stappen naar een andere bankinstelling en alle rekeningen daar af te sluiten. Met reclame proberen ze u wijs te maken dat de nieuwe kaart een verbetering is. Ik merk enkel dat de payconiq niet meer werkt en bij niemand met een nieuwe kaart. Payconiq wordt een Europees betaalmiddel/app. Maar Keytrade is hiertegen en dus stapte ze eruit!", "Titel: Al 10 jaar lang zeer tevreden van deze bank Tekst: Ik ben al meer dan 10 jaar klant bij Keytrade. POSITIEF: * Gratis zichtrekening spaarrekening en beleggersrekening * Gratis Visa kaart (bij min 12 verrichtingen/jaar * goed fondsen aanbod aan lage kost / Keyplan fondsen gratis (na min 5 jaar looptijd) * lage beurstransactie tarieven * hoger dan andere banken spaarrekening rente * redelijk goed (passief) belegginsadvies via Global Analyzer module * goede veilige en snelle app MINDER POSITIEF: Wat traag bij antwoorden emails (maar er komt uiteindelijk wel altijd een behulpzaam antwoord) = reden voor 4 sterren ipv 5 BESLUIT: Zeer goede bank met ruim gratis aanbod voor zowel de kleine belegger, spaarder en gebruiker van enkel zichtrekening en of maestro en visa", "Titel: WEGBLIJVEN BIJ DEZE BANK Tekst: WEGBLIJVEN BIJ DEZE BANK! Klantenservice bestaat zelfs niet bij deze bank. 1 ster is zelfs nog teveel. Rekening afsluiten bij deze bank in onbegonnen werk, Reeds 3 maanden bezig om rekeningen af te sluiten, nog steeds niet in orde. Op e-mail wordt gewoon niet geantwoord, telefonisch bereikbaar na 1 uur wachten als je geluk hebt, ze beloven dit in orde te brengen maar ik wacht nu al 2 maanden vruchteloos. 1 Gouden tip : blijf gewoon weg bij deze bank, enkel een hoop frustratie en miserie!!!!", "Titel: Wegblijven Tekst: Een rekening openen ging zeer gemakkelijk online en in een paar klikken geregeld.Echter om deze ongebruikte rekeningen achteraf af te sluiten sturen ze u een pdf document dat je moet invullen.Om daarna terug in te scannen samen met een recto verso van mijn paspoort.Omslachtige methode hoe dan ook.Mails naar hun \"klantendienst\"blijven wekenlang onbeantwoord.HilarischWegblijven bij die bank!", "Titel: Het wordt daar TE KLANTONVRIENDELIJK, dus mijn advies: wegblijven... Tekst: De internetbank gaf in het begin aan klanten 2 gebruikersnummers. Na de overname van Fortuneo worden hun rekeningnummers na een tijd plots zomaar veranderd (!) zodat er voor de klant een chaos ontstond en dus een grote soep om uit te puzzelen. Nu weer: tijdens het weekend moest ik in 1 van beide gebruikersprofielen inloggen maar dat gaat plots niet meer.Blijkbaar hebben ze de 2 profielen nu bij elkaar gelapt ZONDER DE KLANT OP DE HOOGTE TE BRENGEN. Voor onze interne boekhouding is dat een praktisch probleem.Duurder voor hun beleggingen,  lage intresten op spaarinlages, slechte behandeling van de klant door onbestaande communicatie en mijn visie is: voortaan WEGBLIJVEN. Het wordt daar TE KLANTONVRIENDELIJK.", "Titel: Niets anders dan problemen en gefoefel op hoog niveau Tekst: - Softkey werkte niet om het account te activeren.- Ze beloven alles in orde te maken en instanties op de hoogte te brengen van je verandering, maar amper de helft van mijn lopende domiciliëringen hebben ze overgezet of op de hoogte gebracht.- Onmogelijk te koppelen met Paypal.- Onmogelijk te koppelen met Payconiq.- Geen toegang tot creditcard, hoewel er meer dan genoeg reserve op de rekening staat en ik een bovengemiddeld loon ontvang. Misleidende advertentie over de \"gratis\" creditcard, makkelijk als je niemand een kaart geeft natuurlijk. Het antwoord was: \"We zijn niet verplicht een reden te geven voor het afwijzen van de creditcard aanvraag.\"- €600 is al teveel om over te schrijven via mobiel. Wat is dan het nut van je te profileren als een online bank, als je amper verrichtingen kan doen via de app. - Als je wil uitschrijven voor hun nieuwsbrief, kom je op een pagina terecht die niet meer bestaat.", "Titel: Triple zero bank (Bank van de Aldi) Tekst: Triple zero bank (Bank van de Aldi)Vijf weken na aanvraag slagen ze er nog niet in om een rekening geopend te krijgen.....", "Titel: Telefonische wachttijd tot in de eeuwigheid... Tekst: Aangetekende brief ontvangen om openstaande schuld op mijn effectenrekening te betalen. Ik heb al 2 keer een uur gewacht om telefonisch binnen te geraken, nu de derde keer ben ik al TWEE UUR in wacht!", "Titel: Geen klantenservice Tekst: Het woord klantenservice is niet gekend bij deze bank.Het is echt triestig. De Softkey werkt niet.Een zeer onbetrouwbare en onbekwame bank.", "Titel: Klantenservice onbestaande. Antwoorden nooit. Tekst: De voorbije weken, met tussenpozen van paar weken,  twee mails gestuurd omdat hun fameuze Softkey niet werkte en dus hardkey (bakske) gevraagd. Geen enkele reactie. Rekening openen duurde ook meer dan 3 weken. Klantenservice onbestaande.Een bank die geen enkele reactie geeft op een vraag is voor mij onbetrouwbaar en daar plaats ik dus geen geld.", "Titel: NIET DOEN!!! Tekst: Na drie weken nog steeds geen antwoord op mijn VISA aanvraag. Antwoorden NIET op email, en heel traag via telefoon. Had initieel gebeld omdat ik enkele vragen had over de VISA kaart, en de twee mannen die ik heb gesproken aan de telefoon wisten er precies zelf niet veel van. Ik kies liever voor een duurdere bank die mij een betrouwbaar gevoel geeft, dan deze die niks laat weten. Ik kan zelf niet eens op mijn laptop inloggen door telkens 'een technische fout'", "Titel: Beter is er niet,simpel Tekst: Datum van ervaring: 08 januari 2023", "Titel: Geen enkel contact te krijgen Tekst: Ik wil een rekening bij hun opzeggen en had hier een formulier voor ingevuld. Na maanden nog steeds het resterende bedrag niet ontvangen. Na een heleboel mails gestuurd te hebben waar geen enkele reactie op komt, loze beloftes aan de telefoon gekregen te hebben, geen enkele reactie op messenger te krijgen, is er geen enkel contact met hun te krijgen. Ik wil mijn rekening opzeggen maar er komt geen enkele reactie. Ik zou graag mijn geld terughebben!!!!!!!", "Titel: Al een maand op een rekening aan het wachten Tekst: Begin december een aanvraag gedaan om een gezamenlijke rekening te openen. Na weken nog geen nieuws, bleken ze de documenten kwijt te zijn. Uiteindelijk teruggevonden en op 20 december kregen we een mail met extra vragen over tewerkstelling. Nu 4 januari nog steeds geen rekening. Onbereikbaar via telefoon of e-mail.", "Titel: Onmogelijk om snel rekening te openen… Tekst: Onmogelijk om snel rekening te openen voor minderjarige. Online tool werkte niet volledig waardoor bepaalde documenten per e-mail of per post moesten worden opgestuurd. Nu 4 weken later nog steeds rekening. Veel tv reclame, ongelooflijk trage behandeling van e mails, lang wachten telefoon. Online Bank onwaardig. Dan liever iets duurder en professioneler !!!!", "Titel: Ondermaatse dienstverlening Tekst: Klanten lokken met een gratis VISA-kaart maar die uiteindelijk weigeren, zelfs als je een gemiddeld maandelijks inkomen hebt. Je kan een rekening openen met je eID maar ze weigeren documenten die elektronisch getekend zijn. Jammer, leuk concept voor een online bank maar de dienstverlening is ondermaats.", "Titel: De service is compleet waardeloos Tekst: De service is compleet waardeloos. Ze antwoorden gewoon niet op E-mails. Als je belt dan moet je 30 tot 45 minuten wachten om iemand aan de lijn te krijgen en als je dan iemand aan de lijn krijgt dan zegt die niet bevoegd te zijn om u te helpen.", "Titel: Heel omslachtig systeem om in te loggen… Tekst: Heel omslachtig systeem om in te loggen op je spaarrekening. Helpdesk bijna onbereikbaar. Je moet minstens 15 min in de wacht blijven voor er iemand opneemt. Antwoord op een mail laat ook zo'n week op zich wachten.", "Titel: Klantendienst negeert mijn vragen en suggesties Tekst: Kreeg op 3 oktober 2022 een bericht dat ik een debetrente van 18,46 EUR + 0,15 EUR Zegelrecht moest betalen op mijn effectenrekening. Heb volgens mij nooit negatief gestaan, dus vraag ik via \"Contact\" (reeds 2 x) voor meer uitleg en zelfs terugbetaling. Maar tot op heden geen reactie.Heb hun ook al gevraagd om de selectie van fondsen gebruiksvriendelijker te maken. Nu moet ik fonds per fonds nagaan of het stijgend of dalend is. De lijst van de geselecteerde fondsen moet ik telkens opnieuw instellen.  Zo ben je uuuuuren bezig. Maar constructieve suggesties worden gewoon genegeerd.  Zo kan je niet vlot beleggen.", "Titel: wegens onvrede wil ik mijn rekeningen… Tekst: wegens onvrede wil ik mijn rekeningen bij keytrade bank afsluiten.  Hoe moeilijk kan dat zijn?  Ik heb de gevraagde dokumenten ingevuld en doorgestuurd.  Heb bevestiging gekregen dat ze ze ontvangen hebben.  Kreeg 2 dagen geleden bericht van \"moneytransfer\",, dus ik concludeer dat het geld nu op mijn opgegeven rekening staat.  Neen hoor. In paniek gebeld naar klantendienst.  Heel lang aan de lijn gehangen.  Eindelijk een medewerker aan de lijn gekregen die doet precies of ik achterlijk ben of zelfs een leugenaar.  Op zijn vraag wanneer ik voor het laatst had ingelogd antwoordde ik naar waarheid dat ik blijkbaar niet meer kan inloggen. De app toont niks meer.  Ik krijg dan als antwoord: \"Je hebt deze voormiddag nog ingelogd\".  Ik heb geprobeerd ja, maar het lukte niet, dus heb ik niet ingelogd.  O mijn vraag over het bericht van \"moneytransfer\" antwoordde hij dat het een interne overschrijving was.  Ik moet wat geduld hebben, want \"we zijn ermee bezig\".  Hoe lang nog?  Voor mij O op 10!", "Titel: Pure tegenwerking van begin tot eind Tekst: Als bewindvoerder in contact moeten treden met Keytrade Bank. Onwaarschijnlijk hoe onmenselijk en absoluut contrair je wordt behandeld door hun 'Middle Office Department'. Terwijl je bij MeDirect en Deutsche Bank identiek dezelfde papieren indient en een perfecte afhandeling v/e sluiting v/e rekening krijgt ben ik hier nog geen stap verder. Onmogelijk om deze persoon te spreken, dus moet je het doen met mails in google-translate Nederlands waar je soms geen woord van verstaat. Absoluut schandalig!", "Titel: Klant worden bij Keytrade bezint eer gij begint! Tekst: Klantendienst service trekt op niets nul👎 op geen klo….Reeds maanden vraag ik via mails en telefoon verkeer om mijn nieuwe visa kaart! Zou verzonden zijn begin september uit Frankrijk nog steeds niet ontvangen. Mijn vrouw heeft haar kaart reeds maanden geleden ontvangen. Goedkoopste bank maar een 💩 klantendienst! Had bij onze aansluiting ook problemen!Potentiële klanten bezint eer gij begint bij Keytrade.", "Titel: Bij hen beland toen Gestrabel… Tekst: Bij hen beland toen Gestrabel overgenomen werd. Dienstverlening is ondermaats: toen ik hen een tijdje terug een vraag stelde over de nieuwe effectentaks repliceerden ze doodleuk dat ik dat maar aan een financieel adviseur moet vragen. Nu laten ze me weten dat enkele pennystocks uit mijn portfolio moeten verdwijnen want anders gaan ze mij maandelijks 5€ aanrekenen per aandeel. Tja. Ze hebben meer concurrentie nodig in B.", "Titel: telefonisch geholpen Tekst: Via mail en telefoon Klantendienst gecontacteerd,  bij 3e keer (via telefoon) door zeer geduldige meneer goed geholpen.", "Titel: Hopeloze service Tekst: Hopeloze service. Verschillende keren gebeld : de eerste keer heb ik na 8 minuten maar ingehaakt, de tweede keer heb ik de telefoon 15 min moeten laten openliggen voor er iemand opnam. Vijf dagen eerder had ik een verhoging van de limiet van mijn debetkaart aangevraagd. Tot op heden is mijn limiet nog niet verhoogd. Blijkbaar is het een zeer complexe en ingewikkelde procedure. Wel erg dat je tegenwoordig nog niet meer te allen tijden over je eigen geld kan beschikken.", "Titel: slechte bank app ooit uitgevonden Tekst: slechte bank app ooit uitgevonden. geen logica, zo ingewikkeld", "Titel: Ik denk dat ze zichzelf willen… Tekst: Ik denk dat ze zichzelf willen opdoeken.   15 € vragen om een aankoop of verkooporder te plaatsen op de beurs van amsterdam slaagt nergens op.  Zelfs een grootbank als belfius is goedkoper met 6 €", "Titel: Slecht in één woord! Tekst: 1 maand wachten op een rekening te openen. E-mails gestuurd om te vragen. Informatie doorgeven van mijn inkomen. Er wordt telkens een smoes verzonnen als ik 2 keer belde. Wat slecht dienst. Verdient 0 sterren.", "Titel: Schandalige service Tekst: Er is een zekerheid: slechter vindt men nergens!", "Titel: Waardeloze 'bank' Tekst: Waardeloze klantenservice. Rekenen meer aan voor een internationale overschrijving dan het bedrag dat overgeschreven wordt, dit staat waarschijnlijk dan wle ergens op de website doch men zou tijdens de overschrijving toch wel een melding mogen krijgen. Ik ben zo snel mogelijk weg bij deze bandieten.", "Titel: Super bank Tekst: Al jaren klant. Nooit problemen gehad. Je moet wel rekening houden dat dit een internetbank betreft waarbij je bankverrichtingen via PC zelf doet. Maar dit loopt zeer goed. Bij andere grote banken heb je misschien meer mogelijkheden maar aan een veel hogere prijs en ondertussen verdwijnen ook meer en meer van hun medewerkers. Ik gebruik hen ook voor beleggingen, tot grote tevredenheid. Hun adviezen zijn super en hebben me al veel rendement opgebracht.Voor een persoon met beperkt vermogen (<1.000.000) zeker aan te raden.", "Titel: Overschrijving geweigerd. Hulplijn ondergekwalificeerd. Tekst: Een recente overschrijving voor een groot bedrag van Keytrade naar een andere rekening bleek na enkele dagen wachten geweigerd. Nochtans kwam er geen verwittiging tijdens het uitvoeren van de transactie. Vermits het om een notariële transactie ging, heeft dit grote stress met zich meegebracht. Telefonisch (na totaal 40 minuten wachttijd) geprobeerd spoed te zetten achter de transactie die om onverklaarbare reden bij een tweede online poging wel lukte. Het enige dat ik te horen kreeg was dat er onvoldoende saldo op de zichtrekening had gestaan en dat Keytrade nu tot twee werkdagen de tijd heeft om het geld over te maken naar een andere rekening. Twee pertinente onwaarheden. Hulp kreeg ik niet. Een hoop frustratie bovenop de stress kreeg ik er daarentegen gratis bij.Nul voor financiële kennis. Nul voor klantgerichtheid.", "Titel: Zeer slechte ervaring na bloccering van… Tekst: Zeer slechte ervaring na bloccering van de visakaart na fraudegeval, dat wel goed werd opgelost.Na herhaalde contactname en allerlei beloftes werd na vele maanden nog steeds geen nieuwe kaart opgestuurd. Geen bericht, geen kaart,niets,nada.", "Titel: Sinds een paar maanden klant bij… Tekst: Sinds een paar maanden klant bij Keytrade en kan eerlijk niets negatief zeggen.  Toegegeven dat ze niet de snelste zijn in het verwerken van transacties, maar het komt wel altijd in orde.  Tot nu toe al drie keer naar de klantendienst gebeld en altijd betrekkelijk snel iemand aan de lijn met een vriendelijk en duidelijk antwoord. 5 cent per verrichting is mooi meegenomen en de Visa gold met verzekeringspakket kost bij andere banken aardig wat geld. Ben dus een tevreden klant.   Gewoon niet vergeten dat bij Keytrade geduld loont.", "Titel: Wat is er gebeurd bij Keytrade? Tekst: Al even mijn Keytrade account niet meer geraadpleegd, maar nu stel ik vast dat ik de voorgaande commentaren van november 21 moet bijtreden.   Veranderde layout, geen uitleg hierover te vinden, ik vind nergens een totaalhistoriek sinds het begin van mijn transacties/orders.   Zelfs twijfel ik of niet één van mijn aandelen gewoon uit mijn lijst is verdwenen..?? Is dit al tot bij Test-Aankoop geraakt?", "Titel: App is slecht Tekst: Hun app werkt geregeld niet, blijft vaak haperen.", "Titel: VISA-kaart geweigerd Tekst: Na het openen van een rekening bij Keytrade (switch vanuit een klassieke grootbank), werd de aanvraag tot VISA-kaart geweigerd. Ik kreeg als reden voor de weigering: u bent zelfstandige, en kan daarom geen kredietkaart krijgen binnen Keytrade. Bij vragen naar het waarom, kreeg ik steeds hetzelfde standaardantwoord: “wij hebben het recht om dat te doen, aangezien het een interne regeling is”. Niets meer. In ieder geval had men dit MOETEN communiceren bij het openen van een rekening. Dus, voor zelfstandigen en vrije beroepen: u krijgt geen kredietkaart van Keytrade. Wees gewaarschuwd. U krijgt ook geen uitleg over het waarom.", "Titel: Tevreden van Keytrade Tekst: Mijn ervaringen met Keytrade zijn positief. De website is oké, de service goed. Bij een probleem, mail ik en doorgaans is er duidelijk, oplosgericht antwoord binnen 1-2u. Het kostenplaatje is positief, veel is gratis (de beloning van 5cent is niet mis)... Kortom, ik ben tevreden, zonder meer.", "Titel: Hopeloos Tekst: Na bijna een jaar aan het lijntje te zijn gehouden en alle mogelijke documenten van hun website te hebben ingevuld en doorgestuurd x3,stopt het voor mij. Wat een zielige organisatie, wie vertrouwd zijn centen aan zulke bank toe. Incompetente bende", "Titel: slechte klantenservice Tekst: ik stelde 3 vragen aan de klantendienst, waarvan 2 dringend met indicatie van de tijdsmarge wanneer ik het antwoord nodig had. Krijg ik énkel antwoord op de niet dringende vraag. Een volgende vraag voor antwoord op mijn andere vragen werd compleet genegeerd. Ik heb nu een hoop kosten die ik perfect had kunnen vermijden indien ze mijn vragen beantwoord hadden.", "Titel: Probleem met online-bankomgeving met gevolgen én de nasleep van een niet-gehonoreerde belofte.. Tekst: 28/02/2022Wilde gisteren een order annuleren. Systeem toont \"annulatie naar de markt gestuurd\" en status wordt op \"wachten op annulatie\" geplaatst, maar bij het nakijken vandaag, blijkt het order niet geannuleerd en staat de status opnieuw op \"wachten op uitvoering\".  Vandaag aan de klantendienst gemeld per telefoon. Men ging contact opnemen met de markt. Benieuwd wanneer dit probleem wordt opgelost.01/03/2022Het probleem werd dus niet opgelost. Het order is uitgevoerd. De annulatie van het order is dus niet gebeurd. Keytrade heeft ook nog geen contact opgenomen. Ik weet ook of dit een eenmalig probleem is of een recurrent. Geen goede ervaring dus. Beoordeling ervaring: 1 ster.11/03/2022Klacht van 01/03 nog niet beantwoord.17/03/2022Klacht beantwoord.Verontschuldigingen voor technisch probleem.Bevestiging dat probleem werd opgelost.Kleine commerciële geste.Ietwat trage, maar verder professionele reactie en Keytrade heeft (hierdoor) technisch probleem opgelost.Wijziging beoordeling ervaring: van 1 naar 3 sterren.30/03/2022Ik moet jammer genoeg zeggen dat ik te positief was. De beloofde kleine commerciële geste onder de vorm van kwijtschelden van transactiekosten voor een aantal transacties werd niet gehonoreerd. Ik neem contact op met de QualityCare afdeling met de bewijzen dat de transactiekosten onterecht werden aangerekend. Ze antwoorden met een mail met bewijzen dat ... de transactiekosten werden aangerekend. Alleen schrijven ze dat het bewijzen zijn dat de transactiekosten NIET werden aangerekend. Opnieuw mail naar hen om dit tegen te spreken.Ze bellen me driemaal op en haken onmiddellijk in nadat ik opneem.Wijziging beoordeling ervaring: van 3 naar 1 ster(ren).31/03/2022Via mail biedt de Quality Manager excuses aan voor het \"misverstand\" en de problemen met betrekking tot de \"boekhouding van gratis transacties in de borderellen\". Het zou gaan om een \"vrij uitzonderlijk\" probleem. Er wordt me beloofd dat controles en correcties in de \"bevoegde afdeling\" zo snel mogelijk uitgevoerd zullen worden.Ik vind dit een vage uitleg en er wordt me dus geen onmiddellijke oplossing aangeboden voor probleem na probleem. Ondertussen sleept deze zaak al een maand aan.09/04/2022Ik heb gemerkt dat enkele transacties zonder kosten zijn uitgevoerd. Daarmee heeft Keytrade (eindelijk) aan zijn belofte kunnen voldoen.GEVOEL BIJ DEZE ERVARINGProbleem na probleem, excuus na excuus, zonder een snelle, goede oplossing aan te bieden. In deze case heeft Keytrade me niet overtuigd dat hun klantenservice en kwaliteitsmanagement top is.De oplossing is er uiteindelijk gekomen, maar dit heeft veel te lang geduurd en mij veel te veel energie gekost.Beoordeling voor deze ervaring: blijft 1 ster.08/05/2022Het probleem van het annuleren van een beursorder doet zich opnieuw voor! Dus opnieuw een positie geblokkeerd, waar ik dus niet meer vrij over kan beschikken.09/05/2022De geblokkeerde positie (op de website) deze keer via de app kunnen annuleren.", "Titel: Vreselijke service Tekst: Vreselijke service! Uit pure frustratie mijn rekeningen proberen af te sluiten … een jaar geleden alle documenten opgestuurd, nooit reactie gekregen. Talrijke herinneringsmails gestuurd : geen antwoord. Meermaals gebeld op 02 6789000 : de raarste geluiden, maar geen menselijke. Noch per mail, noch per telefoon bereikbaar … hoe moet je dan je rekeningen afsluiten?? Uiteraard, mijn rekeningen zijn leeg … al lange tijd.", "Titel: Rampzalige klantendienst, geld kwijtgeraakt! Tekst: Als er geen problemen zijn, kan je met Keytrade werken. Maar als er een probleem is, dan wordt het niet opgelost. We hebben 2 transacties doorgevoerd waarbij het geld nooit is aangekomen. De klantendienst bij Keytrade houdt ons al een maand aan het lijntje, maar willen niet zeggen wat er met mijn geld gebeurd is. Het is van mijn rekening afgeschreven, en is nergens aangekomen, en de bank is niet in staat te zeggen wat er mee gebeurd is. De klantendienst reageert heel agressief en blijft vertellen dat ze met mijn dossier bezig zijn, maar dat ze verder niets kunnen doen. Hoe moeilijk kan het zijn om na te kijken waar dit geld heen is gegaan?Ik kan alleen maar waarschuwen voor deze bank: alles online, geen kantoren, kan functioneren. Maar dan moeten ze wel gewoon telefonisch of online support aanbieden en daar zijn ze niet toe in staat. Blijf dus ver weg van deze bank!", "Titel: voor wie volledig autonoom wil… Tekst: voor wie volledig autonoom wil bankieren en beleggen een goede keuze, vraagt wel wat knowhow ...", "Titel: De support in Belgie is rampzalig Tekst: De support in Belgie is rampzalig. Het was al erg voor de coronacrisis maar nu is het nog erger geworden. Er is maar 1 bankkantoor in Brussel, dus als jullie een online bank willen zijn moeten jullie ook wel bereikbaar zijn via telefoon en email + eventueel chat. Als je dan al contact krijgt zijn ze ook niet echt hulpvaardig, je krijgt antwoord op je vraag maar meer info of extra hulp zit er niet in.Zolang je geen vragen of problemen hebt valt het nog mee. Met hun visa rekening kan je wel niet overal betalen, regelmatig moet ik een kaart van een andere bank gebruiken. Ook bij amazon heb je problemen als je je visakaart bewaard hebt. Bij de betaling wordt het verificatiescherm niet getoond en dan wordt de betaling niet aanvaard.", "Titel: Ik kan niet blijven wachten Tekst: Heel, heel lang voor je mogelijks klant kan worden. Ik zet het stop en ga naar een andere bank.We moeten zelf constant contact opnemen, om te weten hoe het zit met ons dossier. Dan moeten we nog geluk hebben dat ze antwoorden.Ze hebben mijn pas al drie keer gekregen en toch krijg ik plots een antwoord, dat ze mijn pas nog niet hebben. Dit terwijl in een vorige mail, ze wel mijn pas hadden.Ik was al klant voor een persoonlijke rekening, maar onze gezamenlijke rekening gaan we toch elders zoeken.", "Titel: Ik probeer al maanden om in te loggen Tekst: Ik probeer al maanden om in te loggen. Er werd me een QR code gestuurd die niet werkt. Nu word ik opnieuw gevraagd dezelfde documenten in te vullen en per post te versturen!!!!!!!!", "Titel: Ramp! Tekst: Bestaat er een klantendienst? In elk geval onbereikbaar, geen antwoord op mijn mails! Bellen is een RAMP, uren zit je te wachten met een enerverend toontje! Na  x 12 proberen ' s avonds om 20 gelukt, hoera!", "Titel: Hoe klantonvriendelijk kan een bank wel… Tekst: Hoe klantonvriendelijk kan een bank wel zijn. Telkens ik opbel krijg ik het volgen bandje te horen: De wachttijden zijn langer dan normaal, onze excuus  hiervoor. En die wachttijden kunnen makkelijk oplopen naar 30 minuten. Na 2 maanden is mijn rekening nog altijd niet helemaal OK.", "Titel: Reeds een maand rekening willen openen Tekst: Reeds een maand rekening willen openen, nog steeds niks.....", "Titel: Lezen de aanvragen niet en reageren niet op klachten Tekst: Ik heb proberen een rekening te openen voor mijn minderjarige zoon. Na 2 maanden krijg ik als reactie dat een document, dat ik dadelijk overmaak. Nogmaals 2 maand later krijg ik een weigering omdat ikzelf al klant zou.Sinds augustus ben ik aan het wachten op een antwoord op mijn klacht.Onbegrijpelijk hoe deze bank zo is kunnen afglijden.", "Titel: Website is min of meer ok. Al de rest niet. Tekst: Website is wel ok, en bijna alles kan digitaal. Maar daar stopt het ook. Het duurt soms meer dan een week om antwoord te krijgen op een (dringende) mail en aan telefoon is de behulpzaamheid ook niet altijd wat het moet zijn. Als je al iemand te pakken krijgt, want soms heb je na een half uur wachtmuziek nog altijd niemand...Het rekeningsaldo klopt in veel gevallen niet (zogezegd volgende geld op de rekening volgens de website/app maar toch niet kunnen betalen in de winkel) wat mij toch een basisfunctie van een bank lijkt: kunnen zeggen hoeveel geld je hebt.Spijtig genoeg heb ik mijn pensioensparen daar dus kan moeilijk weg.", "Titel: Trekt op niets Tekst: Trekt op niets, kan zelfs niet traden", "Titel: keytrade verandert zonder enig overleg… Tekst: keytrade verandert zonder enig overleg hun \"look en feel\" ; niets terug te vinden, daardoor vrijdag blind aandelen verkocht, voortgaand op eigen historie.  Niets terug te vinden aan historie.  2 mails gestuurd, oa met vraag naar kosten om volledige portefeuille over te boeken naar andere bank.  Geen antwoord.  ondertussen via internet gezocht, zou rond de 42 eur zijn.  iemand ervaring met andere bank/broker die wel consistent is ?  denk nu aan mexem die uit de meeste vergelijkingen gunstig komt.", "Titel: Heb al verschillende e-mails gestuurd… Tekst: Heb al verschillende e-mails gestuurd naar Keytrade omdat ik niets meer terug vind echter zonder enig antwoord. Het is werkelijk een grote chaos. Portefeuille overzicht heb ik niet meer en handelen lukt ook niet meer. Een grote schande is dit. Dit moet zeer vlug goed komen anders stap ik met zekerheid over naar een andere bank.", "Titel: Absoluut rommel Tekst: Absoluut rommel. Geen antwoord op klachten, trading soms onmogelijk TE VERMIJDEN", "Titel: Nieuwe layout feedback Tekst: Nieuwe layout doorgevoerd maar het  resultaat is een grote chaos. De koers van twee van mijn aandelen aandelen veranderden gedurende twee dagen eenvoudig niet en gaven dus een foutieve koers aan ondanks een sterke koersdaling. Gelukkig heb ik dit opgemerkt en zo een groot verlies vermeden. Ik heb dit gemeld aan Keytrade, (na een enorme lange wachttijd) en ze hebben de vorige layout terug geplaatst, een enorme opluchting. Voor mij is het duidelijk, als de nieuwe layout, een complete chaos, terug ingevoerd wordt verlaat ik onmiddellijk Keytrade!", "Titel: keytrade vernieuwd??? Tekst: \"Wij zijn er klaar voor u ook \" niet dus het geheel trekt op niets vroeger was het duidelijk  nu is het chaos.een order ingeven lukt maa how annuleren kan niet de knop \"annulatie \" komt en verdwijnt  kan dus na zeven pogingen 1 van de 2 orders annuleren . het 2 de order werd dus uitgevoerd omdat het niet kon geannuleerd worden. heel het systeem rammelt en staat niet op punt.Het is een schande dat ze met een nieuwe versie op de markt durven komen die niet op punt staat.", "Titel: al meer dan een maand een rekening… Tekst: al meer dan een maand een rekening geopend op internet, nog altijd geen antwoord, probeer maar mailen of eens te bellen pfff uren wachten, begrijp niet dat ze de review niet zien, zou het beschamend vinden foei foei moetsen licentie afnemen", "Titel: Na 2 maanden nog steeds geen bankrekening... Tekst: Ik heb op 24 september een aanvraag gedaan om een bankrekening te openen voor mijn zoon die op 29 september 12 jaar zou worden. We zijn vandaag 22 november (bijna 2 maanden later) en na 15 tal mails nog steeds geen stap verder bij een rekening. Heb zonet mijn laatste mail gestuurd. Als ik deze week geen bankrekening heb, mogen ze het in hun gat steken.", "Titel: onmogelijk om nog maar een rekening te… Tekst: onmogelijk om nog maar een rekening te openen, zelfs met E-ID reader en alle stappen meermaals te volgen, geeft al geen goed gevoel voor de verder service...", "Titel: Een grap van een bank Tekst: Een grap van een bank, wegens goed hypotheek voorstel hier ingestapt. Doe dit niet! Na drie maanden heb ik nog steeds geen toegang tot mijn bankrekening waardoor de hypotheek betalen zeer moeilijk is natuurlijk. Klantendienst mag je overspoelen met mails, hulp komt er niet. Kortom, blijf hier weg van.", "Titel: nieuwe rekening openen Tekst: Een nieuwe rekening openen blijkt heel moeilijk te gaan.Alle documenten in orde. Na bijna 2 weken nog altijd niet in orde.Verschillende telefoontjes...\"geduld hebben\", is het enige wat ze van antwoord zijn.", "Titel: Ik ben al lang klant maar de service… Tekst: Ik ben al lang klant maar de service gedaald naar ongeveer 0,0.Ik heb redelijk goeie zaken gedaan op de beurs via Keytrade als broker maar heb al eens 30000€ verlies geleden omdat ik onnodig eerst een vragenlijst voor complexe producten moest invullen voor de aankoop van gewoon een rechtaan rechtoe aandeel op de Nasdaq! Nu laatst weer een farce. Ik sta al sind februari op de uitkijk om er weer eentje te kopen op de Nasdaq en de timing was perfect...maar dat was buiten Keytrade gerekend want ze bleken dit niet aan te bieden !!!??? ondertussen is er 8% winst aan mn neus voorbij gegaan (in 3 dagen en dat is geen zever). Het is een aandeel dat tijdens de gewone handelsuren verhandeld wordt. Ik heb 3 dagen geleden een mail gestuurd met een vraag hierover maar nog altijd geen antwoord gekregen. Ik lees hier wel meer verhalen dat ze Keytrade redelijk de mist in gaat. ...en valuta wisselen (dollar/euro) kost ook al een dag!!Ze hebben al veel geld verdiend aan klanten zoals ik maar daar komt een einde aan. Mijn effecten zal ik voortaan via Bolero verhandelen en Keytrade bank kan de p*t op.BLIJF VOOR EFFECTEN WEG VAN KEYTRADE BANK!", "Titel: Zeer behulpzaam Tekst: Geert Alderson van stock.transfers keytradebank en Test-Aankoop waren me zeer behulpzaam bij de moeizame overdracht van mijn port van Binck naar Keytrade.Eigen ervaring: bij problemen met banken en effectenmakelaars (EN: 'broker') moet men niet bij de pakken blijven zitten, van zijn hart geen moordkuil maken. Over Binck leest men tegenwoordig erge  verhalen. Er moeten vandaag de dag velen met gezondheidsproblemen rondlopen wegens onzekerheid en/of ergernis. Volgens dokter Vogel is ergernis zelfs de voornaamste oorzaak van een gekende slepende ziekte.Aanvulling.Vele banken hebben het blijkbaar moeilijk om het hoofd boven water te houden. Ze leefden immers traditioneel van het verschil tussen debet- en creditrente (de rentemarge). De gevolgen zijn dan ook besparingen en ontslagen. Binck zal honderden zeer ervaren personeelsleden aan de deur zetten (zie outline. /WjpNuf). Veel klachten zijn m.i. het gevolg van onkunde en/of onwil (dat laatste bij banken in moeilijkheden).Mijn raad: de zaak in het oog houden, stil zitten zo mogelijk en hopen op betere tijden (die lijken toch reeds aangebroken).", "Titel: Geduld loont Tekst: Deze internet bank omschrijf je het best als een 'low cost' bank. En zoals bij vele 'low cost' bedrijven is de service het pijnpunt. Als je éénmaal alle bancaire benodigdheden hebt, zoals gebruikersnaam en bankkaarten en geautoriseerd om in te loggen, enz ..., dan is deze bank zeker aan te raden. Maar ik geef toe: uw geduld word soms erg op proef gesteld. Als je alles op z'n beloop laat, kan het soms 1 maand of langer duren voor alles in orde is.Voordelen :- gratis bankrekeningen- gratis debietkaart- gratis kredietkaart (indien minimaal 12 verrichten per jaar)- 5 eurocent bonus voor iedere verrichting.- gebruiksvriendelijke interface.Nadelen: - de service. Ik beaam de vele negatieve reviews op deze en andere review-websites.- beursbeleggingen zijn niet de goedkoopste.- de app voor je mobiele telefoon of je tablet mankeert enkele basis bankfuncties zoals download van verrichten en uittreksels.- Geen (universele) ISTME inlog procedure.Hopelijk heb je iets aan mijn review.", "Titel: Ik had na wat dingen in te vullen… Tekst: Ik had na wat dingen in te vullen direct een rekening die ik direct kon gebruiken ook heb ik binnen de 2 weken mijn bankkaart en code gescheiden door een paar dagen ontvangen. Ook heb ik na 5 verrichtingen te doen (minimum van 1 euro) nog 50 euro welkomst geschenk op mijn rekening gehad dus voorlopig super positief..", "Titel: Nagenoeg onmogelijk om een rekening te openen Tekst: Ik heb 5 weken geleden een aanvraag ingediend om een gemeenschappelijke rekening te openen. Na een week krijg ik de vraag om extra documenten te ondertekenen, daarna 4 weken geen nieuws. Helpdesk gebeld (15 minuten wachttijd), waar iemand mij zei dat \"ze er mee bezig zijn\". Kon geen termijn geven tegen wanneer het dan in orde zou zijn.Ik ga deze namiddag gewoon naar een fysiek bankkantoor, waar ik na 30 minuten buitenwandel met een rekening.Voor een internet-bank is goede en snelle hulpverlening onontbeerlijk, en dit is helaas zwaar ondermaats bij Keytrade.", "Titel: Ik lees hier telkens dezelfde klachten Tekst: Ik lees hier telkens dezelfde klachten. Ik probeer al een half jaar mijn oude rekening te openen. Telefoneren heeft geen zin want niemand neemt op. Nog nooit meegemaakt dat een bank zo amateuristisch tewerkgaat anno 2021. Absoluut geen aanrader om nieuwe klant te worden ...", "Titel: Slechtste bank aller tijden. Tekst: Geld dat op een geblokkeerde rekening staat na een overlijden wordt niet vrijgegeven. We zijn ondertussen 6 maand verder. Een nieuwe rekening openen lukt ook niet, maar dat geeft niet, want ik moet ze niet meer hebben. Klantendienst reageert zeer traag en naast de kwestie. Zeer amateuristisch en gewoonweg diefstal. Waarom bestaat deze bank nog?", "Titel: Zeer lang klant Tekst: Zeer lang klant, maar nu komt er een vraag wie de begunstigde is en dan nog een kopie van de pas van de tweede begunstigde en sluiten ze inmiddels de zakelijke rekening ??? nog nooit meegemaakt", "Titel: Deze bank sluit gewoon een zakelijke… Tekst: Deze bank sluit gewoon een zakelijke rekening / halen ze weg ? Terwijl alle gegevens zijn ingediend👎 Wegblijven", "Titel: Als je eens graag met je voeten wil laten spelen..... Tekst: Op 28 Juni gevraagd om mijn bestaande rekening terug open te zetten, vandaag 30 Augustus nog steeds niets gebeurt, al 10 x Helpdesk gebeld 13 documenten doorgestuurd en nog steeds niks. Wel ze mogen de rekening steken waar de zon nooit schijnt, wat een kl...bank is dit geworden, blijf er gewoon weg. Ik zoek wel een andere oplossing", "Titel: Rotslechte klantendienst en gratis visakaart is helaas een fabeltje Tekst: Ik wou overstappen van bank voor zowel investing en zowel voor mezelf, mijn man als kinderen. Als je als nieuw klant een aanvraag doet voor de (gratis) visakaart mag je eerst 2 weken wachten voor je een antwoord krijgt.  Vervolgens krijg je 1 zinnetje uitleg:  'je aanvraag werd geweigerd'.  Geen uitleg.  Via de klantendienst vraag je de voorwaarden aan.  Ik denk dat ik aan al deze voorwaarden voldoe.  Helaas wou men me niet vertellen waarom mijn dossier niet goedgekeurd werd.Niet klantgericht,  lang wachten, ... teleurstellend.", "Titel: Omslachtige manier van werken en slechte service. Tekst: Interessante rentes voor hypothecaire kredieten, maar voor dagelijks bankieren zou ik hier NOOIT klant worden. Extreem omslachtige manieren van werken en aanmelden.  Ik wacht al twee weken op een nieuwe inlogcode. Telefonische helpdesk is puur tijdverlies.", "Titel: Antwoorden op geen enkele mail Tekst: Na het overlijden van onze opa al een maand aan het wachten op deze bank om te weten te komen of er nog openstaande rekeningen op zijn naam zijn.Al sinds 15 juli worden onze mails volledig genegeerd. Telefonisch nemen ze ook niet op. Ik zou hier nooit een rekening openen (dat is ook te zien aan de andere reviews).", "Titel: Zeer hevige nalatigheid bij… Tekst: Zeer hevige nalatigheid bij successiedossier. Dossier laten liggen tot laatste week. Na afronding successie vertikken ze het om rekeningen vrij te geven. Mijn inziens is dit een criminele organisatie. Bank onwaardig. Personen aan de telefoon kunnen u niet doorverwijzen naar juiste afdeling, ondanks eerder keuzemenu. Blijf zo ver mogelijk weg van deze instelling. Echt maffia en onprofessioneel.", "Titel: Klantendienst is onvriendelijk en bij… Tekst: Klantendienst is onvriendelijk en bij het openen van een rekening krijg ik de melding \"Vanwege de huidige situatie verwerken we daarom geen aanvragen meer voor het openen van rekeningen voor rechtspersonen. U kunt in september opnieuw contact met ons opnemen om meer te weten te komen over het actualiseren van onze beslissingen met betrekking tot de opening van bedrijven.\".  Wat moet ik daar onder verstaan?????", "Titel: Nu al enkele maanden problemen met de… Tekst: Nu al enkele maanden problemen met de visa kaart. Op mails krijg je geen antwoord en als je dan opbelt idd (zoals hier al vele malen vermeld)moet je nog 15 minuten minimum luisteren naar en veel te luid irritant muziek.Kreeg ik een zeker Frederick aan de lijn die alles behalve vriendelijk was, en nog zei de volgende keer onmiddellijk u kaart activeren wat ik trouwens gedaan had. Maar ja ik mocht blijkbaar niks zeggen , want meneer kon anders niet volgen, zette hij me dan maar terug in wacht! Jammer dat er tal van beleggingen en zo daar lopen want anders was ik naar de concurrent.Dan had  ik ook een vraag betreffende mijn man en kreeg ik gewoon dan belt hij zelf mevr.Vraag ik,me af wanneer, hij werkt tot 17 u en kan moeilijk op zijn werk 30 min aan de telefoon hangen enkel om een nieuwe Hardkey te vragenHulp is echt ondermaatsHopelijk doen ze eens iets met al die reviews want het regent klachten", "Titel: produkten ok, dienstverlening 0% Tekst: Noodgedwongen ben ik door Rabobank overgegeven aan Keytrade en dan meer bepaald voor het pensioensparen.  Die overgang is vlot verlopen.  Automatisch werd ook een betaalrekening en spaarrekening geopend, echter alles gratis.  Gezien deze diensten dan toch gratis waren en er bovenop nog eens 5 cent werd betaald per overschrijving, ben ik stilaan de betaalrekening beginnen te gebruiken.  Gezien alles vlot verliep, ben ik bijna volledig overgeschakeld naar Keytrade.  Tot zij vorig jaar in juli hun platform hebben vernieuwd.  Plots kon ik geen overschrijvingen meer doen.  Na een 10-tal e-mails en telefoons naar de klantendienst, hebben ze dan toegegeven dat er een probleem was met het platform maar dit zou zo vlug mogelijk opgelost worden.  In januari dit jaar (6 maand later) kreeg ik dan plots een telefoontje met de mededeling dat ik teruggezet werd naar het oude platform zodat ik eindelijk terug aan mijn centen kon.  Gedurende die periode kon ik wel gratis via e-mail overschrijvingen doorgeven zodat ik toch niet helemaal berooid bleef zitten.  Ik had ondertussen ook een manier gevonden om toch overschrijvingen te doen door alles eerst in een word document te typen en dan gegeven per gegeven te kopiëren in hun website.  Nog enkele maanden later, ondervond ik plotseling dat ik terug op het nieuwe platform zat.  Deze keer kon ik deze wel normaal gebruiken.  Wat nu het nieuwe platform betreft, dit is al beter dan het oude, maar moet qua gebruiksgemak wel onderdoen voor het platform van andere banken.In april dit jaar ontdek ik dat de eindbelasting op mijn pensioensparen werd afgehouden.  Bij nazicht stel ik vast dat Keytrade een fout in de berekening heeft gedaan.  Zo ongeveer 20 e-mails/telefoons later, waarin ik met hand en tand uitleg wat er fout is gegaan, meldt een zeer onwillige dame dat er inderdaad te veel belastingen werden afgehouden.  Gezien dit bedrag reeds werd doorgestuurd naar de belastingen, moest ik dat bedrag maar zelf terugvorderen bij de belastingdienst!  Uiteindelijk na sterk aandringen van mezelf en e-mails naar ongeveer alle afdelingen van Keytrade, hebben zij dan zelf de fout rechtgezet.  Ik kan me voorstellen dat iemand die iets minder stevig in de schoenen staat, dit over zich laat gaan en derhalve zijn geld kwijt is want een rechtzetting door de belastingsdienst is onmogelijk.  Hieruit blijkt dat de klantendienst van deze bank beneden alle peil is en dat er fouten bij de vleet worden gemaakt.  Een internetbank waar je gedurende 6 maand geen (of heel moeilijk) online verrichtingen kan doen is te gek voor woorden.En ja, ik ben nog steeds klant omwille van de gratis rekening/verrichtingen/debet- en creditkaarten.  Blijkbaar is er ook veel commenteer over hun hoge prijzen ivm beursverrichtingen, maar deze liggen ook een pak lager dan wat ik voorheen bij Belfius betaalde.", "Titel: Geen antwoorden op émails…geen telefoons beantwoorden Tekst: Geen antwoorden op émails info at keytrabank.com en ook niet op legal at keytradebank.comOok verschillende keren getelefoneerd, druk nr zoveel -druk nr zoveel, muziek een lange tijd, dan ineens afgebroken, geen personeel dat aan de telefoon komt.  Het heeft me geld gekost aan telefoonkosten, zonder iemand aan de lijn te hebben  En daar sta je dan.  Hoe moet men hen bereiken ? Was al een hele week hen proberen te bereiken.Om 16u  sluit de bank, kun je hen ook niet meer  bereiken telefonischBen heel ontevreden  0/10  voor support naar de klantGeld zal  naar andere bank gaan, die  hulp geven aan de klant en bereikbaar zijn", "Titel: Erbarmelijk voor een bank Tekst: Erbarmelijk voor een bank, zeer onbetrouwbaar.", "Titel: Fouten bij de vleet door ettelijke… Tekst: Fouten bij de vleet door ettelijke incompetente medewerkers. Gouden tip: Bellen en blijven bellen tot je eens een intelligent persoon aan de lijn krijgt welke uw problemen, waar je al maanden mee kampt, in enkele kliks oplost. Of blijven bellen tot iemand u correcte en bruikbare info geeft. Een ware schande is het. Men begint met ettelijke irrelevante en idiote vragen. Ze hebben enkel als doel dat je niet zou kunnen antwoorden! Vragen die ik allemaal kreeg. Welke waren uw 2 laatste verrichtingen, naar wie was dat en wat waren de bedragen? Wat is het saldo op je zichtrekening. Wanneer heb je  de rekening geopend (Jaartal/maand) weet jij na >10 jaar daar nog op te antwoorden? Van waar kwam het geld van uw eerste verrichting. Hoeveel was dat bedrag toen?  Eigenlijk willen ze u niet helpen en ze blijven doorvragen totdat je niet kan antwoorden. En dan zeggen ze dat ze twijfelen of jij de rechtmatige eigenaar bent. Compleet zotte bankinstelling! Dit fenomeen is nu bijna één jaar bezig. Vroeger ging alles vlot en dan werd je effectief geholpen. Nu is dat een droom om geholpen te worden", "Titel: Een nieuw rekening nr aanvragen duurt… Tekst: Een nieuw rekening nr aanvragen duurt al meer of 10 dagen, ik start als zelfstandige volgende maandag.  Ik kan niks in orde brengen!! (liantis, tankkaart, boekhouder,....)Als je belt, word je van kastje naar de muur gestuurd.  En geven ze gewoon doodleuk door dat ze niet kunnen zeggen wanneer,want het is druk...Idem, vraag over ons hypothecair krediet.  Word je 3 x !!! doorgestuurd, terwijl je al preselectie hebt moeten maken.  Al half uur aan de lijn, nog steeds geen antwoord!", "Titel: Het aanmaken van een individuele… Tekst: Het aanmaken van een individuele rekening is gelukt na enkele pogingen.", "Titel: Bijna volledige autonomie op vlak van… Tekst: Bijna volledige autonomie op vlak van bankieren.", "Titel: Was een super bank Tekst: Was een super bank. Rekening snel geopend. Vele jaren klant. In de tijden dat er amper gratis rekeningen waren, waren zij degene die je zelfs ervoor betaalden een te nemen bij hun. Klantendienst was uitstekend: snelle reactie en snel opgelost. De laatste tijd: - trage reactie en dan met een antwoord dat totaal niets met mijn vraag te maken heeft- vaak moet ik herinneringen sturen voor ze eindelijk reageren- zeggen dat ze iets opgelost hebben om dan te merken dat het niet opgelost is- trage website en functionaliteit dat niet altijd werkt (en dat voor een internet bank!)- rekening voor mijn vennootschap proberen openen... het heeft maanden geduurd! Inclusief vele herinneringen en telefoontjes (omdat mijn geduld op was heb ik op in de tussentijd hetzelfde bij een andere bank gedaan en dit was op 2 dagen in orde)Vroeger raadde ik de bank bij iedereen aan, nu niet meer. Of je er van weg wil blijven moet je zelf zien. Een fatsoenlijke klantendienst kom je nergens meer tegen (ook bij niet-banken)  heb ik gemerkt. Dus ik zou gaan voor de minst slechte (van het moment).", "Titel: fluiten naar promo + onbeleefde helpdesk Tekst: Tot 31/3/21 loopt er een promo voor keyplan : \"ontvang 30 euro in uw keyplan\". Ik heb na een week knoeien eindelijk toegang tot mijn dashboard, maar ik heb blijkbaar een gemeenschappelijke rekening geopend. Daarmee kan je geen begunstigde koppelen aan een keyplan. Ik kan hiermee geen keyplan voor mijn kinderen openen. Ik moet eerst een nieuwe individuele zichtrekening openen, maar die krijg ik nooit tijdig meer in orde. De helpdesk gebeld. Nog nooit zo'n onbeleefde helpdesk aan de lijn gehad. Heb de eerste keer het contact verbroken omdat de dame zo onbeleefd werd. 2de keer teruggebeld, ik probeer het gesprek aan te gaan, maar wordt herhaaldelijk brutaal onderbroken : \"naam, voornaam ? VOORNAAM ?!, geboortedatum, ... \" precies alsof ik op een beklaagdenbank zit.Conclusie : ik kan wellicht fluiten naar de promo, ook al resteren er nog 2 dagen....", "Titel: Heel tevreden klant ! Tekst: Heel tevreden klant !Vooral het automatische en het feit dat alles heel vlot aanpasbaar is, maken het voor mij een zeer goed product.Ondertussen hebben ook al verschillende familieleden een Keyplan, en ook zij zijn er heel tevreden over. Vooral omdat er geen omkijks naar is.Meestal kiezen we voor a-la-carte, maar 1 Keyplan gaat over de defensieve samenstelling.", "Titel: Reeds langer dan 20 jaar klant... Tekst: Na reeds langer dan 20 jaar klant te zijn, gooi ik nu ook de handdoek in de ring. Klantendienst inderdaad onbereikbaar - noch via mail - noch telefonisch en dat voor het afhandelen van een simpele administratieve opdracht.In \"goede\" tijden nog wel... dan stel ik mij de vraag hoe bereikbaar ze zijn in tijden van crisis... Bank onwaardig !", "Titel: Rekening werd in het Frans geopend ipv Nederlands, herhaaldelijk voor gebeld en gemaild, niemand kan of wil dat aanpassen. Tekst: Geen aanrader, support dikke nul!", "Titel: als er problemen zijn met Keytrade Tekst: als er problemen zijn met Keytrade, hard key geblokkeerd, nieuwe debetkaart, app per toeval verwijderd, om dan terug app en debetkaart ebn hard key terug te kunnen installeren heb je veel geduld en geluk nodig, telefonisch krijg je verschillende antwoorden.", "Titel: overbruggingskrediet Tekst: Doe al mijn bankverrichtingen bij deze bank, tot op heden geen problemen. Heb vorige week een simulatie gemaakt voor een overbruggingskrediet dit lukte mij niet, problemen met mijn ouderdom. Dan maar met een mail om enig antwoord gevraagd, kreeg enkel als antwoord als het niet met de simulatie gaat dan gaat het niet. Spijtig had toch een beetje meer verwacht.", "Titel: Nul, Komma NUL Tekst: Ongelofelijk maar toch waar. Absoluut te mijden !Hallo iedereen. Ik stuurde reeds op 18 januari mijn mening over deze knoeiboel die de naam “bank” onwaardig is . Op 19 januari deed ik al het nodige om de rekeningen stop te zetten. Ongelofelijk dat deze knoeiers er zelfs na 1 maand niet in geslaagd zijn om deze rekening af te sluiten!!!", "Titel: Mijn slechtste online ervaring ooit Tekst: Ik koop zeer veel op internet en ik doe al mijn financiele verrichtingen via internet, maar wat ik met Keytrade heb meegemaakt is gewoon het ergste wat ik ooit ervaren heb. Ik heb geprobeerd een rekening te openen en dat begint met een website, die alles behalve eenvoudig te gebruiken is. Uiteindelijk toch gelukt, maar dat is pas het begin van de miserie. Na 2 maanden nog steeds geen rekening. Na verschillende mails blijkt mijn dossier verloren te zijn, 1 week later is het plots onvolledig. Telefoneren heeft geen enkel nut: eindeloos wachten en luisteren naar keiharde, domme muzie. Uiteindelijk heb ik het opgegeven. Als een rekening afsluiten al zo moeilijk, wat wordt het dan als ik ooit problemen heb? Het gaat tenslotte over mijn zuurverdiende centjes.", "Titel: Mijn ervaring met Keytrade bank is een… Tekst: Mijn ervaring met Keytrade bank is een van de slechtste ooit.Omdat ik interesse heb in de Visa Gold van Keytrade Bank, vraag ik welke ongeveer de voorwaarden zijn.Een rekening openen en 1000 euro tijdelijk op die rekening zetten.Na een lange periode is eindelijk mijn zichtrekening in orde en dat komt het absurde antwoord van Keytrade : de aanvraag van de Visa Gold wordt geweigerd.Eerst aan het lijntje houden en dan afwijzen zonder motivatie.  Ik heb al 3 keren gevraagd waarom de kaart wordt geweigerd maar geen reactie.Misschien naam veranderen in Messtrade Bank.", "Titel: Ik vertrek er banknaam “onwaardig” Tekst: Wordt er alstublief geen klant!!Je kan ineens niet meer betalen in de winkel wegens “saldo ontoereikend” nochtans stond er meer dan voldoende geld op die rekening en dat is me al meermaals overkomen.(gewoon gênant).Trouwens geoorloofde debitstand kan je ook aanvragen maar dat geraakt nooit in orde. Ze zeggen wel dat ze alles goed ontvangen hebben maar daar stopt het dan!!! Ik haal alles er weg.Ps aan beursverrichtingen betaal je je blauw!!BENDE AMATEURS", "Titel: Vreselijk Tekst: Eigenlijk had ik liever nul sterren gegeven. Sinds mijn moeder in november overleden is, zijn alle rekeningen van mijn vader geblokkeerd en verzuimt Keytrade Bank contact op te nemen met hem of één van de kinderen om de rekeningen te deblokkeren. Omdat het al zo lang aansleept, heb ik vorige week zelf maar getelefoneerd en de persoon die ik aan de lijn had, ging alles zo spoedig mogelijk doorgeven aan de dienst nalatenschap, die mij op haar beurt zeker begin deze week iets zou laten weten. Het is nu donderdag, maar nog steeds geen taal noch teken van betreffende dienst. Ik heb dan zelf maar teruggebeld en ik kreeg een heel onbeleefde medewerker, een zekere Philippe Brusselaars of zoiets, aan de lijn die gebrekkig Nederlands sprak. Ik moest mijn naam dan ook verschillende keren herhalen en telkens verstond hij het verkeerd. Toen hij het dossier ging opzoeken, beweerde hij dat hij geen gegevens van mijn gesprek van vorige week terugvond en dat dit zou komen, omdat ik telkens een andere naam gebruik!?! Hij liet mij ook niet uitpraten en riep steeds boven mij uit. Ook weigerde hij om mij door te verbinden met de dienst nalatenschap, maar scheepte hij me af met de mededeling dat hij alles zo spoedig mogelijk ging doorgeven aan deze dienst. Toen ik hem wilde duidelijk maken dat dit mij vorige week ook werd beloofd, heeft hij gewoon de verbinding verbroken! Wat nu??", "Titel: Waardeloos ! Blijf er weg ! Tekst: Wegens aankoop appartement met alle nodige documenten aan Keytrade gevraagd om het geld van mijn  spaarrekening over te boeken naar mijn zichtrekening bij andere bank.   Eerst doen ze alsof ze de papieren niet gekregen hebben, dan hebben ze ze ineens wel en gaan ze zogezegd voor mij aan de slag, maar resultaat NUL.  Wat is eigenlijk hun bedoeling ?  Wat winnen ze daarmee ? En hoe en wanneer krijg ik mijn geld ? Ik wacht al praktisch drie weken en krijg zelfs geen reactie of ontvangstbevestiging meer op mijn herinneringen of herhaalde vragen.   Zo stilaan begin ik mij af te vragen wat daar achter zit.   Nooit zou ik deze bank aanraden en nooit zet ik er nog één euro op.", "Titel: Ik sluit aan bij vorige commentaren Tekst: Ik sluit aan bij vorige commentaren.  Problemen raken niet opgelost.  Mails worden niet beantwoord.  De helpdesk (na 10 min wachten) noteert het probleem en belooft door te geven, maar erna is het vaak erg stil.  De dienst \"stock transfers\" is volgens onze ervaring de enige dienst die werkt zoals het hoort.  Elke klant dient fatsoenlijk behandeld te worden, maar hoe wij - nochtans met een fiks bedrag - behandeld worden getuigt van weinig respect voor de klant. Ik geef het momenteel op en zal mondjesmaat vertrekken.", "Titel: Beleggen Keytrade Tekst: Als je gaat beleggen, doe dit ALSTUBLIEFT bij een andere bank dan Keytrade. De klantenservice is zeer slecht; ze nemen niet of na enorm lang pas op. De transactiekosten zijn zeer hoog en de app loopt heel de tijd vast.", "Titel: Terugboeken heel omslachtig Tekst: Heel omslachtig om iemand die een betaling heeft gedaan het bedrag terug te boeken.Je moet namelijk eerst manueel (ook copieren/plakken gaat niet) zijn profiel aanmaken, verplicht met adres, bic, enzVoor een buitenlandse rekening moet je trouwens eerst nog gaan googlen wat die bic code is..Waarom hebben ze IBAN ingevoerd ?!En terwijl je alles aan het invullen bent wordt je zonder melding uitgelogd. Mag je opnieuw beginnen.. maar dan sneller!", "Titel: Ze doen alles om de customer service zo… Tekst: Ze doen alles om de customer service zo slecht mogelijk te maken, ik verwissel van bank want dit is niet nuttig voor mijZe zijn ook uitzonderlijk duur, ik raad deze bank alles behalve aan", "Titel: Zeer tevreden Tekst: Zeer tevreden over. Gratis rekening, gratis visa, krijgt vergoeding overschrijvingen, ... top dus.", "Titel: WEES GEWAARSCHUWD Tekst: Inlog kwijt en na 14 dagen nog steeds geen nieuwe inlog ondanks dat ik het juiste doc en id heb verzondenMet alles wat je moet doen online werkt het vaak niet en moet je bellen omdat ze op mails gewoonweg niet reageren en die weten dan ook weer niks", "Titel: Onbetrouwbare dienstverlening Tekst: Ik was reeds klant bij keytrade van de beginjaren '00, maar sinds kort niet meer. De 'know your customer' afdeling heeft beslist om een internationale overschrijving te blokkeren, omdat deze verdacht vonden. Ik begrijp dat dit een noodzakelijk kwaad is, maar ze lieten hierbij meerdere dagen passeren, eerst om mij te contacteren en daarna om mijn antwoord te lezen. Terwijl tikte de klok wel verder. Deze keer is het gelukkig goed afgelopen, maar wanneer ik voor een cliënt taksen in het buitenland moet betalen, dan kan een laattijdige betaling rampzalige gevolgen hebben. Wanneer een cliënt de rechten op een patent verliest in het buitenland, dan kan ik aansprakelijk gesteld worden voor de geleden schade, wat een bedrag met vele nullen kan zijn. Daarenboven heb ik niet eens een verontschuldiging ontvangen, maar een vriendelijke uitnodiging om niet te lang te wachten met het afsluiten van mijn rekeningen. Ik zou de mensen van de Keytrade KYC willen uitnodigen om eens na te denken over de betekenis van Customer, of, indien dat te moeilijk is, hun dienst te herdopen naar Know Your Trash.", "Titel: Klant bij Keytrade sinds 20 jaar Tekst: Klant bij Keytrade sinds 20 jaar, nog voor het Keytradebank werd. Altijd superbank gevonden met superservice, bereikbaar tot 22u, alles werd met post verstuurd en alles kon via email geregeld worden. Mijn vrouw, haar vennootschap, mijn 3 kinderen en mijn moeder klant gemaakt. Dan de overnames ... De problemen zijn een 2 tal jaar geleden begonnen, denk ik, met een moeilijk te bereiken klantendienst. Maar, geen probleem, ik ging ervan uit dat dit een tijdelijk probleem was met al die overnames die gebeurd zijn. Maar nee, het ging van kwaad naar erger. Ik probeerde een rekening te openen voor een vennootschap die ik pas opgericht had, dus netjes alle documenten opgestuurd met de nodige stukken. Na een 6-tal weken neem ik contact op met de klantendienst om te zien of alles in order is met de aanvraag en daar vertelt me mij doodleuk dat de aanvraag niet goedgekeurd werd! Ik zeg, euh, ik ben al zolang (goede) klant en nu vertellen jullie mij dat de aanvraag niet goedgekeurd werd? Zonder mij daarvan in te lichten? Dus ik vraag wat de reden dan wel mag zijn en daarop antwoordt men mij dat daar niet over gecommuniceerd wordt! Nu lijkt mijn VISA kaart niet te werken, heb een dringende vraag ivm met logon en nog een aantal vragen maar ze blijven onbereikbaar. Al 3 werkdagen na mekaar probeer ik de klantendienst te bereiken maar dat blijkt gewoon onmogelijk. Niet in het Nederlands, niet in het Frans, enkel het irriterende Michael Jackson muziekje en na een tijdje stopt het. Zonder overdrijven, 10x na elkaar, niemand aan de lijn gekregen na zolang te wachten en het vervelend muziekje te trotseren. Dit tart alle verbeelding, ik weet niet wat daar aan de hand is, maar dit kan onmogelijk blijven duren. Ik kijk alvast uit voor een alternatief.", "Titel: Sedert 17/11/2020 met de nodige stukken… Tekst: Sedert 17/11/2020 met de nodige stukken gevraagd om de rekening af te sluiten en het saldo over te maken.Na drie herinneringen nog altijd geen resultaat!", "Titel: Heel slechte ervaring met deze bank. Tekst: Heel slechte ervaring met deze bank.Inloggen lukt niet, e-mail wordt niet beantwoord, telefoon wordt nooit opgenomen...Deze bank heeft bij ons afgedaan!", "Titel: Alles remote, super service. Tekst: Ik ben al een tijd klant bij Keytrade Bank. Voor mij is dit echt de ideale bank :) Voor niks meer naar een kantoor moeten hollen (dat vaak onmogelijke openingsuren heeft voor mensen die werken). Medewerkers die ook in de avond nog klaar staan om te helpen. Probleem met mijn (gratis) kredietkaart ? Ik bel of mail en binnen de dag heb ik antwoord en/of een oplossing!  Ook bij problemen met een online handelaar (wou betaling met kredietkaart niet correct terugbetalen) hebben ze mij recentelijk kunnen helpen/voor mij kunnen bemiddelen. Echt topservice! De lening voor mijn huis heb ik hier destijds ook kunnen afsluiten aan voorwaarden die ik nergens anders kon krijgen. Ik ben zeker niet de grootste klant voor Keytrade (grote financiële middelen heb ik niet) maar ik heb steeds het gevoel dat ik gewaardeerd word als klant, en dat mijn  vragen snel en serieus behandeld worden. Bedankt, en doe zo verder!", "Titel: Proberen inloggen  terwijl ik mijn… Tekst: Proberen inloggen  terwijl ik mijn gegevens voor mijn neus heb en nog altijd niet lukken,  er is geld opgekomen en geraak er niet in, ik ga overal  mijn rekening  veranderen  dat er geen geld meer opkomt, ald ik er niet aan geraak jullie ook niet salut", "Titel: Keytradebank Tekst: KeytradebankBen al jaaaaaren klant bij deze bank en gebruik al mijn rekeningen vrij intensief. Nog nooit noemenswaardige problemen gehad. Als je belt, kan het wat (te) lang duren voor je iemand aan de lijn krijgt, maar steeds vriendelijk geholpen geweest. Ik kan geen kwaad woord zeggen van deze internetbank.Ideaal platform om aandelen te kopen en te verkopen.", "Titel: Waardeloos Tekst: Beste, indien mensen vragen om een rekening af te sluiten dan hoeft dat geen maanden te duren. Er zaten kopies van de ID bij, ondertekend op datum verzonden via mail en post. Ook de aanvraag van een krediet op de zichtrekening hoeft geen maanden te duren. Jullie negeren COMPLEET de klanten. Je moet smeken, bidden of eerder dromen dat er beweging komt... Zoals de nieuwe slogan het zegt... wacht geen jaren om te veranderen... (Want Keytrade zal u nog jaren laten wachten...)", "Titel: Zeer klantvriendelijke bank Tekst: Zeer klantvriendelijke bank. Enorm veel problemen om rekeningen na overlijden van mijn vader te deblokkeren. Zeven (!) maanden nadien nog niet in orde. Geen antwoord via telefoon of mail. BLIJF ER WEG!!", "Titel: zeder ontevreeden Tekst: zeer ontevreden kan sinskort nergens meer online betalen. als ik geld naar iemand overschrijf duurt het altijd 2 dagen zonder wiekend mee gerekend anders is het 4 dagen. de bank gaat alleen achteruit plaats van vooruit.", "Titel: klantenservice is onbereikbaar. geen reactie op ongeoorloofde transactie Tekst: klantenservice is onbereikbaar.Vorige week hebben ze een effect aangekocht waarvoor ik geen opdracht heb gegeven. Dit kan niet door de beugel voor een bank: neem hun banklicentie maar zo vlug mogelijk af.", "Titel: Gebeurd niets met aanvraag. Tekst: Paar maanden geleden bankkaart aangevraagd, alle documenten in orde gebracht via mail. Tot op heden nog geen bankkaart gezien noch de 50€ die erbij zou komen volgens hun welgedeelde actie op tv etc. Te belachelijk voor woorden..", "Titel: Reeds drie maanden aan het wachten Tekst: In september gemeenschappelijke rekening proberen te openen bij deze bank met een niet bestaande klantenservice. Midden november is \"het dossier nog lopende\". I mean, seriously?Genoeg is bij deze genoeg. Dag, bedankt en tot nooit meer.", "Titel: Nog geen slechte ervaringen gehad Tekst: Nog geen slechte ervaringen gehad met deze internetbank. De klantendienst is zeer vriendelijk en steeds telefonisch te bereiken. Email-verkeer verloopt iets trager, maar dat heb je nu eenmaal bijna alles via email verloopt. Bankoverschrijvingen duren gemiddeld een werkdag, wat niet onoverkomelijk is. Verder werkt de app en de webapplicatie zeer goed.", "Titel: Probeer reeds van half mei onze… Tekst: Probeer reeds van half mei onze (spaar)rekeningen af te sluiten en het saldo over te schrijven naar onze rekening bij BNPPARISBASFORTIS. Per post en digitaal alle nodige documenten doorgestuurd. Tot nu geen reactie. Eigenlijk SCHANDALIG ! We zullen via onze advocaat proberen om het nodige te doen !", "Titel: Heel tevreden over Keytrade Bank Tekst: Heel tevreden over Keytrade Bank. Bij problemen werd ik geholpen, misschien soms wat traag, maar het resultaat is goed. Tot nu toe nog geen ernstige problemen gehadIk kan niets verkeerds zeggen over de bank. Alles verloopt vlot en zonder problemen, ook met de kaarten (debet en visakaarten). Doe zo verder en verbeter de algemene prestaties. Keytrade Bank is een makkelijke en toegankelijke online-bank voor iedereen, met duidelijke richtlijnen!", "Titel: Mijn moeder overleed in april aan een… Tekst: Mijn moeder overleed in april aan een besmetting met covid 19. Ze had nog wat spaarcenten opzij staan bij Key trade bank. Wij hebben ondertussen alle nodige aangiften gedaan, documenten, attesten en handtekeningen bezorgd, zowel per mail als per post, maar we geraken niet aan onze nalatenschap. Bellen helpt ook niet, want dan krijg je één of ander wicht van een call center aan de lijn die het in Keulen hoort donderen. Weet er iemand wat we nog kunnen doen om aan onze centen te geraken?", "Titel: Investeer in klantendienst! Tekst: Nu reeds enkele jaren (gedwongen) klant bij Keytrade. Over de online banking geen klagen. Beleggen gaat vlot, app werkt naar behoren. De klantendienst wordt geleid door politici. Nog nooit een duidelijk antwoord gekregen op mijn vragen. Vaak totaal naast de kwestie. Moeten overstappen omdat rabobank.be zijn beleggingen stop zette. Misschien was het personeel beter mee overgestapt met mijn rekeningen. Voor een online bank verwacht ik performante aanpak online service.", "Titel: Goede bank behalve klantenservice Tekst: Goede bank ben er wel tevreden over.Maar aan de klantenservice kan wel gewerkt worden.", "Titel: Dit is geen bank Tekst: Veel beloven en ....Met een gratis VISA kaart lokken ze klanten.Vraag je na het openen van een rekening deze kaart aan, dan krijg je volgend bericht:'Na analyse van uw dossier kunnen wij er niet op ingaan'Ongelooflijk en verder geen uitleg.Dit is zelfs onwettelijk.Blijf weg van deze arrogante illegalen.", "Titel: Zeer slechte service. Tekst: Zeer slechte service.Wat een mooie start als beginnend belegger zou moeten geweest zijn is door Keytrade Bank uitgedraaid op een teleurstelling.Zowel de communicatie intern als de communicatie met de klanten is zeer slecht.Na problemen rond mijn aanmelding (contract) bij deze online bank nam ik contact op met de klantenservice.Ik som hier graag enkele voorbeelden op van dingen die te wensen overlaten:- klantenservice neemt na 18 minuten in wacht op en antwoordt niet zodat de klant willekeurige geluiden hoort- klantenservice geeft intern geen informatie door naar administratie waardoor de klant nog langer moet wachten- klantenservice \"escaleert\" jouw account om het zo voorrang te geven tot 7x en nog steeds gebeurt er niets-...Ik zou nog uren kunnen verder schrijven over wat allemaal zo slecht is aan deze service.Hoe kan het zijn dat een instelling dat zich assimileert met zulke zaken, zo een slechte service voorzien?", "Titel: Service kent men niet... Tekst: Deze bank heeft het woord 'service' nog niet gevonden in het woordenboek. Ook een totaal gebrek aan communicatie. Betreurenswaardig...", "Titel: Een mooie etalage maar de deur is dicht! Tekst: We zijn al jaren tevreden klant bij Keytrade.Nu proberen we een professionele rekening te openen voor een nevenactiviteit van mijn echtgenote.Helaas na 3 keer bellen en mails van onze kant hebben we nog geen enkele reactie gehad behalve dat ze er mee bezig zijn.Ongelooflijk dat dit nog kan in deze tijden.", "Titel: Keytrade bank.uiterst onbetrouwbaar en… Tekst: Keytrade bank.uiterst onbetrouwbaar en onbeschoft. Toen mijn rekeningen overgingen door overname tussen cortal,fortuneo en nu keytradebank kom ik ongewild in een internetbank terecht die absoluut onbetriuwbaar is. Een klantendienst die er alleen is om ge zeggen dat ze er mee bezig zijn maar niet kunnen zeggen wie en wanneer je zaak gaat oplossen.Ik ben van 8 februari 2020 aan het proberen om 2 rekeningen af te sluiten en naar Fortis over te schrijven. Telkens moet ik geduld oefenen aldus de sukkelaars die wellicht slecht betaald op de klantendienst de klachten moeten aanhoren.Je betaalt niets maar je krijgt ook niets, ook al heb je er niet voor gekozen.Waardeloze bank die lekker anomiem doet waar ze zin in heeft en wellicht hoge nalatigheidsinteresten aanrekent als jij zelf niet tijdig reageert.Een schande en geen bank waardig.Ik heb mijn held nig steeds niet op lijn rekening.Zoek een andere bank waar ze service bieden.", "Titel: Keytrade verkoopt effecten ipv. de gevraagde samenvoeging van rekeningen. Tekst: Ik heb Keytrade gevraagd om 3 effectenrekeningen samen te voegen.Tot mijn grote verbazing gaat Keytrade over tot de verkoop van mijn beleggingen, echt onbegrijpelijk.Bij contact met Keytrade krijg ik volgende feedback :  1) ze beweren dat ik de AANKOOP zelf heb ingegeven via een order (de foutieve actie gaat over een onterechte verkoop)  2) ze beweren dat ikzelf de verkooporders heb geplaatst (wat niet het geval is)  3) ze beweren dat mijn formulier niet correct was ingevuld en ze daarom de orders zelf hebben geplaatst (EN op hun formulier heb ik samenvoegen aangeduid EN in de titel van de mail heb ik samenvoegen geplaatst EN ik heb dit ook nog eens vermeld in de body van de mail.", "Titel: Zeer onpersoonlijk en traag dus bank zeker af te raden wanneer je advies wenst. Tekst: Traag en hierdoor ook erg amateuristisch. Zeker de dienst van de Bank Stock Transfers. Zij houden mij nu al sinds oktober aan het lijntje en er komt maar geen schot in de zaak. Heel onpersoonlijke aanpak en doorgaans pas na een 3 tal weken krijg je een antwoord. Nu wacht ik al van in de kerstperiode op een simpel antwoord. Zeker niet aan te bevelen!", "Titel: Zeer onprofessioneel en onbetrouwbaar. Tekst: Zeer onprofessioneel , als men $ naar CAD wel wisselen moet men eerste naar € gaan en dan naar CAD . Duur in het buitenland en beperkt . Sturen voor het minste dreigbrieven . Zeggen zomaar een margin op , sturen een aangetekend schrijven dat ze al verschillende aanmaningen gegeven hebben wat een regelrechte leugen is . Ze hadden me enkel telefonisch ingelicht en gezegd dat ik er nog een schrijven van zou ontvangen waarna ik 2 maanden tijd kreeg . Allemaal leugens . Geen brief ontvangen , na een maand een aangetekend schrijven met leugens en dan nog dreigen om me aan te geven bij de centrale voor kredieten .Ik heb tot hiertoe niets mis gedaan . Blijf er weg .", "Titel: Bijna 2 maanden wachten op een antwoord… Tekst: Bijna 2 maanden wachten op een antwoord van Keytrade .......Mij doel was klant worden maar gezien de situatie ,beter andere bank zoeken", "Titel: Online bank is mega OFFLINE!!! Tekst: Bespaar je de moeite voor de service die je hier krijgt. Traag en niet bekwaam. Deze bank focust zich op vermogende mensen. Een professionele rekening openen heeft voorrang op een privé rekening, hoewel deze gelijktijdig aangevraagd werden. In geval van echte storingen en problemen ben je geruster bij een grootbank...Wegblijven is de boodschap!", "Titel: Klantendienst zijn prutsers Tekst: Visa kaart was geblokkeerd,  gebeld met klantendienst en laten deblokkeren.  Naar winkel en na eenmaal code ingegeven kaart weer geblokkeerd,  weer klantendienst, weer vrijgegeven en weer eenmaal geprobeerd in winkel. Zo 4x contact gehad en laatste maal werd mij gegarandeerd, echt verzekerd dat ik de kaart zou kunnen gebruiken. Ik had ze nodig om mijn borg van huurwagen te betalen. Wat denk je, weer geblokkeerd. Taxi moeten nemen. Dan een mail gestuurd, via twitter en op facebook vraag gesteld. Na een week de vraag via twitter om gebruikersnaam door re geven. Zou zeggen dat het lachwekkend is maar het is gewoon erg dat er zô prutsers de mensen moeten helpen.", "Titel: Aan het lijntje gehouden Tekst: Na wat research te hebben gedaan besloten om bij Keytrade bank een (gratis) rekening te openen op 8 oktober jl. Alle nodige documenten geüpload.Na een week geen reactie dus voor de eerste keer gebeld, na 2 weken idem, na 3 weken idem en toen bleek plots mijn id kaart niet duidelijk. Onmiddellijk nieuwe foto van doorgestuurd. Na 4 weken geen reactie, na 5 weken idem, na 6 weken geef ik het op.Ik heb dus letterlijk 12 keer gebeld met de klantenservice. Telkens werd mij gezegd dat het snel in orde ging komen want dat alle documenten in orde waren. Telkens werd mij gezegd dat ze mij gingen terugbellen. Geen enkele keer ben ik terug gebeld geweest en nooit is het in orde gekomen. Ik open wel bij een andere bank een rekening.Spijtig...", "Titel: Onbetrouwbaar en slechte service Tekst: Kinderen hebben een rekening en ik vroeg voor hen hardkey aan. Eerst documenten kwijt gespeeld, nogmaals opgestuurd, ze bevestigen ontvangst en nu al bijna 2 maanden nog geen hardkey.Antwoorden niet op mails, pure schande.Ook al problemen gehad met verkoop van aandelen.Absoluut te mijden !", "Titel: Bank met potentieel, maar rotslechte klantenservice Tekst: Keytrade is volgens mij een zeer goede uitdager op de markt, maar heeft nog zeer veel te leren. Ik ben al ruime tijd klant bij hen en sinds 1 jaar is het ook mijn hoofdbank geworden.Wat betreft hun product aanbod staan ze zeer sterk in de markt. Het aanbod is compleet (leningen, debetkaart, kredietkaart, aandelen, fondsen, zoomit, prima online bankieren,...) en wordt nog actief uitgebreid. Ze zijn niet altijd de goedkoopste maar horen toch bij de betere op de markt.Uiteindelijk zit ik daar voor mijn lening, zichtrekening, VISA, pensioensparen (niet meer actief), keyplan en een aantal fondsen.Alles gaat vlot bij Keytrade, zolang je binnen de lijntjes tekent. Moet je ondersteuning vragen dan merk je snel waarom het een low cost bank is. Hun helpdesk is namelijk om depressief van te worden. Mails met iets minder gewoonlijke vragen krijgen compleet geen reactie wat toch wel de nodige frustratie kan opleveren.In mijn geval heeft het mij wel een pak geld opgebracht, want na 1 maand geen reactie (op mijn vraag betreffende mijn lening aanvraag) alsnog telefoon gekregen en toch iets extra in de wacht kunnen slepen waardoor ze onder het aanbod van een andere bank konden gaan.Naast de magere support moet je er ook de soms wel ruwe kantje ervan verdragen. Nieuwe VISA kaarten uitgeven waarvan je de PIN nog niet kan wijzigen (oeps, dat zit in de eerstvolgende update van onze app) moet je als klant maar aanvaarden.Nu daartegenover staat wel een gratis VISA kaart (met gratis verzekering), zichtrekeningen (ook met 2 personen), geld afhalen bij een andere bank, 5 cent krijgen per verrichting, zeer competitieve leningen, gebruiksvriendelijk online webbanking,... Keytrade is een internet bank met een prachtig product aanbod. Ze moeten wel nog leren dat ook een internet bank moet inzetten op een goede klantrelatie en dit zeker niet hoeft met een helpdesk die 24/7 beschikbaar is of met 300 kantoren. Als ze al eens antwoorden binnen een schappelijke termijn op alles soorten vragen via mail, chat of twitter dan verdienen ze hun 5 sterren.", "Titel: 6 maanden gewacht eer de rekening open… Tekst: 6 maanden gewacht eer de rekening open was, dan geen kaart ontvangen. Drama alom. Rekening afsluiten zal ook zolang duren denk ik.... Toch al enkele maanden aan het wachten op mijn geld. Is dit wel een bank? De anderen die ik ken hebben hetzelfde probleem. Moeten dringend stoppen met reclame maken. Zitten met serieus probleem aan personeel, software, hopelijk geen geldgebrek...", "Titel: Amateuristische bankinstelling Tekst: Amateuristische bankinstelling die in de media veel beloven , maar weinig doen .Volledig dossier met de post verstuurd . Men vraagt deze nogmaals op via mail . Dossier wordt door verschillende personen behandeld zodat men na 6 weken nog geen Visa kaart heeft en men de voorwaarden telkens verandert . E-mails zijn in een fout Nederlands ,zodat men als Vlaming er beter weg kan blijven .Heb me uiteindelijk tot een andere bank gewend . Binnen de vier dagen Visa en bankkaart zonder enige verplichting .", "Titel: Komen afspraken niet na en antwoorden niet op mails! Tekst: Ik heb recent een rekening geopend mede door de actie: ontvang 50 euro wanneer u een rekening bij ons opent. Ik voldoe aan alle voorwaarden, de betalingstermijn is vervallen maar nog steeds geen geld. Komt daar bovenop bij dat ik hieromtrent enkel mails heb verstuurd alsook hen gecontacteerd heb via Messenger maar geen antwoord... Ik was van plan bij hen te beleggen maar met zo'n bank wil ik niets te maken hebben. Ver van weg blijven is mijn raad, je zou maar eens serieuze problemen hebben en dan zo'n klantenservice... Een ware schande!", "Titel: Een goeie en niet zo betrouwbare bank Tekst: Een goeie en betrouwbare bank. Aangezien zij een internetbank zijn zonder filialen, hebben ze ook de goedkoopste transactiekosten voor beleggingen. Ook hun internetbankieren platform is overzichtelijk en gebruiksvriendelijk. Daarbovenop zeer aangenaaam dat men 5cent per verrichting als beloning ontvangt.Ik ben al 3-4 jaar een tevreden klant.@Update: Na de tevreden review hier, moet ik jammer genoeg ook een significante tegenvaller melden. De 'banking' is nog steeds tiptop in orde. Maar ik heb sinds kort ook enkele aandelen gekocht bij de 'investing' sectie. Niet alleen, dat er gebruik werd gemaakt van een enigsinds onvoorzichtige plaatsing van een order door GTC/DAG niet te in rekening te hebben gebracht (waar ik niet zou verstaan dat er langs de andere kant dezelfde fout zou zijn gemaakt), is het volgende nog onaangenamer en heeft mij aangezet 'niet zo' te adderen aan de titel.Ik heb de support d.m.v. mail en een telefonisch gesprek op 7 augustus op de hoogte gebracht van het volgende probleem betreft de verkoop van een \"AANDEEL\". De foutmelding was de volgende: Sell LONG order blocked: u kan geen verkoop 'closing' plaatsen onder dit instrument. Dit zou dus van toepassing 'kunnen' zijn indien dit over een OPTIE ging, en is dus complete nonsense wanneer deze foutmelding bij een aandeel tevoorschijnkomt. Nu geen probleem, fouten zijn mogelijk en wanneer Ketytrade daar weet van zou hebben en direct hebben opgelost was hier eigenlijk ook geen enkel probleem geweest. Bij het telefonische contact hebben ze mij dan verteld dat ze dat spoedig in orde gingen brengen nadat zij voor mij deze order ook niet konden sluiten (Het aandeel was op 4.92 SEK wanneer ik deze orders instelde, heb ook markt verkoop geprobeerd maar tevergeefs). De man aan de telefoon zou mij dan terugbellen in de namiddag voor een nieuwe verkooporder in te stellen en deze dan natuurlijk zonder transactiekosten laten doorgaan, dat is nooit gebeurt en ook de mailing met Frederik De Boes van de support heeft niet meer geantwoord na een derde mail met de vraag om dit probleem op te lossen (was duidelijk gepresenteerd, screenshot en dergelijke bijgevoegd in de bijlage). Het aandeel staat vandaag op 3.58 SEK, en de optie is blijkbaar zonder mij op de hoogte te hebben gebracht dan eindelijk in orde gebracht nadat ik hier 22 augustus hun nogmaals van op de hoogte bracht per mail. Alles leuk maar wie zal opdraaien voor de 37,xx% die nu weg is aan de potentiële cash die ik daar zou hebben voor gekregen, ik had het toen met winst, nu met verlies. Ook heb ik een nieuwe limiet ingesteld maar daar zal ik ongetwijfeld de transactiekosten wel van mogen betalen. Dusja niet zo betrouwbaar, bovendien ook nalatig. Dat is de nieuwe beoordeling en 2 sterren aangezien de banking zelf nog steeds zeer goed is.", "Titel: Al heel lang klant als belegger en … Tekst: Al heel lang klant als belegger en nooit echt issues. De site is echter niet zo gebruiksvriendelijk en anno 2018 zijn de transactiekosten voor VS orders nog steeds belachelijk duur. Ze durven nog steeds 29,95$ per transactie. Stel je voor. Zijn er echt mensen die nog aan zo'n tarief handelen..?! Enkel interessant als je in BE aandelen handelt met kleine bedragen. (<2.500)."]